{
  "author": "Luis Cruz",
  "section":
  [
    {
      "content": "<p>Greetings all!  I hope that everyone's holiday season is going well. Since I have a bit of free time on my hands, I thought I would start up a monthly newsletter outlining what is going on in the world of Lupin. I am sending this via the &quot;Special Delivery&quot; mechanism of the group which means everyone gets this via email.  I realize that there are members who have set their group status to not receive emails.  I hope this will not inconvenience anyone; drop me a line if it does.  If the group objects, future newsletters will be posted like any other message.</p><p>So, let's get started!  Hope you enjoy!</p>"
    },
  
    {
      "title": "Pioneer to Release Second Lupin TV Series with Edits",
      "content": "<p>This is currently the hottest Lupin topic making the rounds.  First, let's start with a bit of background.  At Anime Expo in July, Pioneer announced that they had acquired fifty-two episodes of the Lupin the Third TV series and showed clips containing some of the dubbing that had already been done.  As the months passed, it was learned that the episodes were entirely from the second TV series.  What was unknown was if these episodes were going to start from the beginning of the series, from a different point in the series, or if they were going to be a random group of episodes.  Rumors were also in the air that Pioneer was looking to broadcast these episodes on US television, presumably on the Cartoon Network's &quot;Adult Swim&quot; broadcast.</p><p>Spirits were high for the impending release of Lupin on DVD.  Pioneer was set to launch an official website for the show on November 8. November 8 arrived; Reed and I were browsing the site to see what new information regarding the release we could glean.  We found an episode listing and were delighted to see that the episodes that were going to be on the DVD were indeed the initial episodes from the second series. However, there seemed to be a slight problem.</p><p>Reed noticed that the third episode of the series was missing from the episode list.  We both hoped that this was an oversight and did not mean that the episode was going to be left off of the DVD.  The official website went down soon after its launch promising to return after some work was done.  The site soon returned, but the episode was still missing from the list.</p><p>It was then that I decided to post a thread to the studio feedback forum on the &quot;Anime on DVD&quot; forums in the hopes a Pioneer representative would respond and clarify the situation.  After some time had passed with no official response, I emailed the text of the thread to Pioneer hoping to receive an answer.  I still received no response.  Meanwhile, another AoD forum reader found a broadcast listing for the January 2003 Adult Swim block; the rumors turned out to be true.  Lupin was headed for US television!</p><p>Pioneer had still made no public comment regarding the &quot;missing&quot; episode.  Another Lupin follower, Matthew Last, finally managed to shake things up enough to receive a response.  He posted to Anime News Network the information that an episode appeared to be missing.  ANN then directly contacted a representative at Pioneer.  Pioneer then issued a hurried press release the day before Thanksgiving.</p><p>Pioneer acknowledged that the episode would be left off of the DVD as well as the Adult Swim broadcast.  The episode in question is titled <em>Hitler's Legacy</em>; Pioneer felt that the episode would be too controversial and could cause the Lupin franchise to fail if it were aired and placed on the DVD at this time.  They went on to promise that the episode would be released when the Lupin franchise has become established.</p><p>Another new detail was revealed in the press release.  The Japanese licensor gave Pioneer edited masters.  The concern was that certain pieces of music as well as various logos would present copyright and trademark infringement issues.  So, they edited out those elements before handing the masters over to Pioneer.  Pioneer does not have a list of the edits that were made and therefore cannot comment on what particular episodes have been affected.</p><p>So, the good news is that we are getting a lot more Lupin on DVD and on US TV.  The bad news is that it will be an edited Lupin we will see.  As one can imagine, the announcement of the edited masters as well as the delay of an episode stirred up a heated debate on the issue.</p><p>The first DVD is will be released January 28, 2003.  Volume two will be released March 11 with volume three following on April 15.  The first Lupin soundtrack to be released in the US, <em>Sideburn Club Mix</em>, will also be released on January 28.  This CD appears to be a compilation of tracks off of the <em>Punch the Monkey</em> series of soundtracks that were released in Japan.</p>",
      "links":
  		[
  		  {
    			"title": "The AoD thread that started it all",
    			"url": "http://forums.animeondvd.com/dcboard.php?az=show_mesg&forum=10&topic_id=8592&mesg_id=8592",
  				"external": true,
  				"expired": true
			  },
			  {
  		    "title": "Additional AoD thread debating the situation",
  				"url": "http://forums.animeondvd.com/dcboard.php?az=show_mesg&forum=8&topic_id=19284&mesg_id=19284",
  				"external": true,
  				"expired": true
				},
        {
          "title": "Early review of the first DVD volume",
          "url": "http://www.animeondvd.com/reviews2/disc_reviews/1656.php",
          "external": true,
          "expired": false
  		  },
  			{
  			  "title": "Pioneer's official Lupin site",
  				"url": "http://www.lupinofficial.com/",
  				"external": true,
  				"expired": false
  			}
      ]
    },
 
    {
      "title": "Lupin the Third Manga Debuts in TokyoPop's 100% Authentic Manga Line",
      "content": "<p>Also announced back in July at Anime Expo was the fact that TokyoPop had obtained the rights to a Lupin manga series.  This turned out to be the original Lupin manga series.  The first volume has finally hit the streets, and it looks great!  It contains the first nine stories and is completely in english save for the sound effects and certain signs.  The only complaint about TokyoPop's effort is the misspelling of Fujiko and Jigen as &quot;Fugiko&quot; and &quot;Gigen&quot;.</p><p>Despite this error, TokyoPop has done a great job bringing this classic to an english audience.  Volume two is set to be released February 4 and volume three is set to be released April 8.</p>",
      "links":
        [
          {
            "title": "TokyoPop's official Lupin site (contains sample pages)",
            "url": "http://www.tokyopop.com/dbpage.php?propertycode=LUP&amp;categorycode=BMG",
            "external": true,
            "expired": true
          },
          {
            "title": "Review of the first volume",
            "url": "http://forums.animeondvd.com/dcboard.php?az=show_mesg&forum=24&topic_id=6345&mesg_id=6345",
            "external": true,
            "expired": false
          },
          {
            "title": "Review of the first volume",
            "url": "http://forums.animeondvd.com/dcboard.php?az=show_topic&forum=24&topic_id=6478&mesg_id=6478",
            "external": true,
            "expired": false
          }
        ]
    },
			
    {
      "title": "Upcoming Releases &amp; Recently Released",
      "content": "<p><em>Lupin the 3rd:  Dragon of Doom</em>, a.k.a. <em>Zantetsuken</em>, is set to be the third DVD release from Funimation and will hit the streets on February 11.</p><p><em>Lupin III: Majutsu-Ou no Isan</em> for the PS2 hit the streets on November 26.  I have not seen any official reviews, but various gaming message board posters have been complimenting the game.  The gameplay is similar to Metal Gear Solid.</p><dl><dt>Official site (Japanese):</dt><dd><a href=\"http://www.lupin-game.com/\">Lupin-Game.com</a></dd></dl><p><em>Pursuit of Harimao's Treasure</em>, Funimation's second DVD release, hit the streets on September 24.  If you haven't picked it up yet, what are you waiting for?</p><dl><dt>Reviews:</dt><dd><a href=\"http://www.animeondvd.com/reviews2/disc_reviews/1014.php\">View the review</a></dd><dd><a href=\"http://www.animeondvd.com/reviews2/alt_reviews/773.php\">View the review</a></dd></dl><p><em>Episode:0 First Contact</em>, this year's TV special, was released on DVD in Japan on October 23.  I bought my copy, and what can I say other than &quot;Wow!&quot;.  This is the best TV special I have seen and is probably the best special to date.</p><dl><dt>Review:</dt><dd><a href=\"http://www.animeondvd.com/reviews2/disc_reviews/1913.php\">View the review</a></dd></dl><p><em>Lupin III: Umi ni Kieta Hihou</em> for the GameCube was announced for a December release.  Unfortunately, no official site or recent news about this title has surfaced.  The title is set to be a digital &quot;Choose Your Own Adventure&quot; comic.</p><p>Diamond Comics is planning on releasing US versions of popular Lupin toys in the US.  Their line-up includes releasing the Medicom line of dolls.</p><dl><dt>Details:</dt><dd><a href=\"http://www.figures.com/databases/action.cgi?setup_file=fignews2.setup&amp;category=actionfigures&amp;topic=6&amp;show_article=997\">View the article</a></dd></dl>"
    },

    {
      "title": "Useful Group Tips",
      "content": "<p>I am sure that all of you know that this group is a great way to keep track of the world of Lupin via email.  But did you know that the group offers so much more than nifty emails in your inbox?</p><p>The <a href=\"http://groups.yahoo.com/group/lupinthethird/\">group's homepage</a> holds plenty of treasure for the Lupin junkie.  The &quot;Links&quot; section contains links to Lupin sites, DVD reviews, as well as links to other useful sites and software for the general anime junkie.  The &quot;Files&quot; section contains fan fiction, wallpapers, icons, scripts, and so much more.  Want a place to display your own Lupin fan art?  Look no further than the &quot;Photos&quot; section.  The &quot;Database&quot; section also contains plenty of Lupin ringtones for your favorite mobile phone.</p><p>You can also change how you receive emails from the group as well.  If you want to receive individual emails, a daily digest, or just want to read the latest messages via the group homepage, just click on the &quot;Edit My Membership&quot; link that appears on the group homepage.</p>"
    },

    {
      "title": "Parting Words",
      "content": "<p>While the Pioneer news is disappointing, I cannot be happier with the state of Lupin in the US these days.  Funimation is steadily releasing their catalog of ten Lupin TV specials.  Toys are on the way.  Manga is being steadily released.  And even soundtracks are making their way here.  I never thought I would see this much Lupin released commercially in the US, and all I can say is &quot;it's about damn time&quot;. The only thing missing is a re-release of <em>Cliff Hanger</em>. :)</p><p>Hope you enjoyed reading this.  See you next month!</p>"
    }
  ]
}