{
  "author": "Luis Cruz",
  "section":
  [
    {
      "content": "<p>Nothing foolish in this issue; just business as usual for us.</p>"
    },

    {
      "title": "Send in the clones...",
      "content": "<p>With the usual Pioneer fan-fare for a Lupin title (which is relatively none), Pioneer has listed on their website that their release of the first Lupin theatrical film <em>Secret of Mamo</em> will be on 29 July. Consumers will now have a better option than paying $80 or more on eBay for the weak, dub only Image release.</p>",
      "links":
        [
          {
            "title": "Pioneer's listing",
            "url": "http://www.pioneeranimation.com/titles.php?id=479",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "Spotting bootlegs",
      "content": "<p>On a related note, be careful and informed when you purchase Lupin DVDs. This topic is coming up more frequently on the group.  Members have purchased the first TV series with english subs for a cheap price on eBay and through other disreputable on-line merchants.  Do not be lured in by the cheap price; these and 99.9% of the other cheap Lupin DVDs on eBay are bootlegs.</p><p>I will not turn this into a morality lecture; just be careful out there people.  Do your homework so you know what you are buying.  Support the legitimate releases in the US, UK, Italy, Japan, and elsewhere. Hopefully, Pioneer will take the initiative and start pulling those auctions off of eBay.</p>",
      "links":
        [
          {
            "title": "How to spot bootlegs -- Pirate Anime FAQ",
            "url": "http://www.digital.anime.org.uk/piratefaq.html",
            "external": true,
            "expired": false
          },
          {
            "title": "Vap -- the company releasing the official Japanese DVDs",
            "url": "http://www.vap.co.jp/lupin/",
            "external": true,
            "expired": false
          },
          {
            "title": "CD Japan -- sells legitimate Japanese DVDs; search for Lupin DVDs and compare the specifications and artwork to the cheap, bootleg versions you see elsewhere",
            "url": "http://www.cdjapan.co.jp/",
            "external": true,
            "expired": false
          }
        ]
    },

    {
      "title": "Lupin sneaking his way onto the US PS2?",
      "content": "<p>Ever vigilant Reed Nelson found an interesting tidbit in the video game section of BestPrices.com.  They have a pre-order page for an action video game titled <em>Lupin the 3rd</em> set to be released on 24 Sept. by Bandai/Dreamworks for the PS2.  Could Bandai be translating the recent Japanese release <em>Majutsuou no Isan</em>?  Only time will tell...</p>",
      "links":
        [
          {
            "title": "Pre-order page",
            "url": "http://www.uln.com/cgi-bin/vlink/045557180188IE.html",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "Initial Adult Swim run is over",
      "content": "<p>The initial run of Lupin episodes on Adult Swim is officially over. While no official numbers have been released, one would have to say that the broadcast has been a success for both the Cartoon Network and Pioneer.  The number of new members that have joined the group because of the broadcast is proof enough for me.</p><p>When will new episodes air on Adult Swim?  Hard to say; it will depend on how quickly Pioneer can dub more as well as when Cartoon Network wants to adjust the Adult Swim schedule again.  I imagine that Lupin will steal Trigun's spot back once Trigun has been aired completely twice.</p>"
    },

    {
      "title": "Lupin Fan Art Festival 2003",
      "content": "<p>While the festival has been over for awhile, it is safe to say that it was a success.  If you have yet to view the gallery of fan art, take a few minutes and give it a look.  There is a lot of great art in there (<a href=\"http://www.bell-tree.com/~lupinfes2003/illust/akio01.htm\">This one</a> is my personal favorite).  Thanks goes to member &quot;sevencrown&quot; for helping bring about this great new tradition!</p>",
      "links":
        [
          {
            "title": "Information on the 2004 festival",
            "url": "http://lupinfes2003.fc2web.com/",
            "external": true,
            "expired": false
          },
          {
            "title": "The 2003 gallery",
            "url": "http://www.bell-tree.com/~lupinfes2003/sakuhin2.htm",
            "external": true,
            "expired": false
          }
        ]
    },

    {
      "title": "Upcoming Releases",
      "content": "<dl><dt>7 April:</dt><dd><em>Rupan III:  Fuma Conspiracy</em> (DVD, AnimEigo)</dd><dt>8 April:</dt><dd><em>Lupin the 3rd TV 2:  Love Heist</em> (DVD, Pioneer)</dd><dd><em>Lupin the 3rd Original Soundtrack</em> (CD, Pioneer)</dd><dd><em>Lupin III Volume 3</em> (manga, TokyoPop)</dd><dt>20 May:</dt><dd><em>Lupin the 3rd:  Voyage to Danger</em> (DVD, Funimation)</dd><dt>10 June:</dt><dd><em>Lupin III Volume 4</em> (manga, TokyoPop)</dd><dt>8 July:</dt><dd><em>Lupin the 3rd TV 3:  The Family Jewels</em> (DVD, Pioneer)</dd><dd><em>Lupin III Volume 5</em> (manga, TokyoPop)</dd><dt>29 July:</dt><dd><em>Lupin the 3rd the Movie:  Secret of Mamo</em> (DVD, Pioneer)</dd><dt>5 August:</dt><dd><em>Lupin III Volume 6</em> (manga, TokyoPop)</dd><dt>Missing in Action:</dt><dd><em>Lupin III: umi ni kieta hiho</em> (GameCube, Asmik Ace)</dd><dd>Lupin toys (Diamond Comics)</dd></dl>"
    },

    {
      "title": "Parting Words",
      "content": "<p>With Pioneer announcing a release date for <em>Mamo</em>, one has to wonder if the early rumors about their acquisition of all the TV series and other specials are true.  If it is, let's hope Pioneer can speed up production so the US can watch as much Lupin as Japan can.</p><p>Where are the Lupin toys, Diamond Comics?  You should have had something out during the initial run of Lupin on Adult Swim.  We all want to see our favorite thief sitting next to Goku and the Gundams on the shelf.</p><p>If the Japanese PS2 game is really being localized for the US, I will finally have to break down and buy a PS2 (or beg for one for Xmas ^_^).</p><p>We are nearing the 300 member mark for the group, and posting is at an all-time high.  I would like to say welcome and thank you for joining to all the new members.  Keep those posts, fan art, and fan fics coming!</p><p>Farewell, lovely Lupin fans.  See you in thirty!</p>"
    }
  ]
}