{
  "author": "Luis Cruz",
  "section":
  [
    {
      "content": "<p>Ah, the end of summer nears... So begins the back to school rush.  Why not grab your favorite beverage, take a deep breath, and relax for one last time by reading this month's newsletter...</p><p>Ready?  Let's begin...</p>"
    },

    {
      "title": "Funimation interviewing Monkey Punch for upcoming DVDs",
      "content": "<p>I have two words that immediately spring to mind... WOO &amp; HOO!  Funimation representative Lance Heiskell posted a thread on the AnimeOnDVD.com forums stating that they would be interviewing Monkey Punch for some upcoming Lupin DVDs.</p><p>Many people posted some great questions to the thread; unfortunately, Lance did not divulge what DVDs the interviews would be for or when the next DVD would be out; he was saving that information for the BAAF panel.  However, I think we all know of at least one title that should have an interview on it *cough* <em>Dead Or Alive</em> *cough*. ;)</p><p>At the BAAF panel, Lance finally announced that the next two Lupin titles due out are <em>Nostradamus</em> and <em>Dead Or Alive</em>.  Let's hope that DOA is the title slated for this winter.</p>",
      "links":
        [
          {
            "title": "AoD thread about MP interview",
            "url": "http://forums.animeondvd.com/showthreaded.php?Cat=&Board=region1&Number=152907",
            "external": true,
            "expired": true
          },
          {
            "title": "AoD thread about Funimation BAAF panel",
            "url": "http://forums.animeondvd.com/showthreaded.php?Cat=&Number=158995",
            "external": true,
            "expired": true
          },
          {
            "title": "Funimation web site",
            "url": "http://www.funimation.com/",
            "external": true,
            "expired": false
          }
        ]
    },

    {
      "title": "Diamond Comics finally releasing their first Lupin item",
      "content": "<p>While chatting with one group member, I decided to browse the Diamond Comics site to see if there was any news about the Lupin toys.  Much to my amazement, there was.</p><p>It looks like Diamond's first item will be the Lupin &amp; Mamo figure set that was recently released in Japan by Medicom.  Lupin is twelve inches tall, highly articulated, and has some extra items while Mamo is eight inches tall and has limited articulation.  Not entirely sure when this will hit stores, but the item code is listed as <strong>AUG03 3260</strong>.  The set will retail for US$125.</p><p>If memory serves me correctly, I thought Diamond Comics stated that they wanted to make the various Lupin items more afforadable for the US fans (cannot find the article now to back this up).  So, the price tag of $125 seems pretty steep.  You can get the Japanese set at Hobby Link Japan for $106 ($82 + roughly $24 for shipping).  Will be interesting to see what stores the US version hits and if retailers sell it at the $125 price tag.</p>",
      "links":
        [
          {
            "title": "Diamond Comics preview",
            "url": "http://toychest.diamondcomics.com/toys/08_03/14_lupinthe3rd.htm",
            "external": true,
            "expired": true
          },
          {
            "title": "Hobby Link Japan's order page",
            "url": "http://www.hlj.com/cgi-perl/hljpage.cgi?MEDSC-40",
            "external": true,
            "expired": true
          }
        ]
    },
    
    {
      "title": "Lupin fans giving back to the community",
      "content": "<p>There has been a recent burst of activity among the artistically inclined Lupin fans.  First, group member <em>Fujiko liz</em> has created a music video.  She uses Sam the Sham's <em>Little Red Riding Hood</em> to show off her thoughts about the nature of Lupin and Fujiko's relationship.  While the quality of her video sources was not great, it is a well put together video that you should definitely check out.</p><p>Tired of looking at Manga Entertainment's boring cover art for their release of <em>Cagliostro</em>?  AnimeOnDVD.com forum member <em>PandaPhil</em> has the solution for you.  He has created a custom DVD cover that you can print out to replace the Manga cover.  He did an excellent job on the cover; maybe we can convince him to make one for Pioneer's <em>Mamo</em> release...</p><p>Last, you can always submit your own fan art or fan fiction to the group photos section or files section.  Group member <em>migeru85</em> has submitted his artwork recently; step up and let the world see your talent!</p>",
      "links":
        [
          {
            "title": "<em>Fujiko liz</em>'s <em>Little Red Riding Hood</em> video",
            "url": "http://www.animemusicvideos.org/members/members_videoinfo.php?v=21180",
            "external": true,
            "expired": true
          },
          {
            "title": "<em>PandaPhil's Cagliostro</em> cover",
            "url": "http://www.aquafans.com/lupin3.zip",
            "external": true,
            "expired": true
          },
          {
            "title": "Group photo archive",
            "url": "http://groups.yahoo.com/group/lupinthethird/lst/",
            "external": true,
            "expired": false
          },
          {
            "title": "Group files archive",
            "url": "http://groups.yahoo.com/group/lupinthethird/files/",
            "external": true,
            "expired": false
          }
        ]
    },
			
    {
      "title": "Aspect ratio details for upcoming R2 box set",
      "content": "<p>As reported back in the July newsletter, a limited edition box set is being released in Japan in October.  The set will contain <em>Mamo</em>, <em>Babylon</em>, <em>Fuma</em>, and <em>Secret Files</em>.  Initially, the information had all the titles as being 16:9 anamorphic.  Since <em>Fuma</em> was not originally made in a letterbox format, there was speculation on whether or not it would be cropped into an anamorphic print.</p><p>AoD forum member <em>Bods</em> recently received a flyer from CD Japan with more details.  <em>Fuma</em> will be presented in its original 4:3 (fullscreen) ratio while <em>Mamo</em> and <em>Babylon</em> will be presented in 16:9 anamorphic letterbox.  <em>Secret Files</em> is listed as &quot;Standard (ichibu vista size letterbox)&quot;; this likely means that the majority of the <em>Secret Files</em> is 4:3 while the pilot film is presented letterboxed.</p><p>This is good news all around; don't forget to pre-order your box soon.  October is closer than you think!</p>",
      "links":
        [
          {
            "title": "Bods' AoD posting",
            "url": "http://forums.animeondvd.com/showthreaded.php?Cat=&Number=150735",
            "external": true,
            "expired": true
          },
          {
            "title": "CD Japan pre-order page",
            "url": "http://www.cdjapan.co.jp/detailview.html?KEY=TDV-2735D",
            "external": true,
            "expired": true
          },
          {
            "title": "DiscStation pre-order page",
            "url": "http://www.discstation.co.jp/VSSHOP/cgi/DS_goods_item.aspx?ns=TDV-2735D",
            "external": true,
            "expired": true
          }
        ]
    },
    
    {
      "title": "Pre-order this year's TV special",
      "content": "<p>Vap has recently updated their Lupin web site and has included the DVD &amp; VHS release date of this year's TV special <em>Lupin the Third: Otakara Henkyaku Dai-sakusen!!</em>.  A DVD &amp; CD combo version, DVD only version, and a VHS version will be available on 22 October.</p>",
      "links":
        [
          {
            "title": "DVD/CD pre-order at CD Japan",
            "url": "http://www.cdjapan.co.jp/detailview.html?KEY=VPBY-11827",
            "external": true,
            "expired": true
          },
          {
            "title": "DVD only pre-order at CD Japan",
            "url": "http://www.cdjapan.co.jp/detailview.html?KEY=VPBY-11828",
            "external": true,
            "expired": true
          },
          {
            "title": "VHS pre-order at CD Japan",
            "url": "http://www.cdjapan.co.jp/detailview.html?KEY=VPVY-68240",
            "external": true,
            "expired": true
          },
          {
            "title": "Vap's Lupin web site",
            "url": "http://www.vap.co.jp/lupin/",
            "external": true,
            "expired": false
          }
        ]
    },
    
    {
      "title": "The weekly chat expands...",
      "content": "<p>After having some successful runs of the weekly chat, Reed and I have decided to expand things a bit.  Starting this month, we will have two weekly chats, one every Tuesday and one every Thursday.</p><p>The time remains the same for both chat sessions; chats will begin at 9PM EST.  I will still be the &quot;host&quot; of the Tuesday chat with Reed as the &quot;host&quot; of the Thursday chat.  There is also one other change we are making to the chats.</p><p>Starting this month, only one prize will be given out per month in the chats.  Also, the chat having the prize giveaway will not be announced.  So, if you want to win a prize, you will have to show up to the chats regularly as the prize can be given away on any date at any time.</p><p>This will hopefully encourage more people to chat regularly as well as stretch out our thinning prize budget.  Hope to see in the chat room soon!</p>"
    },

    {
      "title": "Upcoming &amp; Recent Releases",
      "content": "<dl><dt>5 August:</dt><dd><em>Lupin III Volume 6</em> (manga, TokyoPop)</dd><dt>9 September:</dt><dd><em>Lupin III Volume 7</em> (manga, TokyoPop)</dd><dt>7 October:</dt><dd><em>Lupin III Volume 8</em> (manga, TokyoPop)</dd><dt>14 October:</dt><dd><em>Lupin the 3rd TV 4:  Thieves' Paradise</em> (R1 DVD, Pioneer)</dd><dt>22 October:</dt><dd><em>Lupin the Third: Otakara Henkyaku Dai-sakusen!!</em> (R2 DVD & CD, Vap)</dd><dd><em>Lupin the Third: Otakara Henkyaku Dai-sakusen!!</em> (R2 DVD, Vap)</dd><dd><em>Lupin the Third: Otakara Henkyaku Dai-sakusen!!</em> (VHS, Vap)</dd><dt>24 October:</dt><dd><em>Lupin III DVD Limited Box</em> (R2 DVD, TMS)</dd><dd><em>Lupin the Third:  Plot of the Fuma Clan</em> (R2 DVD, TMS)</dd><dd><em>Lupin the Third:  Legend of the Gold of Babylon</em> (R2 DVD, TMS)</dd><dd><em>Lupin the Third:  Lupin vs. the Clone</em> (R2 DVD, TMS)</dd><dt>3 November:</dt><dd><em>Lupin the 3rd</em> (US PS2, Bandai/Dreamworks)</dd><dt>4 November:</dt><dd><em>Lupin III Volume 9</em> (manga, TokyoPop)</dd><dt>9 December:</dt><dd><em>Lupin III Volume 10</em> (manga, TokyoPop)</dd><dt>6 January 2004:</dt><dd><em>Lupin III Volume 11</em> (manga, TokyoPop)</dd><dt>Unknown Release Date:</dt><dd>Lupin the 3rd &amp; Mamo 12-inch Action Figure Set (Diamond Comics)</dd></dl>"
    },

    {
      "title": "Parting Shots",
      "content": "<p>Ah... Funimation is finally making a wish come true by announcing <em>Dead Or Alive</em> as one of their next titles.  Part of me hopes it is the very next DVD they release while the other part hope <em>Nostradamus</em> is the next one released.</p><p>If <em>Nostradamus</em> is released first, it gives Funimation a better shot at getting a director's commentary for DOA.  The interview they set up with Monkey Punch might be the foot in the door to getting a dream come true for Lupin fans.  Even if they do not get the commentary, the interview itself will be a great extra.</p><p>It's a good day to be a US Lupin fan...</p>"
    }
  ]
}