{
  "author": "Luis Cruz",
  "section":
  [
    {
      "content": "<p>Not much in the news lately, so here is a nice, light newsletter for your enjoyment.</p>"
    },

    {
      "title": "Interview with Monkey Punch",
      "content": "<p>Anime News Network recently posted an interview with Monkey Punch.  It has a lot of good information in it.  Hopefully, Funimation's interview that will be on the upcoming <em>Dead or Alive</em> DVD will be as informative.</p>",
      "links":
        [
          {
            "title": "The Interview",
            "url": "http://www.animenewsnetwork.com/feature.php?id=164",
            "external": true,
            "expired": false
          }
        ]
    },

    {
      "title": "Chat news",
      "content": "<p>The weekly chats have been picking up steam as more people are showing up regularly.  The Thursday chat is still running a bit slow, but Tuesday's chat is becoming busier each week.  This month's prize will be given away this upcoming Tues., the 18th.  For December, Lupin Claus will be giving away one or more prizes every Tues. during the chat.  Everyone is eligible including those that have won prizes before.</p><p>There are a lot of nifty prizes in the pile including a copy of Pioneer/Geneon's <em>Mamo</em> DVD.  Once the prizes are gone, they are gone for good.  That's right, no more scheduled prize give-aways after Dec., so make sure to come to the chats for your chance to win!</p></td>"
    },

    {
      "title": "PS2 game delayed",
      "content": "<p>The Nov. release date has come and gone; unfortunately, no new official release date has been given.  Most places are listing it for Jan. though some are listing it for Feb.</p>"
    },

    {
      "title": "Upcoming &amp; Recent Releases",
      "content": "<dl><dt>14 October:</dt><dd><em>Lupin the 3rd TV 4:  Thieves' Paradise</em> (R1 DVD, Pioneer)</dd><dt>22 October:</dt><dd><em>Lupin the Third: Otakara Henkyaku Dai-sakusen!!</em> (R2 DVD & CD, Vap)</dd><dd><em>Lupin the Third: Otakara Henkyaku Dai-sakusen!!</em> (R2 DVD, Vap)</dd><dd><em>Lupin the Third: Otakara Henkyaku Dai-sakusen!!</em> (VHS, Vap)</dd><dt>24 October:</dt><dd><em>Lupin III DVD Limited Box</em> (R2 DVD, TMS)</dd><dd><em>Lupin the Third:  Plot of the Fuma Clan</em> (R2 DVD, TMS)</dd><dd><em>Lupin the Third:  Legend of the Gold of Babylon</em> (R2 DVD, TMS)</dd><dd><em>Lupin the Third:  Lupin vs. the Clone</em> (R2 DVD, TMS)</dd><dt>4 November:</dt><dd><em>Lupin III Volume 9</em> (manga, TokyoPop)</dd><dt>9 December:</dt><dd><em>Lupin III Volume 10</em> (manga, TokyoPop)</dd><dt>6 January 2004:</dt><dd><em>Lupin III Volume 11</em> (manga, TokyoPop)</dd><dt>14 January 2004:</dt><dd><em>Lupin the 3rd TV 5: Mission: Irresistible</em> (R1 DVD, Geneon)</dd><dt>2 March 2004:</dt><dd><em>Lupin III Volume 12</em> (manga, TokyoPop)</dd><dt>4 May 2004:</dt><dd><em>Lupin III Volume 13</em> (manga, TokyoPop)</dd><dt>Unknown Release Date:</dt><dd>Lupin the 3rd &amp; Mamo 12-inch Action Figure Set (Diamond Comics)</dd><dd><em>Lupin the 3rd</em> (US PS2, Bandai/Dreamworks)</dd></dl>"
    },

    {
      "title": "Parting shots",
      "content": "<p>Been a slow month or two for news, but my DVD box set has been keeping me company. :)</p>"
    }
  ]
}