{
  "author": "Luis Cruz",
  "section":
  [
    {
      "content": "<p>It's summertime!  And also time for the latest installment of the group newsletter.  Grab a refreshing beverage and quench your thirst for Lupin information...</p>"
    },

    {
      "title": "Lupin back on Adult Swim",
      "content": "<p>After a brief hiatus, new episodes of Lupin started airing on 19 May at midnight during the Cartoon Network's &quot;Adult Swim&quot; block.  New episodes will continue to air until 5 June.  It will take another but brief hiatus and air at 1:30 AM.  No new episodes appear to be on tap in the near future however as it will begin broadcasting from the first episode.</p>",
      "links":
        [
          {
            "title": "Adult Swim schedule",
            "url": "http://schedule.adultswim.com/servlet/ScheduleServlet?action=viewAll&amp;showID=325195&amp;show=Lupin+the+3rd",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "Pioneer reveals Mamo DVD details",
      "content": "<p>With the release of <em>Secret of Mamo</em> on DVD just over a month away, Pioneer has revealed some great information about the release. First, Pioneer revealed some technical details at their Anime Central panel.  The DVD will contain a 5.1 English soundtrack, but even better, the Japanese licensor is creating an anamorphic print that Pioneer will be using.</p><p>Second, the listing at RightStuf.com was updated recently to detail the technical specifications and what extras will be included.  The DVD will contain a new English dialog 5.1 soundtrack, the original Japanese soundtrack with optional English subtitles, interactive animated menus, scene access, conceptual art gallery, excerpts from the original movie program, and a promo poster.</p><p>Kudos to Pioneer for picking up some extras for this release.  This DVD is shaping up to be quite a treat for Lupin fans beyond the fact that we will be getting Mamo on DVD (again) before Japan does.</p><p>One does wonder though if the licensor will be making any sort of copyright edits to the anamorphic print they will be supplying to Pioneer.  Pioneer also revealed at Anime Central that the licensor proactively removed some copyright materials from the masters they gave to Pioneer due to lawsuits brought against them in Europe. I, and I am sure other intrepid Lupin fans as well, will be checking my Streamline version against the Pioneer release carefully to see if this is the case.</p><p>Regardless of copyright edits, it will be great to have a reasonably priced version of Mamo on the shelves instead of having to try to get the Streamline/Image DVD off of eBay for $80 or more.</p>"
    },

    {
      "title": "And on a related note...",
      "content": "<p>There certainly has been no end of discussion about Mamo on the group lately and in the past.  Part of these discussions have revolved around the 1978 dub of Mamo.  What?  You say you have never heard of the '78 dub?  Not surprising as this dub has only managed to survive through multi-generation VHS copies.  The dub was originally produced back in 1978 so that Mamo could be shown on trans-Atlantic flights.  There has been no known official release of this dub though.</p><p>Since the original masters have probably been lost forever, Pioneer could not include this dub on their upcoming release.  Fear not! You can still listen to this dub!  Dale &quot;Mr. Lupin&quot; Englehardt had his own copy of the dub and graciously ripped the audio into a WMA file on his PC.  After passing it along to me, I created a MP3 and an Ogg Vorbis version of the audio as well.</p><p>One problem remained... how to distribute these large audio files to the rest of the Lupin community?  Group member Abraham Gaponoff to the rescue!  Abraham is graciously hosting all three versions of the audio for download.  If you grab the audio, be sure to send Dale and Abraham a &quot;thank you&quot; email for helping to keep a piece of Lupin history alive.</p>",
      "links":
        [
          {
            "title": "My review of the '78 dub &amp; comparison w/the Streamline dub",
            "url": "http://groups.yahoo.com/group/lupinthethird/message/1674",
            "external": true,
            "expired": false
          },
          {
            "title": "WMA audio (72 Mb)",
            "url": "http://www.doomportables.org/~lupin/1978_mamo_dub.wma",
            "external": true,
            "expired": true
          },
          {
            "title": "MP3 audio (96 Mb)",
            "url": "http://www.doomportables.org/~lupin/1978_mamo_dub.mp3",
            "external": true,
            "expired": true
          },
          {
            "title": "Ogg Vorbis audio (89 Mb)",
            "url": "http://www.doomportables.org/~lupin/1978_mamo_dub.ogg",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "Bandai officially announces Lupin PS2 game at E3",
      "content": "<p>The various online pre-order pages for a PS2 Lupin III game in the US were correct, except for the release date.  Bandai used the gaming industry's biggest event to announce that a US localized version of <em>Lupin III:  Majutsu-Ou no Isan</em> will be released on 3 November. Lucky group member &quot;unclejun76&quot; was at E3 and snagged some playing time on the Japanese version of the game.  The US release will be dubbed in English and all text will be in English as well.  No word on if Bandai is using one of the existing Lupin casts to do the dubbing or not.</p>",
      "links":
        [
          {
            "title": "E3 flyer",
            "url": "http://groups.yahoo.com/group/lupinthethird/files/Miscellaneous/",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "Funimation's lack of crediting Japanese voice actors",
      "content": "<p>While I have been enjoying Funimation's DVD releases, it has bothered me that they have yet to have the Japanese voice actors listed in the credits.  I decided to drop them a line via their web site feedback form and try to find out why this is. Here is my initial message:</p><blockquote><p>Greetings; I am the webmaster for the Lupin III Encyclopedia. I have been enjoying your Lupin DVD releases and look forward to each new release.  I submit a review for each title to AnimeOnDVD.com as well.</p><p>I have one question regarding your releases.  On each DVD, you do have a set of English language credits that credit various members of the Japanese staff that worked on the title.  However, you never seem to credit the Japanese voice actors.</p><p>I am curious as to why this is.  Is it purely a marketing decision designed to promote your dub cast?  Or is it some form of contractual obligation that prevents you from crediting the Japanese actors?</p><p>Thank you for your time.</p></blockquote><p>And this was their response to me:</p><blockquote><p>Since it is dubbed, the Japanese voice actors are not heard.  It would be confusing to credit two sets of voice actors, one of which is not heard in the dubbed version.</p></blockquote><p>This makes little sense to me; who exactly would be confused by listing the Japanese voice actors when there is a Japanese language track on the DVD?</p><p>I have sent them this response:</p><blockquote><p>Greetings; I contacted you regarding a question I had about your Lupin the 3rd DVD releases.  In summary, I asked why the subtitles for the Japanese audio did not contain a translation of the Japanese voice actor's names.  This was the response I received back:</p><p>&lt;snip&gt;</p><p>How and to whom would it be confusing?  There are two language tracks on the Lupin DVDs.  Why would it be confusing to properly credit the voice talents that are performing on the Japanese language track?</p><p>You have been authoring the DVDs to use alternate angles for each language track.  When you select the Japanese language track, the angle used does not display any subtitles during the opening credits.  This angle could easily have subtitles crediting the Japanese voice talent; there would be no confusion because the English voice talent is credited via subtitles when I switch to the English language version.</p><p>Plus, it has been a standard practice in the industry for years to credit both sets of voice actors on a dual language release.  At the very least, companies roll the Japanese credits at the end of the title first and then roll the English credits after that.</p><p>My apologies for belaboring this point, but your response makes little sense to me given the state and current practices of the industry at this time.</p><p>Thank you.</p></blockquote><p>Hopefully, I will receive a response back that can shed more light on their decision.  From where I am sitting at the moment, their decision is purely an attempt to market their dub cast.  I am not opposed to that, but it should not be at the expense of properly crediting the people who originally worked on the show in the first place.</p>"
    },

    {
      "title": "Lupin GameCube game not set for a US release",
      "content": "<p>Last month's &quot;Parting Shots&quot; section mentioned that there were some rumblings that the delayed Japanese GameCube game might be coming to the US as well.  Sadly, the rumblings were unfounded as the person who started them did not read an article correctly.  Here is the article in question (from page 28 of <em>GMR</em>):</p><blockquote><p>In other news, a bird on a wire landed on our shoulder this morning and told us that Bandai's GameCube title Chibi Robo (chibi means small) will arrive in the United States later this year, and Banpresto's Lupin the 3rd PS2 game is also en route.</p></blockquote>Let's hope that the game will at least see the light of day in Japan.",
      "links":
        [
          {
            "title": "The thread that started it all",
            "url": "http://forums.toonzone.net/showthread.php?threadid=73040",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "Upcoming &amp; Recent Releases",
      "content": "<dl><dt>20 May:</dt><dd><em>Lupin the 3rd:  Voyage to Danger</em> (R1 DVD, Funimation)</dd><dt>10 June:</dt><dd><em>Lupin III Volume 4</em> (manga, TokyoPop)</dd><dt>8 July:</dt><dd><em>Lupin the 3rd TV 3:  The Family Jewels</em> (R1 DVD, Pioneer)</dd><dd><em>Lupin III Volume 5</em> (manga, TokyoPop)</dd><dt>29 July:</dt><dd><em>Lupin the 3rd the Movie:  Secret of Mamo</em> (R1 DVD, Pioneer)</dd><dt>5 August:</dt><dd><em>Lupin III Volume 6</em> (manga, TokyoPop)</dd><dt>9 September:</dt><dd><em>Lupin III Volume 7</em> (manga, TokyoPop)</dd><dt>14 October:</dt><dd><em>Lupin the 3rd TV 4:  Thieves' Paradise</em> (R1 DVD, Pioneer)</dd><dt>3 November:</dt><dd><em>Lupin the 3rd</em> (US PS2, Bandai/Dreamworks)</dd><dt>Missing in Action:</dt><dd><em>Lupin III: umi ni kieta hiho (Japanese GameCube, Asmik Ace)</em></dd><dd>Lupin toys (Diamond Comics)</dd></dl>"

    },

    {
      "title": "Parting Shots",
      "content": "<p>Not much to add this time around; just doing a lot of waiting.</p><ul><li>Waiting to hear what Funimation is planning to release on DVD next.</li><li>Waiting for the next manga volume to come out.</li><li>Waiting to see what the next special to air in Japan will be.</li><li>Waiting for <em>Mamo</em> on DVD (again).</li><li>Waiting for Diamond Comics to release the toys in the US.</li><li>Waiting for Pioneer to do something about all the eBay bootlegs.</li><li>Waiting to see if the GameCube game will ever be released.</li></ul><p>Farewell, lovely Lupin fans.  See you in thirty!</p>"
    }
  ]
}