{
  "author": "Luis Cruz",
  "section":
  [
    {
      "content": "<p>Nothing spooky this month; just the usual tricks &amp; treats you come to expect from the monthly newsletter.</p>"
    },

    {
      "title": "Pioneer releasing epsiode three",
      "content": "<p>According to an AnimeOnDVD.com thread, Pioneer will finally be releasing episode three, which they are titling <em>To Be or Nazi Be</em>, on volume five.  The disc is scheduled to hit the streets in January.</p><p>This means that Pioneer feels that the Lupin name has been &quot;established&quot; in the US.  Either that, or they are trying to grab the holdouts since it is unlikely Lupin will be on the Cartoon Network again any time soon.  So, if you have been holding out on purchasing the TV series, you might want to rethink your position.  I know I certainly am.</p>",
      "links":
        [
          {
            "title": "AoD thread",
            "url": "http://forums.animeondvd.com/showthreaded.php?Cat=&Number=179768",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "Time for a newsletter clip episode!",
      "content": "<p>It has been pretty quiet when it comes to Lupin news these days.  So, let's take this time to recap some recent and upcoming events.</p><p>Funimation plans on releasing both <em>Dead or Alive</em> and <em>Nostradamus</em> on DVD sometime next spring.  They are also looking at theatrical runs for both films.  As an added bonus, the <em>Dead or Alive</em> DVD will contain an interview with Monkey Punch; some lucky fans might also have had their questions asked to the master himself and will get to see their names in the credits.  While the details of the interview are under wraps at the moment, one interesting tidbit did slip out.  Monkey Punch directed only the opening and closing sequences of <em>Dead or Alive</em>; the rest was handled by assistant directors.  Not surprising, but it makes for a good trivia question.</p><p>Bandai will be releasing the Playstation 2 game under the title <em>Lupin the Third:  Treasure of the Sorcerer King</em>.  No solid release date has been stated, but it looks good that it will be released mid-November or January at the latest.  The dialogue will be dubbed by the Pioneer cast, but Bandai did indicate that they were trying to obtain the Japanese dialogue as well.  There has been no word on whether or not they were successful.</p><p>This October sees the release of the limited edition Japanese box set containing <em>Mamo</em>, <em>Babylon</em>, <em>Fuma</em>, both <em>Secret Files</em>, and a bundle of goodies.  <em>Mamo</em> and <em>Babylon</em> will be presented in anamorphic widescreen while <em>Fuma</em> and <em>Secret Files</em> will be presented in their original 4:3/fullscreen aspect ratio.</p><p>The box set a bit too pricey for you?  You might want to pick up this year's TV special on DVD then.  It is also coming out in October.  According to group member &quot;animeps2&quot;, it is pretty good, not as great as <em>Episode:0</em>, but one of the better specials in recent memory.  You can choose from the plain vanilla DVD release or a deluxe DVD+CD release.</p><p>Diamond should finally be releasing their first Lupin toy in the US.  It is the Lupin &amp; Mamo set that was recently released in Japan by Medicom.  However, the list price on the Diamond website is a bit more than some of the import shops you can order the Japanese version from.  Let's hope that the price when it hits the shelves beats the import price.  Otherwise, why bother with the US release?</p><p>That's it for this recap; let's hope more news surfaces soon so we won't have to do this again next month. :)</p>"
    },

    {
      "title": "Come gather round people wherever you roam...",
      "content": "<p>And admit that the Lupin fanbase has grown...</p><p>Just a reminder that we now hold two regularly scheduled chats each week, one on Tuesday and one on Thursday.  Both chats begin at 9PM EST and run until people get tired and leave.  There has been a good group of core members in there consistantly, but I hope to see more of you in there!</p><p>Congratulations go out to &quot;fujikoliz&quot;, the winner of the September chat prize.  She won an authentic Japanese Lupin CD just for showing up and chatting.  You too can win a prize!  A prize will be given out once a month until we run out of prizes.  How do you win?  It's easy!  Just show up and chat with your fellow Lupin fans.  We will not announce what day the prize will be given away, so try to make as many as you can.  Good luck and happy chatting!</p>"
    },

    {
      "title": "Upcoming &amp; Recent Releases",
      "content": "<dl><dt>9 September:</dt><dd><em>Lupin III Volume 7</em> (manga, TokyoPop)</dd><dt>7 October:</dt><dd><em>Lupin III Volume 8</em> (manga, TokyoPop)</dd><dt>14 October:</dt><dd><em>Lupin the 3rd TV 4:  Thieves' Paradise</em> (R1 DVD, Pioneer)</dd><dt>22 October:</dt><dd><em>Lupin the Third: Otakara Henkyaku Dai-sakusen!!</em> (R2 DVD & CD, Vap)</dd><dd><em>Lupin the Third: Otakara Henkyaku Dai-sakusen!!</em> (R2 DVD, Vap)</dd><dd><em>Lupin the Third: Otakara Henkyaku Dai-sakusen!!</em> (VHS, Vap)</dd><dt>24 October:</dt><dd><em>Lupin III DVD Limited Box</em> (R2 DVD, TMS)</dd><dd><em>Lupin the Third:  Plot of the Fuma Clan</em> (R2 DVD, TMS)</dd><dd><em>Lupin the Third:  Legend of the Gold of Babylon</em> (R2 DVD, TMS)</dd><dd><em>Lupin the Third:  Lupin vs. the Clone</em> (R2 DVD, TMS)</dd><dt>3 November:</dt><dd><em>Lupin the 3rd</em> (US PS2, Bandai/Dreamworks)</dd><dt>4 November:</dt><dd><em>Lupin III Volume 9</em> (manga, TokyoPop)</dd><dt>9 December:</dt><dd><em>Lupin III Volume 10</em> (manga, TokyoPop)</dd><dt>6 January 2004:</dt><dd><em>Lupin III Volume 11</em> (manga, TokyoPop)</dd><dt>Unknown Release Date:</dt><dd>Lupin the 3rd &amp; Mamo 12-inch Action Figure Set (Diamond Comics)</dd></dl>"
    },

    {
      "title": "Parting shots",
      "content": "<p>I am shooting blanks this month; all is quiet on the Western and Eastern fronts.  At least, it is quiet until my box set comes in; then there will be squeals of delight. :)</p><p>See you in thirty-one!</p></td>"
    }
  ]
}