{
  "author": "Luis Cruz",
  "section":
  [
    {
      "content": "<p>Welcome new and old members to the belated July 2003 edition of the group newsletter.  Since we are running a bit late, we will skip the formalities and get right to it...</p>"
    },
    
    {
      "title": "Early <em>Mamo</em> DVD reviews",
      "content": "<p>Some fortunate group members managed to get their hands on an advanced copy of Pioneer's <em>Mamo</em> DVD.  As many group members speculated, there were some copyright edits made most notably the removal of the Justice League parody and the ending theme song.  Despite these logo edits, the reviews have been favorable for the most part.</p>",
      "links":
        [
          {
            "title": "SPIKE77's review",
            "url": "http://groups.yahoo.com/group/lupinthethird/message/1861",
            "external": true,
            "expired": false
          },
          {
            "title": "Reed Nelson's initial review",
            "url": "http://groups.yahoo.com/group/lupinthethird/message/1909",
            "external": true,
            "expired": false
          },
          {
            "title": "Reed Nelson's full review (compares the various DVD &amp; dub versions as well)",
            "url": "http://www.lupinthethird.org/anime/mamo.htm",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "Anime Expo news",
      "content": "<p>Sadly, it does not seem that much solid Lupin news came out of AX this year.  Among some of the rumors and vague statements were a possible DVD with dub for <em>Babylon</em> from AnimEigo, a release of the first TV series at some point from Pioneer, and Bandai attempting to acquire the Japanese audio for the PS2 game.</p><p>On a positive note, Dale aka &quot;Mr. Lupin&quot; enjoyed himself and took plenty of pictures of the Lupin cosplayers in attendance.</p>",
      "links":
        [
          {
            "title": "Daniel Zelter's AX info. thread (be sure to read the replies for a few additional nuggets of info.)",
            "url": "http://groups.yahoo.com/group/lupinthethird/message/1929",
            "external": true,
            "expired": false
          },
          {
            "title": "AoD thread about Bandai &amp; the US PS2 release",
            "url": "http://forums.animeondvd.com/showthreaded.php?Cat=&Board=region1&Number=94366&page=0&view=collapsed&sb=5&o=&vc=1",
            "external": true,
            "expired": true
          },
          {
            "title": "Dale's photo album",
            "url": "http://www.msnusers.com/PhotoDemon/dalee.msnw?Page=1",
            "external": true,
            "expired": false
          }
        ]
    },

    {
      "title": "This year's TV special is... <em>Operation:  Return the Treasure!!</em>",
      "content": "<p>The official pages for this year's TV special titled <em>Otakara Henkyaku Dai-sakusen!!</em> (<em>Operation:  Return the Treasure</em>) have been posted.  The special will air on 1 August from 9:03PM to 10:54PM (Japanese local time). </p><p>From a very rough translation of the Kinro page, the story revolves around Lupin's quest to retrieve the &quot;Trick Diamond&quot;.  To do this, he must steal six treasures and return them to their appropriate place within a week.  Tangled up in this caper is the requiste &quot;child with knowledge of the treasure&quot;, the Russian mafia, and Zenigata.  Looks like the caper will bounce from Russia, Venice, Barcelona, and possibly a few other locations.  Hopefully, it will be a fun ride.</p><p>More than likely, next month's newsletter will be delayed a week or more in the hopes that someone will post a review and some screen shots. :)</p>",
      "links":
        [
          {
            "title": "Kinro Roadshow page",
            "url": "http://www.ntv.co.jp/kinro/h150801.html",
            "external": true,
            "expired": true
          },
          {
            "title": "lupin-3rd.net page",
            "url": "http://lupin-3rd.net/2003sp/",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "Limited edition Japanese box set hitting the shelves in October",
      "content": "<p>In what is certianly the biggest piece of Lupin news out of Japan, it was recently announced that a limited edition box set will be available in Japan.</p><p>What makes this box set so exciting is not only the actual content but the extras included as well.  This four disc set includes <em>Mamo</em>, <em>Legend of the Gold of Babylon</em>, <em>Fuma Conspiracy</em>, and both <em>Secret Files</em> releases.  All the films are listed as being in 16:9 anamorphic widescreen format.</p><p>Now for the extras... Included in the box set are pocket sized reproductions of the original movie programs for the films, a gallery of Otsuka Yasuo illustrations, and a booklet.</p><p>The set will be released on 24 October and will retail for 13800&#165; (roughly $116).  As it states in the title, it is a limited edition box set, so pre-order yours early.</p>",
      "links":
        [
          {
            "title": "AoD thread announcing the release",
            "url": "http://forums.animeondvd.com/shownested.php?Cat=&Board=region234&Number=60231&page=&view=&sb=5&o=&vc=1",
            "external": true,
            "expired": true
          },
          {
            "title": "CD Japan pre-order page",
            "url": "http://www.cdjapan.co.jp/detailview.html?KEY=TDV-2735D",
            "external": true,
            "expired": true
          },
          {
            "title": "DiscStation pre-order page",
            "url": "http://www.discstation.co.jp/VSSHOP/cgi/DS_goods_item.aspx?ns=TDV-2735D",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "<em>Cinderella Boy</em>, Monkey Punch's latest anime",
      "content": "<p>With little fan-fare, Monkey Punch has a new anime out called <em>Cinderella Boy</em>.  The plot revolves around a pair of detectives and a mysterious accident.  Overall, people seem to consider it as &quot;Monkey Punch does <em>Ranma</em>&quot;.</p>",
      "links":
        [
          {
            "title": "Official site",
            "url": "http://cinderellaboy.at-x.com/",
            "external": true,
            "expired": true
          },
          {
            "title": "AoD thread with a better plot summary",
            "url": "http://forums.animeondvd.com/showthreaded.php?Cat=&Board=generalanimeforum&Number=106766",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "GameCube game finally gets a release date",
      "content": "<p>After missing the initial December release date, Asmik Ace announced that it will be releasing <em>Lupin the 3rd:  umi ni kieta hih&#333;</em> for the GameCube on 31 July.  Accompanying this announcement is an official web site for the game.</p>",
      "links":
        [
          {
            "title": "Official web site",
            "url": "http://lupin.asmik-ace.co.jp/",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "Upcoming &amp; Recent Releases",
      "content": "<dl><dt>8 July:</dt><dd><em>Lupin the 3rd TV 3:  The Family Jewels</em> (R1 DVD, Pioneer)</dd><dd><em>Lupin III Volume 5</em> (manga, TokyoPop)</dd><dt>29 July:</dt><dd><em>Lupin the 3rd the Movie:  Secret of Mamo</em> (R1 DVD, Pioneer)</dd><dt>31 July:</dt><dd><em>Lupin the 3rd:  umi ni kieta hih&#333;</em> (Nintendo GameCube, Asmik Ace)</dd><dt>5 August:</dt><dd><em>Lupin III Volume 6</em> (manga, TokyoPop)</dd><dt>9 September:</dt><dd><em>Lupin III Volume 7</em> (manga, TokyoPop)</dd><dt>7 October:</dt><dd><em>Lupin III Volume 8</em> (manga, TokyoPop)</dd><dt>14 October:</dt><dd><em>Lupin the 3rd TV 4:  Thieves' Paradise</em> (R1 DVD, Pioneer)</dd><dt>24 October:</dt><dd><em>Lupin III DVD Limited Box</em> (R2 DVD, TMS)</dd><dt>3 November:</dt><dd><em>Lupin the 3rd</em> (US PS2, Bandai/Dreamworks)</dd><dt>4 November:</dt><dd><em>Lupin III Volume 9</em> (manga, TokyoPop)</dd><dt>9 December:</dt><dd><em>Lupin III Volume 10</em> (manga, TokyoPop)</dd><dt>Missing in Action:</dt><dd>Lupin toys (Diamond Comics)</dd></dl>"
    },

    {
      "title": "Parting Shots",
      "content": "<p>Out of all the news this month, the box set has my excited the most.  When it is released, Japan will have all but one title (<em>Trailers History</em>) released on DVD.  Best of all, the price seems very reasonable for a R2 set that includes three movies and two OVAs.</p><p>Nice to see that the GameCube game will be finally released.  From the screen shots on the official web site, it looks beautiful, but I doubt the gameplay will make much of an impression.</p><p>Where are those Diamond Comics toys?  I'd like to rid this newsletter of the &quot;Missing in Action&quot; section entirely.</p><p>That's it for this installment; stay tuned for August's newsletter... whenever that will be. :)</p>"
    }
  ]
}