{
  "author": "Luis Cruz",
  "section":
  [
    {
      "content": "<p>Here comes another installment of the newsletter; hold on to your hats!</p>"
    },

    {
      "title": "Welcome one and all!",
      "content": "<p>January brought us a record number of new groups members along with setting a new monthly post record of 142!  The group is now 179 members and is still growing.  To all of the new members, I say welcome and hope to hear from you soon.</p><dl><dt>Here are a few quick links you might want to bookmark:</dt><dd><a href=\"http://groups.yahoo.com/group/lupinthethird/\">The group's homepage</a></dd><dd><a href=\"http://groups.yahoo.com/group/lupinthethird/files\">File archive for the group</a> (contains scripts, wallpapers, and more!)</dd><dd><a href=\"http://photos.groups.yahoo.com/group/lupinthethird/lst\">Photo archive for the group</a> (a great place to upload your fanart)</dd><dd><a href=\"http://groups.yahoo.com/group/lupinthethird/links\">Link archive for the group</a></dd></dl>"
    },

    {
      "title": "Cagliostro Fan Commentary",
      "content": "<p>I mentioned this last month, but it deserves another mention so the new members can benefit as well.  As a Xmas present to all Lupin and <em>Cagliostro</em> fans, Chris Meadows has recorded a commentary track for the film.  The track is filled with trivia about the film, Arsene Lupin, and much more.  The track is an mp3 file that you can download <a href=\"http://www.dvdtracks.com/track/track.php?track=36\">here</a>.</p>"
    },

    {
      "title": "Adult Swim &amp; the Pioneer Dub",
      "content": "<p>We are now well into the Adult Swim broadcast run of Lupin, and the opinions of the dub have been mixed.  Most of the feedback I have been reading on message boards have been favorable towards it.  People feel the dub cast is doing a great job, and they also are comfortable with the liberties Pioneer has taken with the dub translation.</p><p>What do you guys think about the new dub?  Post away and let's see if we can break 200 messages in this short month!</p>"
    },

    {
      "title": "Upcoming Releases",
      "content": "<p>Funimation will be releasing <em>Dragon of Doom</em> a.k.a. <em>Zantetsuken</em> on 11 Feb. and <em>Voyage To Danger</em> a.k.a. <em>Orders to Assassinate Lupin</em> on 20 May.</p><p>Pioneer will be releasing the second TV DVD <em>Love Heist</em> on 11 March. The third DVD still has not been given a new release date.</p><p>Animeigo has given <em>Fuma</em> a new release date of 7 April.  Let's hope that it sells well so we can get <em>Legend of the Gold of Babylon</em> on DVD shortly after that.</p><p>Tokyopop has volume 2 of the manga slated for a 4 February release with volume 3 slated for a 8 April release.</p><p>Has anyone found a new release date for the Japanese GameCube game that was supposed to be released in December?</p><p>Keep an eye out for the US release of the Lupin toys.  I have not seen a release date posted for them yet, but I imagine we will see them soon now that Lupin is on TV regularly.</p>"
    },

    {
      "title": "Parting Words",
      "content": "<p>While we will get our Lupin fix on a steady basis this year, the only interesting news I can see on the horizon will be the announcement of this year's summer TV special.  I am looking forward to seeing if they can build on the success of last year's special.</p><p>Once again, welcome to all the new members.  Maybe next month, I can get Reed to write the newsletter so everyone can get to know him a bit better. :)</p><p>See you in twenty-eight days!</p>"
    }
  ]
}