{
  "author": "Luis Cruz",
  "section":
  [
    {
      "content": "<p>Welcome to all, old and new!  April was a busy month for myself as I attended Anime Boston, my first ever convention.  I find myself with an empty wallet but lots of new Lupin toys.  But I have managed to put them down long enough to bring you another monthly installment.</p><p>So hang on to your favorite fedora... Here we go!</p></td>"
    },
    
    {
      "title": "Lupin tidbits from Anime Boston",
      "content": "<p>Your intrepid author managed to brave the lines and get into the Bandai and Pioneer panels.  Jerry Chu, the representative for Bandai, did not have much information on the various video games Bandai will be releasing.  From his comments though, there will be a number of titles announced at E3; it is a good bet that the pre-order pages Reed has been finding are legitimate.  Get ready for the first Lupin game to hit the US shores!</p><p>Pioneer has no plans to put the older Mamo dubs on their upcoming release as they do not have access to the original source materials. The initial Adult Swim broadcast run produced OK but not great numbers; despite this, Pioneer indicated that they want to release as much of the Lupin TV series as possible.  They gave no indication as to when we will see more Lupin on Adult Swim, but it appears that the decision is not entirely up to them as the Cartoon Network chooses what shows are shown when.</p><p>I did see some Lupin cosplayers as well.  There was one green-jacketed Lupin, a few Jigens, and one Zenigata.  The amusing thing was that the Zenigata cosplayer was working security for the convention. :)</p><p>The dubbed version of Cagliostro was shown in one of the video rooms; let's hope that Funimation and Pioneer get their product on Anime Boston's screens next year.</p>"
    },

    {
      "title": "Fuma finally on DVD!",
      "content": "<p>After being delayed from December 2002 to April 2003, Fuma is finally on DVD after another but brief (one week) delay.  It looks and sounds fantastic!  I compared the video quality to the AnimEigo LD, and there is a world of difference between the two.  If you enjoyed Cagliostro, this DVD has to be your next purchase.  For now, it is only being sold on AnimEigo's website for only $22.45.  Now we just need them to release Babylon soon!</p>",
      "links":
        [
          {
            "title": "Buy it now from AnimEigo",
            "url": "http://www.animeigo.com/",
            "external": true,
            "expired": false
          },
          {
            "title": "Anime on DVD review",
            "url": "http://www.animeondvd.com/reviews2/disc_reviews/2217.php",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "Lupin Episode 2: Attack of the Mamos",
      "content": "<p>With Pioneer's upcoming release of Mamo on DVD, the group has been buzzing with various tidbits and trivia about the film.  At long last, the US will finally be able to watch Mamo in the original Japanese.  What is amazing is that the US audience will also be the first ones to receive Mamo on DVD; the Japanese have yet to see Mamo on the shiny, small format.  With the 25th anniversary of Mamo occurring this December, perhaps the Japanese will finally see a DVD release of Mamo.</p><p>With Pioneer producing their own dub of Mamo, Mamo surely has to be one of the most dubbed titles ever to come out of Japan.  The first English dub was made in 1978 to be shown on trans-Atlantic flights from Japan; this dub is commonly referred to as the &quot;Hong Kong (HK) dub&quot; and survives only in the form of n-th generation VHS copies.  Streamline Pictures produced their own dub in 1995; you can still find cheap, legitimate VHS copies along with over-priced, legitimate DVD copies of the Streamline dub on eBay.  There was also a UK dub made in 1996.</p><p>What is remarkable is that the dialogue for the HK and Streamline dubs were remarkably accurate to the original dialogue.  The Streamline dub did alter some lines here and there, but it still remained faithful to the original work.  We can only hope Pioneer decides to do the same with their dub.</p><p>One other thing to watch for in Pioneer's release is the inclusion or exclusion of the &quot;flashing yellow stars&quot; death scene.  The observant &quot;unclejun76&quot; noticed that the old Cliff Hanger game footage included a scene that he could not find in either Cagliostro or Mamo.  After finally obtaining a copy of the '78 dub, he found the scene to occur right before the title sequence is shown.  The Japanese LD and US versions of the film do not have this sequence. Will Pioneer's version have this sequence, or is it lost to us forever?  Only time will tell...</p><p>Finally, Reed Nelson pointed out that the latest Newtype USA issue has an article by Fred Patten, a former employee of Streamline.  He comments that the official TMS English language script for Mamo had the name spelled as &quot;Mamoux&quot;.  Streamline decided to use &quot;Mamo&quot; as fans had been doing for fifteen years rather than tell them they were wrong all that time.  Considering none of us had access to that script (and how can we get access to it now?!), how were we supposed to know that the katakana &quot;ma mo &lt;symbol for elongated vowel sound&gt;&quot; was supposed to represent a French name?</p>"
    },

    {
      "title": "The Magician returns... again!",
      "content": "<p>In a surprising announcement, Vap re-released the <em>Return of the Magician</em> DVD.  The reissued DVD went on sale 23 April for 3800 yen. The news posting on lupin-3rd.net seems to indicate that the DVD comes with a CD-ROM but not the one that was originally packaged in the limited edition box set.   Additionally, it does not include the soundtrack CD originally bundled in the box set. The listing for the DVD on CDJapan does not indicate that there is a CD-ROM bundled with the DVD though.</p><p>Vap also released an extended soundtrack on 23 April for 2095 yen. This soundtrack appears to include all of the tracks that were released on the soundtrack CD bundled in the limited edition box set along with tracks from some other specials such as <em>Episode:0</em>.</p>",
      "links":
        [
          {
            "title": "Order the DVD from CDJapan",
            "url": "http://www.cdjapan.co.jp/detailview.html?KEY=VPBV-11722",
            "external": true,
            "expired": true
          },
          {
            "title": "Order the CD from CDJapan",
            "url": "http://www.cdjapan.co.jp/detailview.html?KEY=VPCG-84784",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "New Yahoo group for the upcoming Hollywood film",
      "content": "<p>A Lupin fan has created a Yahoo group specifically geared towards discussing the upcoming Hollywood live-action film.  Help make this group the focal point for fan opinions about the film.</p>",
      "links":
        [
          {
            "title": "Group homepage",
            "url": "http://groups.yahoo.com/group/lupinIII_liveaction",
            "external": true,
            "expired": false
          }
        ]
    },

    {
      "title": "Lupin goes mobile... but only in Japan",
      "content": "<p>Cell phones have become a permanent part of modern Japanese culture; a new service will be bringing Lupin fans a way of enjoying their favorite thief on the go.</p><p>For 200 yen (not sure if this is per use fee or monthly fee) each, you can access Lupin sights, sounds, and games.  The service was rolled out to J-sky Web customers on 16 April, EZweb customers on 17 April, and I-mode customers on 21 April.  The service has a website, but it does not appear to be accessible via a normal PC web browser.</p>",
      "links":
        [
          {
            "title": "The service announcement",
            "url": "http://www.lupin-3rd.net/info.cgi",
            "external": true,
            "expired": true
          },
          {
            "title": "The official website",
            "url": "http://keitailupin.com/",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "Lupin the Third Perfect Book",
      "content": "<p>I cannot believe I let this one slip by for two newsletters.  On 13 February, Takarajima Publications released <em>Lupin the Third Perfect Book</em>.  It contains reviews and interviews from Japanese fans on the web as well as those that have worked on the series over the years.</p>",
      "links":
        [
          {
            "title": "Takarajima Publications' page for the book",
            "url": "http://www.takarajimasha.co.jp/lupin/",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "Upcoming &amp; Recent Releases",
      "content": "<dl><dt>17 April:</dt><dd><em>Rupan III:  The Fuma Conspiracy</em> (R1 DVD, AnimEigo)</dd><dt>23 April:</dt><dd><em>Lupin III:  Ikiteita Majutsushi</em> (R2 DVD, Vap)</dd><dd><em>Lupin III:  Ikiteita Majutsushi OST</em> (CD, Vap)</dd><dt>20 May:</dt><dd><em>Lupin the 3rd:  Voyage to Danger</em> (R1 DVD, Funimation)</dd><dt>10 June:</dt><dd><em>Lupin III Volume 4</em> (manga, TokyoPop)</dd><dt>8 July:</dt><dd><em>Lupin the 3rd TV 3:  The Family Jewels</em> (R1 DVD, Pioneer)</dd><dd><em>Lupin III Volume 5</em> (manga, TokyoPop)</dd><dt>29 July:</dt><dd><em>Lupin the 3rd the Movie:  Secret of Mamo</em> (R1 DVD, Pioneer)</dd><dt>5 August:</dt><dd><em>Lupin III Volume 6</em> (manga, TokyoPop)</dd><dt>9 September:</dt><dd><em>Lupin III Volume 7</em> (manga, TokyoPop)</dd><dt>24 September:</dt><dd><em>Lupin the 3rd</em> (US PS2, Bandai/Dreamworks)</dd><dt>Missing in Action:</dt><dd><em>Lupin III: umi ni kieta hiho</em> (Japanese GameCube, Asmik Ace)</dd><dd>Lupin toys (Diamond Comics)</dd></dl>"
    },

    {
      "title": "Parting Shots",
      "content": "<p>When, oh, when will Pioneer start clamping down on all the bootleg Lupin sets being sold on eBay?  It is not that difficult to do, and I know from first-hand experience.  In the past and just within the last week, I have had auctions pulled from eBay for stealing my images (via linking to them on my server) and text (straight cut &amp; paste from my pages).  The initial setup to get into eBay's Vero program is a bit tedious requiring the faxing of documents, but once that is done, it is a simple task to report item violations.</p><p>Even a small company like AnimEigo has taken to policing eBay for bootlegs.  Why won't Pioneer do the same?  If they do not have the manpower, recruit some fans to help out; I would do it for free if it means I can scan the eBay Lupin listings without seeing page after page of bootleg TV sets.  C'mon Pioneer!  Get off your duff!</p><p>There are rumblings that the Lupin GameCube game is set to be released in the US as well.  Perhaps the game will be a bilingual release; this might explain why it missed its initial December 2002 release date.  The US and Japan might be getting a Japanese and English language version of the game on one disc.</p><p>And where are my US released Lupin toys?!  Don't you want my money Diamond Comics?</p><p>Farewell, lovely Lupin fans.  See you in thirty-one!</p>"
    }
  ]
}