{
  "author": "Reed Nelson",
  "section":
  [
    {
      "content": "<p>Newsletter installment Number Four! Banzai!</p>"
    },

    {
      "title": "Greetings, Lupintic Clan!",
      "content": "<p>Well, February has come and gone, and our total post count has broken the 1000 mark! I'm sure with enough cooperation from our members, we will reach the 2000-post mark within the year! (Come, come, let us talk! Be not silent!)</p>"
    },

    {
      "title": "The Lupin the Third Live-Action Feature Film!",
      "content": "<p>Hollywood Producer Gerald R. Molen (<em>Schindler's List</em>, <em>Jurassic Park: The Lost World</em>) has announced the very recent acquisition of the rights to produce a &quot;Lupin the Third&quot; live action feature. Molen and his staff recently returned from Japan after meeting with Lupin creator Monkey Punch (who insisted on little else besides keeping the five main cast and their characteristics), and are ready to get to work on the project. Judging from earlier posts in the Group, Molen and his team seem interested in fan input (at least to an extent), and (according to press releases) hope to keep the material as true as possible to its manga roots. There are no directors, cast, or screenwriters determined as of yet, but we can expect the film to arrive in theaters &quot;in a couple of years.&quot;</p><p>This news brought about an exciting flood of messages to the Group, and Luis and I are more than thrilled about the yet-untapped potential this Group has for creative conversation and discussion about that scoundrel, Lupin. Let's hope some more group members will join in on the conversation.</p>"
    },

    {
      "title": "Lupin the Third Official Websites Updated",
      "content": "<p>Both the LupinOfficial.com and LupintheThird.com sites have been updated to reflect both Pioneer's and FUNimation's growing list of Lupin releases. Lupin Official now finally has some video clips to download, though all three appear to be from the first TV episode, which has been on the air for a while, yet. LupintheThird.com now has a listing for the <em>Dragon of Doom</em> feature, which came out February 11th. The sub-site for <em>Dragon</em> contains character info and a plot summary.</p>"
    },

    {
      "title": "Lupin on Adult Swim",
      "content": "<p>Lupin sucessfully completed its initial 16-episode run on Adult Swim, while episodes 17-26 of Cartoon Network's series order are still in the dubbing process, apparently. The currently-dubbed episodes are in reruns, and will vanish from the lineup (temporarily) starting on March 31st. We are all eagerly awaiting the arrival of new Lupin episodes.</p>"
    },

    {
      "title": "Upcoming Releases",
      "content": "<p>Funimation will be releasing <em>Voyage To Danger</em> a.k.a. <em>Orders to Assassinate Lupin</em> on May 20th.</p><p>Pioneer will be releasing the second TV Series DVD <em>Love Heist</em> on April 8th, simultaneously with the <em>Lupin the Third Original Soundtrack</em> CD. The third TV DVD launches July 8th.</p><p>Animeigo has given <em>Fuma</em> a new release date of 7 April. Let's hope that it sells well so we can get <em>Legend of the Gold of Babylon</em> on DVD shortly after that.</p><p>Volume 3 of the original Lupin manga is slated for an April 8th release from TOKYOPOP. April 8th is shaping up to be a big Lupin day (TV DVD #2, Manga Volume 3, the TV Soundtrack CD).</p><p>The Japanese GameCube game <em>Lupin the Third: Lost Treasure of the Sea</em> has been pushed back to the vague release date of &quot;sometime in 2003.&quot;</p><p>Keep an eye out for the US release of the Lupin toys. I have not seen a release date posted for them yet, but I ALSO imagine we will see them soon now that Lupin is on TV regularly.</p>"
    },

    {
      "title": "Parting Words",
      "content": "<p>Obviously, the most exciting news has been the Lupin the Third theatrical announcement. I'm thrilled about the idea, though I have been less vocal about it than many others in the group. The steady stream of anime releases has been amazing. I think we can all look forward to another healthy year full of Lupin goodness.</p><p>Keep those (on-topic) posts coming!</p></td>"
    }
  ]
}