{
  "author": "Luis Cruz",
  "section":
  [
    {
      "content": "<p>Happy New Year!  I hope everyone had a great holiday season.  With a new month and a new year upon us, it is time for the second installment of the newsletter.  We will take a look back at 2002 and see what 2003 holds for Lupin fans.</p><p>Now... let us all peer into the crystal ball...</p>"
    },

    {
      "title": "2002 -- The Year in Review",
      "content": "<p><strong>January</strong><br />The year started out slowly but filled with hope.  A new OVA titled <em>Return of the Magician</em> was being made in Japan; this tale would reunite Lupin with one of his most famous foes from the first TV series, Pycal. Various on-line stores began to take pre-orders for the 3 April release of this limited edition OVA.</p><p>Funimation had begun to place inserts into their DVDs announcing that their first Lupin title <em>Twilight Gemini</em> would be released in the spring.</p><p><strong>February</strong><br />The official release date for <em>Twilight Gemini</em> was announced; Lupin fans had only to wait until 30 April for their first taste of US released Lupin since Manga Entertainment released <em>Castle of Cagliostro</em> on DVD.</p><p>In other news, a Lupin typing game was released in Japanese arcades.</p><p><strong>March</strong><br />Funimation announced that their second Lupin release <em>Pursuit of Harimao's Treasure</em> will be released on DVD on 24 September.</p><p>On the other side of the world, Vap announced that they would be releasing a DVD box set containing the entire third TV series on 5 July in Japan.</p><p><strong>April</strong><br /><em>Return of the Magician</em> was released and received mixed reviews from fans in both Japan and the US.  My review can be found <a href=\"http://www.animeondvd.com/reviews2/disc_reviews/1333.php\">here</a>.</p><p><strong>May</strong><br />Banpresto announced that they would be making a Lupin game for the PS2. The gameplay was shown to be similar in style to the <em>Metal Gear Solid</em> line of games.  The title for the game was <em>Majutsu-Ou no Isan</em> (<em>Legacy of the Magician</em>) and had its own <a href=\"http://www.lupin-game.com/\">website</a>.</p><p><strong>June</strong><br />The official announcement about the year's new TV special was made.  The new special was titled <em>Episode:0 First Contact</em> and was to tell the story about how Lupin and the gang all met each other.</p><p>AnimEigo also announced that they would be releasing <em>Fuma Conspiracy</em> on DVD in Dec.</p><p><strong>July</strong><br />July was a banner month for Lupin fans.  Anime Expo was nearly upon US fans, and the air was buzzing with rumors about a major Lupin announcement at the convention.  In Japan, more information was released about the upcoming TV special as well as the announcement that a set of Cagliostro Kubricks (Lego-type people) were being produced.</p><p>Anime Expo arrived, and the rumors were true.  Pioneer announced that they had acquired fifty-two Lupin TV episodes; Pioneer did not supply much more information but did show a brief clip of an episode they had begun to dub. More of a surprise was TokyoPop's announcement that they were planning on releasing the original Lupin manga series in the US as part of their &quot;100% Authentic&quot; manga line.</p><p>Meanwhile, Japanese fans gathered around their televisions as the latest TV special <em>Episode:0</em> aired on 26 July.</p><p><strong>August</strong><br />Another Lupin game was announced but the lucky platform this time was the GameCube.  Asmik Ace was planning to release a &quot;Choose Your Own Adventure&quot; game for the GameCube in December under the title <em>Umi ni Kieta Hihou</em>.</p><p>Also, pre-orders for the 23 October release of the <em>Episode:0</em> DVD began.</p><p><strong>September</strong><br />Funimation's DVD of <em>Pursuit of Harimao's Treasure</em> was released.  Reviews can be found <a href=\"http://www.animeondvd.com/reviews2/disc_reviews/1014.php\">here</a> and <a href=\"http://www.animeondvd.com/reviews2/alt_reviews/773.php\">here</a>.</p><p>Diamond Comics gave Lupin fans another surprise as they announced that they would be releasing the Medicom dolls as well as other Lupin merchandise into the US market.</p><p>Pioneer also gave their first Lupin TV DVD a street date of 28 January 2003 along with a Lupin CD that would street on the same day.</p><p><strong>October</strong><br />Pioneer announced that they will release their official Lupin website on 8 November.  TokyoPop announced that the first Lupin manga volume would be released on 10 December with volume two released on 4 February 2003.</p><p>The <em>Episode:0</em> DVD is released in Japan.  My review can be found <a href=\"http://www.animeondvd.com/reviews2/disc_reviews/1913.php\">here</a>.</p><p><strong>November</strong><br />November proved to be a tempestuous month.  Pioneer's website was released and was browsed by eager fans looking for more information about the upcoming release.  An episode appeared to be missing from the episode list for the first DVD.  Before an answer was received from Pioneer, Cartoon Network announced that Lupin would be broadcast on their &quot;Adult Swim&quot; block.  Eventually, Pioneer responded to queries about the missing episode.</p><p>To sum up, Pioneer was holding the episode titled <em>Hitler's Legacy</em> back from both the TV broadcast as well as the DVD.  They promised that they would release the episode when &quot;the Lupin franchise has been established&quot;. They also revealed that the masters they had received were edited by the Japanese licensor to remove music and background logos that might cause copyright problems.  Both of these revelations caused a rather heated debate among Lupin and anime fans in general.</p><p>On a brighter note, the PS2 game was released in Japan.  Also, the first volume of Lupin manga from TokyoPop shipped to retail stores early.</p><p><strong>December</strong><br />The year ended as it began... quietly.  AnimEigo announced that <em>Fuma</em> was being delayed until January.  Also slipping from a December release was the GameCube game; there has been no word on when it will be released. Funimation announced that their next DVD release <em>Dragon of Doom</em> (<em>Zantetsu Sword is on Fire</em>) would be released on 11 February 2003.</p>"

    },

    {
      "title": "2003 -- Looking Ahead",
      "content": "<p>Starting the new year off in Japan is something I never would have imagined seeing.  A Lupin fanart convention will be held in Japan. The theme is &quot;Lupin in Japanese Fashion&quot; and will feature artwork from fans showing what Lupin and the gang might look like dressed up in traditional Japanese attire.  The websites are in Japanese, but you can find out more information <a href=\"http://cat.oekaki.st/toukaido/bbsnote.cgi/\">here</a> and <a href=\"http://www.katch.ne.jp/~m-sawada/maturi/TOU.htm\">here</a>.</p><p>US Lupin fans have a lot to look forward to in the coming year.  First up is the controversial release of the second Lupin TV series in the US by Pioneer.  Their first DVD volume is set to be released on 28 January along with the CD <em>Sideburn Club Mix</em>, a compilation of songs from the <em>Punch the Monkey</em> CDs that were released in Japan.  Pioneer's version of Lupin also begins airing in January.  Barring any other delays, AnimEigo will ship <em>Fuma</em> to our eager hands.</p><p>February will bring us the second manga volume on the 4th and Funimation's third DVD release <em>Dragon of Doom</em> on the 11th.  March sees the release of Pioneer's second DVD on the 11th, and TokyoPop rounds out the spring with the third manga release on 8 April.</p><p>Beyond that, the year is filled with potential excitement.  Diamond Comics has yet to release any toys in the US.  With the impending release of Lupin on TV, the toys cannot be too far out.  TokyoPop has plenty of manga volumes that can be released throughout the year.  Funimation is sure to release at least one more Lupin title, and Pioneer will surely release more Lupin TV DVDs despite the removal of the third volume's release in April being removed from retailer's catalog.</p><p>And what will happen in Lupin's birthplace of Japan this year?  How will this year's TV special be able to top <em>Episode:0</em>?  Will the GameCube game ever ship?</p><p>While 2002 was an exciting year for Lupin fans, 2003 holds the promise of being the greatest year for Lupin fans ever.</p>"
    },

    {
      "title": "Cagliostro Fan Commentary",
      "content": "<p>As a Xmas present to all Lupin and <em>Cagliostro</em> fans, Chris Meadows has recorded a commentary track for the film.  The track is filled with trivia about the film, Arsene Lupin, and much more.  The track is an mp3 file that you can download <a href=\"http://www.dvdtracks.com/track/track.php?track=36\">here</a>.</p>"
    },

    {
      "title": "Useful Group Tips",
      "content": "<p>I am sure that all of you know that this group is a great way to keep track of the world of Lupin via email.  But did you know that the group offers so much more than nifty emails in your inbox?</p><p>The <a href=\"http://groups.yahoo.com/group/lupinthethird/\">group's homepage</a> holds plenty of treasure for the Lupin junkie.  The &quot;Links&quot; section contains links to Lupin sites, DVD reviews, as well as links to other useful sites and software for the general anime junkie.  The &quot;Files&quot; section contains fan fiction, wallpapers, icons, scripts, and so much more.  Want a place to display your own Lupin fan art?  Look no further than the &quot;Photos&quot; section.  The &quot;Database&quot; section also contains plenty of Lupin ringtones for your favorite mobile phone.</p><p>You can also change how you receive emails from the group as well.  If you want to receive individual emails, a daily digest, or just want to read the latest messages via the group homepage, just click on the &quot;Edit My Membership&quot; link that appears on the group homepage.</p>"
    },

    {
      "title": "Parting Words",
      "content": "<p>Despite the Pioneer debacle, I am looking forward to this year as being the year of Lupin.  I am hoping that Lupin does succeed and become &quot;established&quot; in the US market.  The show has been long overlooked by the majority of US anime fans, and I hope to see that change this year.</p><p>See you in thirty-one days!</p>"
    }
  ]
}