{
  "author": "Luis Cruz",
  "section":
  [
    {
      "content": "<p>This year's TV special has come and gone, and the US has seen <em>Mamo</em> released once again with yet another English dub.  Hold on to your fedora... here comes another edition of the newsletter!</p>"
    },

    {
      "title": "The 2003 special -- <em>Operation: Return the Treasure!!",
      "content": "<p>Friday, 1 August saw the release of the latest TV special in Japan.  So far, the few reviews from Japanese fans have been mediocre.  While it does not measure up to last year's spectacular <em>Episode:0</em>, most people feel that it was a decent special overall.  Not much else to say at the moment except &quot;enjoy the trailer!&quot;</p>",
      "links":
        [
          {
            "title": "Trailer",
            "url": "http://jp.y42.briefcase.yahoo.co.jp/bc/metoron70/vwp2?.tok=bcAevT_AwTVH5FFM&.dir=/share&.dnm=LpnTrailer.avi&.src=bc",
            "external": true,
            "expired": true
          },
          {
            "title": "Kinro Roadshow page",
            "url": "http://www.ntv.co.jp/kinro/h150801.html",
            "external": true,
            "expired": true
          },
          {
            "title": "lupin-3rd.net page",
            "url": "http://lupin-3rd.net/2003sp/",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "Attack of the Killer Clones",
      "content": "<p>Once again, the US market sees a DVD release of <em>Mamo</em> before the Japanese market does.   For the first time, Lupin fans can watch <em>Mamo</em> in the original Japanese language.</p><p>Pioneer has also created another dub for the film raising the total to four distinct dubs of <em>Mamo</em>.  They also managed to secure the new anamorphic print from the Japanese licensor giving US fans the best presentation of the film ever.</p><p>For once, Pioneer has packed in some nifty extras in a Lupin release.  On the DVD, you get the original coroner's report, an image gallery of conceptual art, a gallery of pages from the original Japanese program, and an image of Monkey Punch's poster for the film.</p><p>The packaging contained a few extras as well.  The case is clear, and the cover contains a panoramic image on the reverse side.  Included in the case is a booklet containing translations for nearly every page of the movie program.  If you were very lucky, your DVD had a sticker indicating that it also came with a magic keychain.</p><p>The release does have a few flaws though.  First, the print the licensor gave Pioneer had some logos removed including the famous Justice League image.  Also, the ending theme song was changed.  Depending on your tastes, the dub was also a bit of a problem as it was &quot;modernized&quot; quite a bit.</p><p>Overall, it is the best release of <em>Mamo</em> to date.  If you have not purchased your copy yet, grab one as soon as you can.</p>",
      "links":
        [
          {
            "title": "Reed Neslon's DVD review; includes a list of edits",
            "url": "http://www.lupinthethird.org/anime/mamo.htm",
            "external": true,
            "expired": false
          },
          {
            "title": "Chris Beveridge's DVD review",
            "url": "http://animeondvd.com/reviews2/disc_reviews/2120.php",
            "external": true,
            "expired": false
          },
          {
            "title": "Luis Cruz's DVD review",
            "url": "http://animeondvd.com/reviews2/alt_reviews/921.php",
            "external": true,
            "expired": false
          },
          {
            "title": "AnimeOnDVD.com forum thread discussing the DVD release including the dub.  One of many threads about the subject.",
            "url": "http://forums.animeondvd.com/showthreaded.php?Cat=&Board=region1&Number=121775",
            "external": true,
            "expired": true
          },
          {
            "title": "Picture of the keychain",
            "url": "http://www.crystalacids.com/images/l3_keychain.jpg",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "Chat with your fellow group members... get a chance to win a prize!",
      "content": "<p>Since Reed started this group and invited me to be a moderator, we have tried numerous ways to get the members to be more active and chat more.  We have set up scheduled chats, pleaded, and begged.  While we have had some limited success, we still wanted to see more and more members actively participating.  So, we are resorting to blantant bribery.</p><p>Thanks to Pioneer, I have some posters and other items that are being given away as prizes during the weekly scheduled chat.  Our first winner was &quot;animeps27&quot;; he received one of the Adult Swim promotional posters.  There are more posters to give away as well as some other items (sideburns, promo cards, possibly even some keychains, a CD, and a DVD).  One item (possibly more) will be given away each week during the chat until all the prizes are gone.</p><p>So, how can you win a prize you ask?  All you have to do is come to the scheduled chat every Tuesday at 9PM EST (6PM PST).  Come and chat with your fellow Lupin fans; the chat is open to just about any topic.  Get to know one another and extend your Lupin knowledge.</p><p>The weekly prize will be awarded sometime after 10 PM EST so the west coast people have a chance to get home and settle in.  I will do my best to vary how the prize is awarded each week and will try  to make it fun and accessible to fans of all levels.  You cannot win unless you come and chat, so I ope to see you in there!</p>",
      "links":
        [
          {
            "title": "LupinTheThird Chat",
            "url": "http://groups.yahoo.com/group/lupinthethird/chat/",
            "external": true,
            "expired": true
          }
        ]
    },

    {
      "title": "Upcoming &amp; Recent Releases",
      "content": "<dl><dt>29 July:</dt><dd><em>Lupin the 3rd the Movie:  Secret of Mamo</em> (R1 DVD, Pioneer)</dd><dt>31 July:</dt><dd><em>Lupin the 3rd:  umi ni kieta hih&#333;</em> (Nintendo GameCube, Asmik Ace)</dd><dt>5 August:</dt><dd><em>Lupin III Volume 6</em> (manga, TokyoPop)</dd><dt>9 September:</dt><dd><em>Lupin III Volume 7</em> (manga, TokyoPop)</dd><dt>7 October:</dt><dd><em>Lupin III Volume 8</em> (manga, TokyoPop)</dd><dt>14 October:</dt><dd><em>Lupin the 3rd TV 4:  Thieves' Paradise</em> (R1 DVD, Pioneer)</dd><dt>24 October:</dt><dd><em>Lupin III DVD Limited Box</em> (R2 DVD, TMS)</dd><dd><em>Lupin the Third:  Plot of the Fuma Clan</em> (R2 DVD, TMS)</dd><dd><em>Lupin the Third:  Legend of the Gold of Babylon</em> (R2 DVD, TMS)</dd><dd><em>Lupin the Third:  Lupin vs. the Clone</em> (R2 DVD, TMS)</dd><dt>3 November:</dt><dd><em>Lupin the 3rd</em> (US PS2, Bandai/Dreamworks)</dd><dt>4 November:</dt><dd><em>Lupin III Volume 9</em> (manga, TokyoPop)</dd><dt>9 December:</dt><dd><em>Lupin III Volume 10</em> (manga, TokyoPop)</dd><dt>6 January 2004:</dt><dd><em>Lupin III Volume 11</em> (manga, TokyoPop)</dd><dt>Missing in Action:</dt><dd>Lupin toys (Diamond Comics)</dd></dl>"
    },

    {
      "title": "Parting Shots",
      "content": "<p>Not much to say this month; the GameCube game has finally been released, but I have yet to see a review for it.  Hopefully, Funimation will announce their next DVD release soon.  Until mid-October, all we have to tide us over for our Lupin fix are the steady TokyoPop releases.  Let's hope Pioneer and Funimation kick things up a notch and start releasing more Lupin DVDs quickly!</p><p>Until next time, I bid you adieu.</p>"
    }
  ]
}