{
  "author": "Luis Cruz",
  "section":
  [

    {
      "content": "The past year was a great one for Lupin fans.  Let's take a look back at 2003 as well as see how 2004 is shaping up for Lupin fans."
    },

    {
      "title": "A look back at 2003 in the U.S.",
      "content": "<p>Lupin fans in the U.S. never had it so good as they did in 2003.  Funimation, Geneon (formerly Pioneer) Entertainment, TokyoPop, and even AnimEigo provided a steady stream of products flowing into our hands.  Let's start with Funimation.</p><p>Funimation had a brisk pace of Lupin releases going as 2003 opened up, and they showed no signs of slowing.  <em>Dragon of Doom</em> (a.k.a. <em>Zantetsuken</em>) was released in February with <em>Voyage to Danger</em> (a.k.a. <em>Orders to Assassinate</em>) released in May.  Unfortunately, the rest of the year was silent for them on the Lupin front.  However, they dropped a big bomshell on Lupin fans in September.  The next two titles slated for release in 2004 would <em>Dead or Alive</em> and <em>To Hell with Nostradamus</em>; the bombshell portion of the announcment was that they were securing an interview with Monkey Punch himself to include as a bonus on one or both discs.  They also promised 2004 would see the return of a quick release schedule for their Lupin titles.</p><p>Pioneer Entertainment's release schedule for the Lupin TV series was still too slow for most fans in 2003.  Volume two was released in April, volume three in July, and volume four in October.  With the episodes airing regularly on Adult Swim, three months between DVD volumes seemed like poor planning.  They did manage to surprise fans though by releasing <em>Secret of Mamo</em> in July.  For the first time, U.S. fans could watch <em>Mamo</em> in the original Japanese language.  The film was given a facelift as the Japanese licensor created a new anamorphic print for the film;  unfortunately, they removed certain tradmark images from the print they provided to Pioneer, most notably the <em>Justice League</em> image near the end of the film.  The film also received another English dub which was received with mixed reviews.</p><p>Overall, Pioneer's dub of Lupin so far has been met with mixed reviews.  Some like the modernized dialogue while other feel that it is too unsettling.  Regardless of your position of the dub, all Lupin fans were disappointed when the series was taken off of the Adult Swim rotation with no signs of its return.  Fortunately, it was announced that it would return in 2004 for another run; whether this is the last hurrah for Lupin on the U.S. airwaves remains to be seen.  Also of note was Pioneer's decision at the end of the year to rename itself Geneon Entertainment; yeah, none of us can figure it out either.</p><p>TokyoPop was the busiest licensor of U.S. Lupin in 2003 as they cranked out a new volume of the first manga series almost every month.  They are poised to keep Lupin fans just as happy in 2004 as they quietly revealed at the end of the year that they have the second manga series on tap as well.</p><p>AnimEigo made a modest showing in 2003 as they released <em>Fuma</em> on DVD.   They have made no solid statement yet regarding the release of <em>Babylon</em> to DVD as well.</p><p>By far, the news that had Lupin fans buzzing in 2003 was the announcement of a live-action Hollywood film.  Gerald R. Molen, known for producing such films as <em>Jurassic Park</em> and <em>Schindler's List</em>, announced in a press conference in Japan that he had acquired the rights to produce a live-action Lupin film for the U.S. market.  No solid date was given for its release, but Molen seems optimistic that it could be a franchise in the making.  The announcement resparked the inevitable casting thread with Jim Carrey topping nearly everyone's list as a potential candidate to play the lanky thief.  Reports since then have been minimal, but it appears that the film might be hitting theaters in 2006.</p><p>Diamond Comics was a virtual no-show for 2003 much to the disappointment of Lupin toy lovers.  In August, they did announce on their website that they were releasing the Lupin/Mamo Medicom figure set for $125; no one has yet to report on obtaining one though.  Also of note is that price tag; when Diamond originally announced they would be bringing Lupin toys to the U.S., they stated that they wanted to make them more afforadable than the original Japanese toys.  However, you can pick up the Japanese version of the Lupin/Mamo set for roughly $105 at most on-line import shops.  Diamond dropped the ball in a big way by not cashing in on the merchandise while Lupin was aired on Adult Swim.</p><p>Rounding out the U.S. side in 2003 was Bandai.  In May, Bandai announced at E3 that they would be releasing the Lupin PS2 game in the U.S.  The game would feature an English dub done by the Pioneer cast.  A Novemeber ship date was set... and subsequently missed.</p><p>As all of these companies provided more Lupin merchandise and hype, the group's ranks swelled though most members still seem to lurk.  I am very pleased to see that the weekly chats on Tuesday and Thursday have managed to find a core group of chatters.  The bonus is that most of these chatters are also quite talented and have been giving back to the Lupin community in the form of fan art and fan fiction.  As one of the admins for the group, I would just like to say &quot;thank you&quot; to each and every member that has posted a message to the group or has participated in the chat.</p>"
    },

    {
      "title": "A look back at 2003 in Japan",
      "content": "<p>Lupin has been going strong in Japan for over thirty years, and 2003 was no exception.  As expected, another TV special was announced for the summer road show.  Titled <em>Operation:  Return the Treasure!!</em> and aired on 1 August, Japanese Lupin fans seem to agree that the special was one of the better ones in recent memory and came close to being as great as 2002's special <em>Episode:0</em>.  The DVD made a quick appearance in October in two flavors -- a DVD only version and a limited edition version that contained the DVD and the soundtrack for the special.</p><p>October also saw the release of a title that had Lupin fans around the world drooling over.  At the end of October, TMS shipped the <em>DVD Limited Theatrical Edition Box</em>; inside this box set were <em>Mamo</em>, <em>Babylon</em>, <em>Fuma</em>, and <em>Secret Files 1 &amp; 2</em>.  Also included in the box set were miniture but complete reproductions of the theatrical programs sold for each film and a booklet of illustrations and old newsletters.  Both <em>Mamo</em> and <em>Babylon</em> were given new anamorphic print transfers.  The films were also released on individual DVDs, but it appears that the <em>Secret Files 1 &amp; 2</em> may be a box set only item.</p><p>However, this might not be the case for very long as Vap surprised people by re-releasing <em>Return of the Magician</em> on DVD in April.  This set did not include the soundtrack bundled with the 2002 box set, and it is unclear if it includes the same CD-ROM that came with the box set.  I am hoping that <em>Secret Files</em> does not receive the same treatment allowing the theatrical box set to remain a true collector's item.</p><p>Lupin merchandising was in full force in Japan as toy after toy rolled out.  Everything from Kubrick figures to keychains to mini-stereo speakers made their appearance.  Lupin even made his way onto mobile phones as April saw the release of a pay service for the three major mobile services in Japan.  For 200&#165; (monthly?), you could access Lupin sights, sounds, and games on your phone.  July saw the release of the long delayed GameCube game.</p><p>Monkey Punch had a good year as well.  A new thirteen episode series known as <em>Cinderella Boy</em> hit the airwaves.  His artwork was used for a series of New Year cards, and he made a few appearances at some U.S. conventions.  The pictures of him at the conventions show him to be in great health.  Neither he nor his creation Lupin appear to be retiring any time soon.</p>"
    },

    {
      "title": "What's on tap for 2004?",
      "content": "<p>This upcoming year is lined up to be another banner year for Lupin fans around the world.  And what better way to start than by checking out the <a href=\"http://lupinfes2003.fc2web.com/\">2004 Lupin Fan Art Festival</a>?  If you browsed last year's entries (also available from the 2004 site), you know that there are some talented fan artists out there.  This year's festival has a lot of great entries to check out.</p><p>Tokyopop will polish off the first manga series and then keep our wallets light as they move into the second manga series.  Geneon appears set to continue their glacial release pace for the TV series as volume five released on 14 January and volume six slated for release on 13 April.  Volume five saw the release of the intially omitted episode &quot;Hitler's Legacy&quot;.  Fan reaction has typically been &quot;This is tame; why wasn't this released on DVD before?&quot;.  Let's just hope Geneon picks up the pace  more in 2004.</p><p>Lupin is also back for another run on Adult Swim, but no new episodes are being aired.  Is this the last hurrah for Lupin on U.S. airwaves?  Only time will tell...  The PS2 game from Bandai should finally hit shelves on 10 February and has been receiving some early but mixed reviews.  AnimEigo has been silent about releasing <em>Babylon</em> on DVD, but fingers are crossed that if they do that they will acquire the anamorphic print used in the Japanese release.</p><p>Funimation will be the studio of the year though in the U.S.  Both <em>Dead or Alive</em> and <em>Nostradamus</em> are on tap for a spring release, and the interview with Monkey Punch only sweetens the deal.  Funimation has also indicated that they are looking into getting a theatrical run for one or both films.  They also have stated that once these two titles are out we should see the rest of their titles come out quickly.</p><p>The Japanese will likely be fortunate enough to see a new TV special though some rumors have been floating around that they might be seeing a new theatrical release instead.  <em>Cinderella Boy</em> is being released quickly on seven DVDs in Japan as well making it a pricy purchase.  The Italians will also be seeing this series on DVD in 2004 though at a much lower price point.</p><p>Hopefully, we will also start to see some information about how the production for the live-action film is going.  Either way, 2004 will keep Lupin fans busy and their wallets light.</p>"
    },

    {
      "title": "Parting Shots",
      "content": "<p>What more can I say?  This past year was something I never thought I would see; having been a Lupin fan for a long time, it is great to see the series finally getting its due from the U.S. fanbase outside of <em>Cagliostro</em>.  <em>Operation:  Return the Treasure!!</em> was a great special, and <em>Cinderella Boy</em> was amusing as well.  I really hope it gets released over here.  I can't wait to get my hands on Funimation's release of <em>Dead or Alive</em>; this film is going to give Lupin fandom a big boost when it comes out.</p><p>Until that time, my Japanese theatrical box set happily sits on my shelf asking me when more of its R2 brethren will join it.  Tokyopop will get the bulk of my money this year though; really need to clean off some shelf space to prepare for the second series manga release...  Well, that's all I have for this month.  See you next month!</p>"
    }
  ]
}