{"id":"10","author":"Arsene Lupin III","subject":"That's it. I'm leaving.","body":"I've had it. Lupin stuff is too rare, and I don't like the\r\napproach these other films take (anything past \"Fuma Clan\"), and this\r\nwhole thing just stinks. I think I'll just tear down my crappy Lupin III\r\nweb site (as it is) and re-dedicate it to Mystery Science Theater 3000.\r\nMaybe I'll fall for some other, more available anime... like Tenchi\r\nMuyo!, Pokemon, Project A-ko or Sailor Moon. I mean, is it really *worth*\r\nit to look so hard for all this merchandise and celluloid? \r\nBesides, I don't think anyone except Luis Cruz and Bruce Osborne\r\n(thanks guys) even listens to what I say on this barren ML (~4 days of\r\nsilence.. on an anime-based list?!), because the only responses I get\r\nare... \"that's your .sig quote? Dubs are evil.\" or a complete change of\r\ntopic that completely ignores my original question (like that question\r\nabout Lupin's dub names I wrote about on the 3rd!... and in case you\r\nforgot what that was, it's on my web site under \"Editorials\"). I came\r\nseeking for... no, ~pleading~ for guidance and answers, but what I mostly\r\ngot was shame and the shoulder (only two people seem to have read my\r\nfan-fiction-script-thing, and only 1, Mr. Cruz, even reported on it).\r\nI'll unsubscribe to this list soon.\r\nNow that I think about it, maybe it's not the series that stinks,\r\nmaybe it's just some of the more self-centered and inept people in the\r\ngroup. Regardless, I'll change my site theme and say, \"Farewell, beloved\r\nLupin... and a flight of angels sing thee to thy rest.\"\r\n\r\nAnd I had *so* much Lupin fan art to scan in...\r\n--------------\r\nTalesoftheWolf@Juno.com : (What's left of the) Lupin the Third web site\r\nis at:\r\nhttp:\/\/www.geocities.com\/Tokyo\/Market\/8050\/\r\n\"Who can put a value on human life? I mean, who decides who lives and who\r\ndies?\"\r\n\"I do. Remember? I called dibs.\"\r\n-Joel Robinson and Crow T. Robot, _Mystery Science Theater 3000_\r\n\r\n___________________________________________________________________\r\nGet the Internet just the way you want it.\r\nFree software, free e-mail, and free Internet access for a month!\r\nTry Juno Web: http:\/\/dl.www.juno.com\/dynoget\/tagj.","message_date":"August 28 1999 1:17 AM"}