{"id":"100","author":"rstickles@sympatico.ca","subject":"Oops... repost of 'Lupin in English FAQ' with proper formatting","body":"Sorry about the jumbled post folks, looks like Hotmail likes to drop the carriage returns...\r\n\r\n\r\nAVAILABILITY OF LUPIN III IN ENGLISH version 1.2  (June 10,  2001)  First Public Posting.\r\n\r\nThe purpose of this list is to show available and in progress English translations of Lupin III on video.  If multiple english versions of the film\/special\/episode exist then preference is given to versions subtitled by active fansubbing groups or to commercial versions that are currently in print.  In future versions of this document I may add the web and email addresses of fansubbers if they so desire.\r\n\r\nIf you have any additions or corrections to any of the information contained here please feel free to contact me at rstickles@sympatico.ca.  Please correct my romanji!\r\n\r\nLupin III is copyright (c) Tokyo Movie Shinsha\r\n\r\nKey:\r\n-------\r\nSUB = subtitle\r\nDUB = dub\r\nINP = In progress\r\nOOP= Out of Print\r\n\r\n1969 Pilot Film\r\n-original version of Pilot in cinemascope aspect ratio which went unused until 1978 where it was shown as a lead in to the first Theatrical film (Lupin nei Fukusei Ningen)\r\nSUB Neko Creations (defunct) as part of The Secret File\r\n\r\n1970 Pilot Film\r\n-second version of Pilot, reshot in 4:3 aspect ratio with some minor differences in scene order and art.  This version was never shown in full but portions of the footage were used in the opening credits of the 1971 TV series starting with episode 4.\r\nSUB Neko Creations (defunct) as part of The Secret File\r\n\r\n1971 Lupin Sansei (TV Series, 23 episodes)\r\nSUB Neko Creations ep 1-4, 17-23\r\nINP Lupin Gang Anime corrections to Neko scripts for 17-20\r\n- Neko's sub scripts are publically available\r\n\r\n1974 Lupin III: Stange Psycho-Kinetic Strategy (Nenriki Chin Sakusen)\r\nINP Studio ESPper (awaiting translation)\r\nINP DarkOps (defunct)\r\n- live action film, was slated for fansub but that now seems very unlikely\r\n\r\n1977 Shin Lupin Sansei (TV Series, 155 episodes)\r\nSUB Lupin Gang Anime ep 1-4, 66, 99, 103-106, 108\r\nSUB SV2 ep 145, 155 \r\nDUB Streamline Pictures VHS (OOP)ep 145 and 155 as two volumes of \"Tales of the Wolf\" and a combined volume \"Lupin III's Greatest Capers\" \r\nINP Lupin Gang Anime ep 5-8, 16, 67, 72, 148, 151\r\n\r\n1978 Mystery of Mamo\/Secret of  Mamo\/Lupin vs the Clone\/Lupin vs Kuron\/Lupin vs the Immortal Man  (Lupin nei Fukusei Ningen\/Mamoo no Ichihen ) \r\n- originally titled \"Lupin III\" when released in Japan, the later titles were added to avoid confusion with subsequent films.  \r\nDUB Streamline Pictures VHS (OOP) , Toho dual language LD (OOP) , Image Entertainment DVD (Region 1, OOP)\r\nDUB Manga UK VHS PAL TV format (OOP?)\r\nDUB Unknown origin,  4:3 screen aspect that crops the picture (pan but no scan)\r\nSUB Any *english* fansubbed versions of this exist? (I know of a Finnish sub)\r\nINP Lupin Gang Anime (on hold)\r\n\r\n1979 The Castle of Cagliostro (Cariosutoro no shiro)\r\nSUB\/DUB Manga Ent. VHS\/DVD (Region 1), sub script by Neil Nadelman\r\nSUB\/DUB Buena Vista Home Ent. DVD (Region 2), uses Streamline dub and Carl Macek's english script for subtitles (dubtitle)\r\nDUB Streamline Ent. VHS (OOP), Toho dual language LD (OOP) \r\nSUB many fansubs exist from public scripts, most are now redundant to the commercial Manga sub.\r\n\r\n1982 Lupin VIII\/Arsene and Company\/Arsene et cie \r\n- pilot film of a series (Japan and France coproduction, and possibly DIC in Canada?) aborted due to copyright issues between Leblanc estate and TMS.\r\nINP ??? Pilot exists without vocal track which may have never been recorded. \r\n\r\n1984 Lupin III Part 3 (TV Series, 50 episodes)\r\nSUB Lupin Gang Anime ep 2, 6, 9, 17\r\n\r\n1985 Legend of Gold Babylon\/Golden Legend of Babylon (Babiron no Ogon Densetzu)\r\nSUB AnimEigo VHS\/LD as \"Rupan III\"\r\n\r\n1987 The Fuma Conspiracy\/Plot of the Fuma Clan (Fuuma Ichizoku no Imboo)\r\nSUB\/DUB AnimEigo VHS\/LD as \"Rupan III\"\r\nSUB ???\r\n\r\n1988 Lupin III: The Secret File\r\nSUB Neko Creations (defunct)\r\n- LD collection of the two Pilot Films (see individual entries), theatrical trailers for  Clone, Cagliostro, Babylon and Fuma (originally an OVA, later released theatrically), the opening\/closing scquences for the three TV series, and the opening music for Cagliostro.  Neko's sub contains only the Pilots and trailers.  Sub scripts are publically available.\r\n\r\n1989 Goodbye Lady Liberty\/Bye Bye Liberty Crisis - Begin Emergency! (Bai Bai Ribatii - Kiki Ippatsu!)\r\nDUB Manga Ent UK VHS (PAL TV format only)\r\nSUB Studio Banzai\r\nSUB Nippon Golden Network (Hawaiian TV\/KHML)\/J.N. Productions\r\n\r\n1990 Riddle of the Hemmingway Papers (Hemmingway Paper no Nazo)\r\nSUB none known\r\nINP Odyssey Anime\r\n\r\n1991 Race for Napolean's Dictionary (Napoleon no jisho wo Ubae)\r\nSUB Saiya-jin Productions\r\nINP Odyssey Anime\r\n\r\n1992 From Russia with Love (Rosia Yori Ai O Komete)\r\nSUB Lupin Gang Anime\r\nINP Odyssey Anime\r\n\r\n1993 Orders to Assassinate Lupin\/Dark Order of Assassination\/Voyage to Danger (Lupin Ansatsu Keikaku\/Lupin Ansatu Shirei)\r\nSub Odyssey Anime (v1)\r\nSUB DarkOps (defunct)\r\n\r\n1994 Mighty Sword that Cuts Steel\/Zentesu Sword is on Fire (Moeyo Zantetsuken)\r\nSUB Odyssey Anime (v1)\r\nSUB S. Baldric productions (bootleg?)\r\n\r\n1995 Die! Nostradamus\/Go to Hell Nostradamus (Kutabare Nostradames)\r\nSUB Odyssey Anime (v2)\r\nSUB Neko Creations (defunct)\r\n\r\n1995 Pursuit of Harimao's Treasure (Harimao no Hiho wo Oe)\r\nSUB Odyssey Anime (v4)\r\nINP Lupin Gang Anime - timing\r\n\r\n1996 Dead or Alive (Deedo oa Araibu)\r\nSUB Lupin Gang Anime\r\nINP Odyssey Anime\r\n\r\n1996 Legend of Twlight Gemini\/Secret of Twilight Gemini (Towairaito Jemini no Himitsu)\r\nSUB Odyssey Anime (v2)\r\nSUB Lupin Gang Anime\r\nSUB Neko Creations (defunct)\r\n- Neko's sub scripts are publically available\r\n\r\n1997 In Memory of Walther P-38\/Island of Assassins (Warusaa P-38)\r\nSUB Lupin Gang Anime\r\nINP Odyssey Anime\r\n\r\n1998 Memories of Blaze - Tokyo Crisis (Honoo no Kioku - Tokyo Crisis)\r\nSUB Lupin Gang Anime\r\nINP Odyssey Anime\r\n\r\n1999 Fujiko's Unlucky Days - Da Capo of Love  (Ai no Da Capo - Fujiko's Unlucky Days)\r\nSUB Odyssey Anime (v1)\r\nSUB Don Quixote\r\nINP Lupin Gang Anime\r\n\r\n2000 1$ Money Wars\r\nINP Odyssey Anime\r\n","message_date":"June 11 2001 10:41 PM"}