{"id":"102","author":"Arsene Lupin III","subject":"[OT] Netiquette & Slime (was: Battle Royale in NY)","body":"> Well yes, but I've mentioned anime that wasn't Lupin\r\n> before. \r\n\r\nHence why I brought it up. This is the Lupin III\r\nmailing list.\r\n\r\nAs I have mentioned in the past, it is proper\r\n\"netiquette\" to:\r\na)Remain on-topic if possible on a mailing list or\r\nnewsgroup, or if not always possible:\r\nb)Note the off-topic nature of the string in the\r\nsubject header with the following 4 simple characters\r\npreceding the actual subject:\r\n[OT]\r\n\r\nSo, for example, this string, formerly \"[lupin] Battle\r\nRoyale in NY\" would read to the subscribers,\r\n\"[lupin][OT] Battle Royale in NY.\"\r\n\r\nReal tough, huh? I would recommend that the readers of\r\nthis ML delete or ignore letters of an off-topic\r\nnature if they are not appropriately treated as such.\r\n\r\nI'm not trying to be rude or mean, Daniel. I'm just\r\ntrying to tell you that this is the Lupin the Third\r\nmailing list. This is not a General Anime mailing\r\nlist, or a Japanese Film mailing list, or even the Joe\r\nDon Baker mailing list. This is the Lupin III M.L. If\r\nyou wanna get off-topic, that's fine, but at least\r\ntell us before you throw whatever nonsensical\r\nfiddle-faddle into our Lupin-reserved mailboxes. :)\r\nThank you.\r\nOn with the off-topic string:\r\n\r\n<Re: \"The Green Slime\">\r\n\r\n> Well that's nice, but since you've never seen the\r\n> film that Fukasaku did, \r\n> you really don't know what it's about.\r\n\r\nBwahahaha. If only you knew.\r\n\r\n>From the Mystery Science Theater 3000 Information Club\r\nWebsite:\r\n---\r\nEpisode K00 - THE GREEN SLIME \r\n(1968; Japan\/USA co-production; G; 90m)\r\na.k.a. GAMMA SANGO UCHU DAISAKUSEN (original\/Japan)\r\nProd: Ivan Reiner\r\n(scr\/War Between the Planets)\r\nProd: Walter H. Manley\r\n(816-Prince of Space**)\r\nAssoc Prod: William Ross (also actor)\r\nDir: *KINJI FUKUSAKU* (Uchu Kara No Messeji; Tora!\r\nTora! Tora!)\r\n(there are more details, truncated to save space). URL\r\nis at:\r\nhttp:\/\/www.mst3kinfo.com\/daddyo\/di_K00.html\r\n\r\n**Prince of Space was a Japanese film mocked in the\r\n8th season of MST3K.\r\n\r\nTrivia: Reportedly, THE GREEN SLIME was the first\r\nofficial Japanese-USA co-production of a movie. The\r\nfilm's theme song was released as a single (in those\r\ndays...a 45 RPM record).\r\nSpecial added note: This movie was never completely\r\nriffed on by the Brains. Only bits and pieces were\r\nused for the original MST3K demo tape.\r\n--\r\nBadda-bing.\r\nNot worth my time, I've seen all I need to. \r\n\r\n> But ok. If you want me to mention something\r\n> Lupinesque, this is vaguely \r\n> connected to it.\r\n\r\nI believe I'm not the only one who would like this\r\nML's posters to try to stay on topic.\r\n\r\nInterpret that as you will.\r\n\r\n> If anyone on here is a novice or an\r\n> expert at flash, \r\n> newgrounds.com is looking for any anime parodies or\r\n> tributes that are NOT \r\n> Pokemon, DBZ or Sailor Moon. And NG gets hundreds of\r\n> thousands of viewers a \r\n> day. So here's your chance to introduce these \"I\r\n> only like Ninja Scroll\" \r\n> newbies to the world of Lupin. Just make sure it\r\n> looks cool, isn't overtly \r\n> offensive, and  you're set.\r\n\r\nGosh, I wish I could afford national-scale\r\nadvertisements. I would put Castle Cagliostro and\r\nRupan III commercials on TV. With permission of\r\ncourse.\r\nStupid lack of money.\r\n\r\nSee ya.\r\n\r\n\r\n=====\r\n\"Arsene Lupin III\"\r\nwebmaster@lupinthethird.nospam.com\r\n(Remove \"nospam\" to reply)\r\nhttp:\/\/www.LupintheThird.com\r\n\r\n__________________________________________________\r\nDo You Yahoo!?\r\nGet personalized email addresses from Yahoo! Mail\r\nhttp:\/\/personal.mail.yahoo.com\/\r\n","message_date":"June 22 2001 1:12 AM"}