{"id":"104","author":"Arsene Lupin III","subject":"Re: FLCL and Copyrights","body":"\r\n> Furi Kuri, I think....\r\n\r\nOr as I like to call it, \"Fuli Culi.\" Someone picked\r\nit up in the states (Synch Point, I think?), it's a\r\nmulti-part Gainax OAV series. The Japanese DVDs have\r\nEnglish subtitles from Volume 2 on. I have never seen\r\nthe series, and probably won't for a while. I'd love\r\nto see this reference though, I'll have to put it on\r\nmy site, alongside the \"Here is Greenwood\" acting\r\nscene.\r\n\r\nAbout the copyright thing, here's something\r\ninteresting I've learned by reading up on the subject:\r\n\r\nIn America, \"Arsene Lupin\" has been public domain\r\nsince 1991.\r\n\r\n\"But then why did the 1991 and 1992 releases of\r\n'Castle of Cagliostro' use 'Wolf?'\"\r\n\r\nHad anyone here read the article I posted about Carl\r\nMacek, you would have read this little bit:\r\n\r\n\"The concept of 'wolf,' etc. was created to appease\r\nthe film's rights' holders who feared that there might\r\nbe some fallout from the \"use' of Arsene Lupin - it\r\nwas a way to get the film into the market.\"\r\n\r\nRobert Woodhead has also been known to agree with this\r\nconcept: Arsene is free game in America. The only real\r\npreventions from calling him Lupin were the paranoid\r\nrights-holders.\r\n\r\nSo basically, Daniel, what I think Manga meant was\r\nthat they probably spent a lot of time convincing TMS\r\nto finally calm down about the whole paranoia thing\r\nand permit them to use the Lupin name.\r\nAbout dang time too. I dislike the name \"Rupan.\"\r\nEspecially when you hear the name spoken by English\r\nvoice actors.\r\n\r\nIt's unfortunate that Manga did not use more common\r\nsense in re-dubbing \"Cagliostro.\"\r\n\r\n\r\n\r\n=====\r\n\"Arsene Lupin III\"\r\nwebmaster@lupinthethird.nospam.com\r\n(Remove \"nospam\" to reply)\r\nhttp:\/\/www.LupintheThird.com\r\n\r\n__________________________________________________\r\nDo You Yahoo!?\r\nGet personalized email addresses from Yahoo! Mail\r\nhttp:\/\/personal.mail.yahoo.com\/","message_date":"July 12 2001 8:58 AM"}