{"id":"11","author":"Luis A. Cruz","subject":"Re: That's it. I'm leaving.","body":"-----BEGIN PGP SIGNED MESSAGE-----\r\nHash: SHA1\r\n\r\nI'll preface my response with this; I hope that this is\r\na little reverse psychology to get us all to post a bit\r\nmore. :)\r\n\r\n> I've had it. Lupin stuff is too rare, and I don't like the\r\n> approach these other films take (anything past \"Fuma Clan\"), and\r\n> this  \r\n\r\nTo each his own; some of the post-Fuma movies\/specials are pretty\r\ngood.\r\n\r\n> Maybe I'll fall for some other, more available anime... like Tenchi\r\n> Muyo!, Pokemon, Project A-ko or Sailor Moon. I mean, is it really\r\n> *worth* it to look so hard for all this merchandise and celluloid? \r\n>  \r\n\r\nIMO, you should fall for Tenchi Muyo and Project A-ko (at least the\r\nfirst\r\nfilm) anyway. :)  Both are good shows; never been able to get into\r\nPokemon\r\nor Sailor Moon myself.  As for the merchandise, it is becoming more\r\nand more\r\navailable on ebay each day.  The celluloid will set you back though;\r\nyou can\r\nfind places that sell the raw Japanese tapes, but they are wicked\r\nexpensive.\r\n\r\n> Besides, I don't think anyone except Luis Cruz and Bruce Osborne\r\n> (thanks guys) even listens to what I say on this barren ML (~4 days\r\n> of silence.. on an anime-based list?!), because the only responses\r\n> I get are... \"that's your .sig quote? Dubs are evil.\" or a complete\r\n> change of  \r\n\r\n*sigh*  That's the peril of the net, having to deal with clueless\r\njerks.\r\nAs for this list being barren, maybe all of us Lupin lovers are\r\nintroverts. :)\r\nI know that I lurk more than I post in all the MLs and newsgroups I\r\nread.\r\nAlso, its hard to talk about a show that you can't watch too much;\r\nwith no\r\nUS company looking to purchase the rights, we can't even start the\r\nrumor\r\nmills in motion.  At best, we will get a subbed version of Cagliostro\r\nby\r\nthe end of the year.\r\n\r\n> And I had *so* much Lupin fan art to scan in...\r\n\r\nI think that speaks volumes about why you should stick around; it's\r\nthis\r\nkind of material that may generate more interest in this ML and with\r\nthe\r\nanime community at large.  Just my thoughts.\r\n\r\n- ---\r\nLuis A. Cruz\r\ncruzl@ccs.neu.edu\r\nhttp:\/\/www.ccs.neu.edu\/home\/cruzl\/\r\nAnime Video Game Resource Center: \r\nhttp:\/\/www.ccs.neu.edu\/home\/cruzl\/avrc\/\r\n\r\n-----BEGIN PGP SIGNATURE-----\r\nVersion: PGPfreeware 6.5.1 for non-commercial use <http:\/\/www.pgp.com>\r\n\r\niQA\/AwUBN8h35bhns7ex7ljSEQL6FwCgnAzPxuKF10Lvv3MwA5PZ45hbJdcAoIAK\r\nhdPB+QViy\/yezYSdLqUzoLrF\r\n=\/oWT\r\n-----END PGP SIGNATURE-----","message_date":"August 28 1999 6:59 PM"}