{"id":"110","author":"Arsene Lupin III","subject":"Re: [OT] Link on GCN","body":"> Basically, he ass\/u\/me\/d that everyone follows\r\n> videogame news.  Footage of\r\n> the\r\n> Legend of Zelda game for the upcoming Nintendo Game\r\n> Cube was released.  The\r\n> new\r\n> character art for Link (the main character gamers\r\n> have come to know and love\r\n> over the years) has drawn criticism from many\r\n> gamers.\r\n> \r\n> Of course, this sort of confusion happens when\r\n> off-topic messages are posted\r\n> to\r\n> a list. ;)\r\n\r\nOK Luis is officially cool now. :D\r\nAlso, this is sorta interesting how people are\r\nditching Nintendo solely because they are making a new\r\ncharacter design for Link. I mean, come on....Link\r\nlooked more detailed on \"Zelda II (NES)\" than \"Zelda\r\n(NES),\" but did the gameplay back up the visuals?\r\nHardly. Zelda 1 kicked major ascot, gameplay-wise.\r\nZelda 2 just kinda.....stunk. Well Miyamoto is taking\r\nZelda back to its more youth-oriented roots. Does that\r\nmean the gameplay's going to suck? Hardly. EAD has\r\nbecome a master of gameplay over the past 10+ years.\r\nZelda will be glorious, just wait and see.\r\nAnd if I may make an additional comment...that footage\r\nof Zelda was supposed to have amazingly smooth\r\nanimation, and many people have changed their\r\npositions  from \"oh his character design looks like\r\npoop,\" to \"this is going to kick major arse.\" I don't\r\nhave QuickTime, so I can't watch it. :-( But still, if\r\nyou can, download the video and don't be so quick to\r\ndecide when you haven't even played it.... It seems\r\neveryone is being a bit whiny about it. :P\r\nNintendo knows video games. Sorry if their in-house\r\nstuff isn't more \"mature\" (since when was it ever\r\nmature?). I do have a complaint about Link's design\r\nthough. What's with the Egyptian-heiroglyph eyes?\r\n\r\n\r\n=====\r\n\"Arsene Lupin III\"\r\nwebmaster@lupinthethird.nospam.com\r\n(Remove \"nospam\" to reply)\r\nhttp:\/\/www.LupintheThird.com\r\n\r\n__________________________________________________\r\nDo You Yahoo!?\r\nMake international calls for as low as $.04\/minute with Yahoo! Messenger\r\nhttp:\/\/phonecard.yahoo.com\/\r\n","message_date":"August 24 2001 1:58 AM"}