{"id":"12","author":"eat food","subject":"Re: That's it. I'm leaving.","body":"\r\n>> I've had it. Lupin stuff is too rare, and I don't like the\r\n>> approach these other films take (anything past \"Fuma Clan\"), and\r\n>> this  \r\n>\r\n>To each his own; some of the post-Fuma movies\/specials are pretty\r\n>good.\r\n\r\ncoughcoughWalthercoughcough...\r\n\r\n>Both are good shows; never been able to get into\r\n>Pokemon\r\n>or Sailor Moon myself.  \r\n\r\nOut of all the shows he's named Sailormoon is the only one I take a shine to. \r\n\r\n>The celluloid will set you back though;\r\n\r\n*evil grin*\r\n\r\n>you can\r\n>find places that sell the raw Japanese tapes, but they are wicked\r\n>expensive.\r\n\r\nI found Lupin VS. Kuron and all the other movies in raw Japanese to rent at\r\nthis market I go to (whenever I want the latest Shonen Jump or some Pocky).\r\nIt's 5 bucks to rent, a little bit steep, but not much more expensive than a\r\nfansub.....if only I can figure out some way to hook two vcrs together and\r\nmake a copy...\r\n\r\n>*sigh*  That's the peril of the net, having to deal with clueless\r\n>jerks.\r\n\r\nI guess I'm a clueless jerk, complaining about cheesy jokes dubs add in that\r\naren't in the original.\r\n\r\n>As for this list being barren, maybe all of us Lupin lovers are\r\n>introverts. :)\r\n\r\nOh yeah, I'm a HUGE introvert! I picked work over my first date this summer.\r\nNow that's antisocial.\r\n\r\n>at best, we will get a subbed version of Cagliostro\r\n>by the end of the year.\r\n\r\nIf we already don't have it subbed....(ask me, I will tell you where you can\r\nstill get it....I got my copy from this particular fansub distro)\r\n\r\n\r\n-valerie \r\nhttp:\/\/members.tripod.com\/~valerie\r\n----------\r\nLike rescuing precious stones that are confined in a safe...\r\nIt would be unjust to leave a girl here to be made a bride...\r\nI will tell you the tale of the green fields.\r\nThis is the work of every thief.\r\n-Lupin, Cagliostro no Shiro","message_date":"August 28 1999 9:30 PM"}