{"id":"14","author":"Arsene Lupin III","subject":"OK, I'll stay... read this please.","body":"About what Luis said earlier...\r\n\r\n>Should have qualified that statement.  I meant that someone who writes\r\nyou\r\n>to tell gripe specifically about your sig (which is what the original\r\npost\r\n>seemed to indicate) is basically being a jerk IMO.  If you want to\r\ndiscuss\r\n>or complain about dubbing in general, be my guest, but don't jot a note\r\nto\r\n>someone griping about their sig.  Maybe I am being the jerk here and\r\n>misunderstanding what the original post meant and stuffing my foot\r\nfarther\r\n>down my throat. :)\r\n\r\nBTW, that is accurate... and exactly why I was upset, I mean, it's like\r\nshe didn't even read the original message, for crying out loud!! (Which\r\nhappened to be about Lupin's new NTV name, thank you...)\r\n\r\nAlso, sorry I haven't updated my website since the 17th. I have no real\r\nway to get at it. as I can't use NetZero (since Juno doesn't require\r\nDial-Up Networking, it's the only modem-based program I've been able to\r\noperate). But then, most of you probably haven't even visited it yet. \r\n\r\nOh, and Valerie, apparent from your response to my calm fury...\r\n\r\n>Anyway, you don't have to get in such a huff about no one posting....\r\n\r\n...you pretty much missed the point. Maybe you should read it again (w\/o\r\nthe parenthesesed sub-topics):\r\n\r\n>Besides, I don't think anyone except Luis Cruz and Bruce Osborne even\r\nlistens to what I say on this barren >ML, because the only responses I\r\nget are... \"that's your .sig quote? Dubs are evil.\" or a complete change\r\nof >topic that completely ignores my original question. I came seeking\r\nfor... no, ~pleading~ for guidance and >answers, but what I mostly got\r\nwas shame and the shoulder.\r\n\r\nGet it now? \r\n\r\nBy the way, has anyone here even *heard* of \"Mystery Science Theater\r\n3000\"? It ran for 10 years, you know...\r\n\r\nHere's my website, for all to see...\r\n\r\nTalesoftheWolf@Juno.com : Lupin the Third website is at:\r\nhttp:\/\/www.geocities.com\/Tokyo\/Market\/8050\/\r\n\"Who can put a value on human life? I mean, who decides who lives and who\r\ndies?\"\r\n\"I do. Remember? I called dibs.\"\r\n-Joel and Crow T. Robot, MST3K\r\n\r\n___________________________________________________________________\r\nGet the Internet just the way you want it.\r\nFree software, free e-mail, and free Internet access for a month!\r\nTry Juno Web: http:\/\/dl.www.juno.com\/dynoget\/tagj.","message_date":"August 29 1999 6:07 PM"}