{"id":"147","author":"Arsene Lupin III","subject":"The Anime Encyclopedia has problems. Big ones.","body":"> I was reading the Anime Encyclopedia, and it has a\r\n> nice spread on Lupin, \r\n> with little-known facts. For one thing, Goemon's\r\n> seiyuu also played Harlock. \r\n> The original Arsene Lupin's term of expiration is\r\n> suppose dto be 2016.\r\n\r\nMaybe. But I heard his copyright expired in 1991,\r\nsince he died 50 years before. Since the legal reform\r\nof copyright came after 1995 (sez the \"Anime Encyc.),\r\nit doesn't make sense that the change in law should\r\napply to something that had already left copyright,\r\nunless those Europeans have post de facto\r\nlaws....which would just suck.\r\n\r\n> Lupin \r\n> VIII was a French-Japanese co-production.\r\n\r\nI thought I mentioned that...about....a year ago on\r\nhere.\r\n\r\n> They even\r\n> have an anime from Toei \r\n> called \"Lupin vs Holmes\", based on the story of the\r\n> same name! Hopefully \r\n> since Funimation is closely connected with Toei,\r\n> they'll get their hands on \r\n> that one eventually. :)\r\n\r\nWell, Cloverway (think Sailor Moon S\/SuperS dubs) IS\r\nToei America, basically. So it's possible it could\r\ncome from them, too.....but not likely.\r\n\r\nAt any rate, that Encyclopedia has boatloads of facts\r\nWRONG about Lupin III, I'm wondering if I should trust\r\nits info beyond what I know.\r\n\r\nJigen's VA is named \"Kiyoshi Kobayashi,\" not \"Kiyoshi\r\nKomori.\"\r\nThe Golden Legend of Babylon was NOT Lupin's final\r\ntheatrical anime outing, despite the Encyclopedia's\r\nstatements to the contrary. Dead or Alive was. The\r\nEncyc. claims \"Die! Nostradamus\" and \"Dead or Alive\"\r\nwere both TV movies. Had this woman SEEN them, and\r\nnoticed that they were in *letterbox,* perhaps this\r\nerror would not have been made.\r\n\r\n\"Tales of the Wolf\": The scripts for these TV episodes\r\nDID include the name \"Lupin\"....heck, in \"Albatross\"\r\nhe was called \"Lupin\" half the time! Did she even\r\nnotice that the cases and video footage themeselves\r\nsay \"Lupin III: Tales of the Wolf?\" And the second\r\nepisode was called \"Aloha LUPIN.\"\r\n\r\nThe legal dispute Australia sparked was not started\r\nover TV episodes, but the first Lupin anime film,\r\n\"Lupin the Third\" (a\/k\/a \"Mystery of Mamo\"). This\r\nhappened back in the late 1970's, and could hardly\r\nhave been a reason to make a last minute change to an\r\nEnglish release in 1995!\r\n\r\nGolden Legend of Babylon (again): The bike chase was\r\nnot \"hilarious.\" But that's a matter of opinion. The\r\nfact is, it did NOT take place in Madison Square\r\nGarden, but on a giant manufactured face that (for\r\nsome odd reason) reacts to the characters riding on\r\nit. Heck, the cast never visits Madison Square until\r\nthe finale of the film. The buried gold is NOT inside\r\nan alien spaceship, and thanks for mentioning the\r\nsemi-surprise ending: there is no God, *aliens* want\r\nthe gold. Go figure. It says Lupin misses out on sex\r\nwith a space goddess. I don't think she ever implied\r\nshe wanted to have sex with Lupin....only that she\r\nloved him.\r\n\r\nDie! Nostradamus: At no point in the film did Jigen\r\nand Lupin ever disguise as soccer players. Though once\r\nthey did verbally claim to be the managers of the\r\nsoccer team, while wearing their regular clothes.\r\n\r\nDa Capo of Love-- Fujiko's Unlucky Days: Yes, Fujiko\r\ngives Lupin the loot from the Swiss Bank, and is\r\ninterested in the Columbus File\/Egg. That sums up\r\nabout the first two minutes of the film. The thing is,\r\nFujiko *memorizes* the file and then immediately gets\r\namnesia! That's a superb summary of plot point A, And\r\nthat's 5 minutes in! While not necessarily an error,\r\nit is yet another sign that the writers did not view\r\nthe film.\r\n\r\n$1 Money Wars: The woman who bought the ring for a\r\ndollar was Cynthia, not \"St. Cyr.\" How does one get\r\n\"St. Cyr\" from \"Shinshia?\"\r\n\r\nThere's more problems, but I gotta go. More later. ;)\r\n\r\n\r\n=====\r\n\"Arsene Lupin III\"\r\nwebmaster@lupinthethird.nospam.com\r\n(Remove \"nospam\" to reply)\r\nhttp:\/\/www.LupintheThird.com\r\n\r\n__________________________________________________\r\nDo You Yahoo!?\r\nCheck out Yahoo! Shopping and Yahoo! Auctions for all of\r\nyour unique holiday gifts! Buy at http:\/\/shopping.yahoo.com\r\nor bid at http:\/\/auctions.yahoo.com\r\n","message_date":"December 15 2001 10:58 PM"}