{"ml_message_id":"152","author":"Squall285@aol.com","subject":"Re: Cagliostro News","body":"hmm hey guess what the first part of the script is up! \r\n\r\nhere it is thanks to the people who have \r\nA big thanks to Mari though! \r\n\r\nerik\r\n\r\n----- Attachment (Rupan script.doc) -----\r\nRupan n' Jigen are at the hideout. R is watching the news\r\nwhile J is laying in a couch drinking Brandy\r\n\r\nTV\r\n... Yesterday night there was a failed attempt to steal the\r\nprivate paintings collections that arrived by ship from\r\nLondon. According to police sources, the attempt would have\r\nbeen made by the world famous thief, Rupan Sansei. it is said\r\nthat he and his associates...\r\n\r\nR turns the TV off and turns to J\r\n\r\nR: (amused) Well, it seems like someone believes this was our\r\ndoing...\r\nJ: (nodding) it seems so\r\nR: Then... (jumps from the couch) we\u0092ll have to steal those\r\npaintings!!\r\nJ: Here we go\u0085. (puts the Brandy in the table next to him and\r\nlooks at R, expecting an explanation)\r\nR: I can\u0092t let my reputation be stained by such a foolish\r\nattempt, I have to make everybody see what Rupan Sansei can\r\ndo. Now, we should begin by finding out whether this is a\r\nmisunderstanding or a set up.\r\nJ: And how exactly are you gonna do that?\r\nR: (amused, blinking an eye) Watch! (takes out a cell-phone,\r\ndials, and waits)\r\n[HERE, A SPLIT SCREEN WITH ZENIGATA WOULD BE GOOD]\r\nZ: Yes?\r\nR: Hello Tot-San!!!\r\nZ: (very angry) Rupaaaan!! What th\u0097\r\nR: (interrupting) No, listen to me, first of all, don\u0092t\r\nbother to track this call, I\u0092m using a cell phone.\r\nZ: (upset) Umph (silence) \u0085 You didn\u0092t do it, right?\r\nR: (happy) I\u0092m glad to see you don\u0092t confuse me with a simple\r\nburglar.\r\nZ: (triumphant) I knew it!! It just wasn\u0092t your style!! I\u0097\r\nR: (interrupting again) Ok, Ok. Look, I wanna know what made\r\nthem think it was me.\r\nZ: And exactly WHAT makes you think I\u0092ll tell ya?\r\nR: (teasing him) Oh\u0085 I don\u0092t know, maybe the fact that, if\r\nyou don\u0092t tell me, this fake\u0092s gonna keep on doing this\r\nthings, and you\u0092ll look like the fool who couldn\u0092t catch such\r\na clumsy thief.\r\nZ: ([IF WE\u0092RE USING SPLIT-SCREEN, ZENIGATA SAYS \u0093DAMN!\u0094 IN A VERY LOW\r\nVOICE, ALMOST UNSPOKEN, AND CONTINUES] very mad) I\u0092m not telling\r\nyou!!\r\nR: All right, (bluffing) then I\u0092ll assume it was the note I\r\nheard about, correct?\r\nZ: (surprised and screaming) How did you --??!! (realizing he\r\nhas given himself away, clears his throat and starts over) I\r\nmean, why do you think that?\r\nR: (very amused) No reason at all, Tot-san, see ya! (hangs\r\nup)\r\nZ: (irritated) Wait Rupan!!!\r\n(hangs violently)\r\n\r\nHIDEOUT\r\n\r\nJ: So, well?\r\nR: It was deliberate (serious) I don\u0092t like this Jigen, not a\r\nbit. I think someone\u0092s trying to make us look bad. But, why?\r\nJ: Maybe it\u0092s one of your enemies\u0085 (sarcastic) not that you\r\nhave any.\r\nR: Yeah, I get ya.\r\nJ: Maybe\u0097\r\nR: (interrupting) It doesn\u0092t matter, we\u0092ll steal that\r\ncollection anyways, so we better start our research now!\r\nJ: (resigned) Ok. We\u0092ll first have to check the museum\u0092s\r\nsecurity system and get some blueprints of the place, too.\r\nR: I\u0092ll also have to sneak in, to see the way things are\r\ndisplayed, and have an idea of the quickest way to make our\r\nway there.\r\nR n\u0092 J look at each other with complicity and nod.\r\n\r\nWE SEE SOME CUT-SCENES:\r\n\r\n1ST.- R N\u0092 J STUDYNIG SOME BLUEPRINTS.\r\n2ND.- J, AT NIGHT, SPYING ON SOME SECURITY GUARDS.\r\n3RD.- R, DISGUISED AS A HANDYMAN, OR A TOURIST, CHECKING THE MUSEUM OUT.\r\n4TH.- R N\u0092 J TIMING SOME MOVEMENTS.\r\n5TH.- J N\u0092 R PREPARING SOME GADGETS, TOOLS (ROPE WITH ARPOON, WALKIE-\r\nTALKIES-LOCK PICKING EQUIPMENT-METAL BARS-ETC) AND THE GUNS\r\n\r\nHIDEOUT\r\n\r\nJ n\u0092 R are ready to leave","message_date":"April 21 2001 10:31 AM"}