{"id":"154","author":"rvaldes","subject":"re: Playstation Game","body":"Ah, Esso gas stations seem to have done tons of Lupin promo items.  I have a \r\ncouple of coffee cups and a drinking glass (a very small glass) and I've seen \r\n(but been too poor to get) a few other Lupin glasses from Esso on E-bay.  \r\nI'll hopefully be updating my page of  Lupin toys soon.  I don't suppose \r\nanyone out there happens to have Medicom Cagliostro figures they want to part \r\nwith?  I have only suceeded in finding Zenigata and Goemon so far. sigh.\r\n\r\n\r\nhttp:\/\/www.panix.com\/~neko\/toys\/lupin\/index.html\r\n\r\n\r\n---------- Original Text ----------\r\n\r\nFrom: \"Mark Stevenson\" <lupansansei@hotmail.com>, on 1\/6\/00 4:08 AM:\r\n\r\nHas anyone else played the Playstation Game of Cagliostro? It came out about \r\n3 years ago (or more???) in Japan. I played through it to the end but it was \r\nkind of short and there was no real challenge, it was just a couple of CDs \r\nfull of nice Lupan style graphics, a few interesting clips and facts from \r\nthe movie. What you did was rescue the girl from the castle. The whole thing \r\nwas in the style of those early C64 text adventures (but with better \r\ngraphics!). If someone knows how to make this game more interesting I'd like \r\nto know. I think there may be some bonus areas or something.\r\n\r\nAlso, Lupan merchandise; I have a Lupan III doll from a gas station in \r\nJapan. You get it when you buy a certain amount of fuel or something. I'll \r\nsee if I can post a photo to the Yahoo! club in the next few weeks. Also, I \r\nhave a full page newspaper add from Japan advertising a \r\nphotocopier\/printer\/fax\/modem thing, using pictures of Lupan, Jigen, Goemon \r\nand Fujiko. The caption reads; \"tanomoshii aibou no odemashi da ze\" and \r\n\"kondo wa ichidai shiyaku(4 yaku)\". My scanner is on the blink so I'll post \r\nit later if anyone wants to see it.\r\n______________________________________________________\r\nGet Your Private, Free Email at http:\/\/www.hotmail.com","message_date":"January 6 2000 9:39 AM"}