{"id":"155","author":"SPIKE77@aol.com","subject":"introducing myself to the mailing list","body":"Hi:\r\n\r\nThis will probably be a long post, so please forgive me. I'd like to \r\nintroduce myself to the mailing list and share a little bit about my \r\nfascination about Lupin.\r\nI'm in the animation business, directing TV shows and was recently employed \r\nto do a fast-paced action adventure show. We were told to look to certain \r\nanime for reference and I decided to pull out my old copy of Cagliostro. I \r\nmust say it ignited my appreciation for Lupin and all his adventures.\r\nAnd not only that, it reminded me about CHARACTER! Lupin and gang are very \r\ninteresting characters with enjoyable personalities. No matter what the plot \r\nof a particular OVA, TV special or feature is, it's always the characters \r\ninteraction that keeps me coming back.\r\nSince then I've managed to get most of the OVA's, TV specials and features \r\nfansubbed, I sponsored a few (and certainly willing to sponsor more!) and \r\nwish there was a way to get a quicker turnaround from the yearly TV special \r\nairing to fansubbing.\r\n(While on this subject, I must say Lupin gang anime do a magnificent job and \r\ntruly provide a service to us Lupin fans. Thank you, Lupin Gang Anime!)\r\nThe appetite for Lupin is so insatiable, I've even got friends from Japan \r\nsearching for stuff for me.\r\nThus far I've picked up most of the Medicom dolls (have you seen the new \r\nMedicom Lupin Stylish collection-it is FANTASTIC!), the keychains, the banks, \r\nzippo lighter,\r\ntons of manga, including the newest non-monkey punch stuff ( I really would \r\nlike to get this stuff translated), a couple of promo posters and one cel.\r\n(It's interesting to note how Lupin few animation cels make it to America. Is \r\nit easier to find in Japan or are they simply not sold to the public?)\r\nI would love for someone to compile a list of all the stuff that was \r\navailable, though looking through some of the old programs and books, they \r\nmade an endless parade of wonderful merchandise I have never seen here.\r\n\r\nI would also be interested to know what everyone's favorite Lupin film is (TV \r\nspecial or otherwise). I know Cagliostro is an obvious choice, but what about \r\nthe other stuff. I didn't enjoy Lupin's new look from ' Dead or Alive' and I \r\nseem to really always go back to ' Dark Order of Assassins',' Napoleon \r\nDictionary' and \"Zentetsu (I'm sure I spelled this wrong)  sword is burning'. \r\nIt may not have been the most well-drawn of the series, but it seems to \r\nreally have more character interaction than others. What does everyone think?\r\n\r\nI apologize for this long winded e-mail, but I didn't want to be one of those \r\nlurking guys, I anxiously read the e-mails from the mailing list as soon as I \r\nsee them and I wanted to contribute.\r\n\r\nThanks\r\n\r\nSteve\r\n","message_date":"January 7 2000 12:24 AM"}