{"id":"158","author":"Noel Tominack, UCS Help Desk","subject":"Re: Need holes in my Lupin knowledge filled","body":"On Mon, 13 Mar 2000, Luis Cruz wrote:\r\n\r\n> > Jigen is an interesting one, in the TV series he uses the phrase \"Combat\r\n> > Magnum\" which would put it in the Smith & Wesson \"K\"-frame family.  I\r\n> \r\n> According to one source, Jigen prefers to use a .38 Double-Action Colt\r\n> Executive.\r\n\r\nThere is no such model as the Colt Executive, and in one of the movies\r\nthey have an extreme close-up of the revolver which plainly shows the\r\nSmith & Wesson Logo.  The quickest way to tell is to find a scene with\r\nJigen reloading, if he pushes on the latch, its a Smith, if he pulls, its\r\na Colt.  Oh, that and the direction the cylinder rotates...\r\n\r\n> The only weapon Fujiko uses consistently is her body. ;)  Beyond that,\r\n> I haven't seen any listing of her prefered firearm.  She seems to use\r\n> whatever she can concel in her outfit.\r\n\r\nI have come to the conclusion that Fujiko uses an FN\/Browning Model 1910.\r\nIt has a shorter barrel and grip than the 1922 and is easier to conceal.\r\nAs for why she had a Nambu in \"Cagliostro\", well, you got me.  Its simply\r\na bad choice in sidearms, period.\r\n\r\n\r\n> I'm no firearms expert, but I believe you are correct that it is a Browning.\r\n\r\nI am sort of an expert insofar as I am a Curio and Relic Federal Firearms\r\nLicensee and know the arms of the period.  I am sure its a BAR because it\r\nlooks like one.  I am assuming Count Cagliostro's machine gun is an Mg13\r\nbecuase of the twin drums and grip.  Though I think the Mg34 may use\r\nthem too.\r\n\r\n\r\n> Overall, I don't think anyone has really gone through each show, special,\r\n> and movie and drawn up a list of the firearms used by each person.\r\n\r\nThat would be fun!  I wish I had them all to watch through\r\n\r\n\r\n> If I find out anything else, I'll post it to the FAQ.\r\n\r\nLook at all the images of Fujiko with a small pistol, then go to \r\nhttp:\/\/www.marstar.ca then choose catalogue, pistols, and FN 1910.\r\nDoes it look like the one she carries?\r\n\r\nOh, and if you have a clean copy of \"Mystery of the Walther P.38\" if\r\nyou could confirm the markings on Lupin's pistol as AC 41 that would be\r\ncool, when I saw it the chracters were too fuzzy.\r\n\r\nWhy yes, yes I am trying to build a collection based on anime characters\r\n\r\n\r\n___________________________________________________________________________\r\n* Noel J. Tominack (noel@umbc.edu)  CompSci Major and UCS consultant      *\r\n* University of Maryland Baltimore County                      Since 1991 *\r\n* Opinions expressed herein are mine, not those of this University or UCS *\r\n* ________________________________________________________________________*\r\n","message_date":"March 13 2000 9:53 PM"}