{"id":"171","author":"Robert Stickles","subject":"Re: BIG Lupin news!!","body":"\r\n\r\n\r\n\r\n>From: \"DANIEL ZELTER\" <danielzelter@hotmail.com>\r\n>Reply-To: lupin@mcs.kent.edu\r\n>To: lupin@mcs.kent.edu\r\n>Subject: Re: [lupin] BIG Lupin news!!\r\n>Date: Sun, 24 Feb 2002 19:59:08 -0800\r\n>\r\n>I'm guessing Columbus Files is Fujiko's Unlucky Days, since that did focus\r\n>on the Columbus Egg. I'll ask Funi at AOD as soon as ANS posts my news.\r\n>\r\n\r\n\r\n\r\n_Voyage to Danger_ is _Orders to Assassinate Lupin_ (aka Dark Order of \r\nAssassination).  I've seen this title before from the NTV info files \r\n(Hawaiian TV?) which refer to Lupin as \"Cliff\" (a throwback to Stern's \r\n_Cliffhanger_ arcade game that featured Lupin).\r\n\r\n     The only unclaimed TV Specials now are Riddle of the Hemmingway Papers, \r\nThe Race for Napoleans Dictionary, From Russia with Love, and The Alcatraz \r\nConnection.\r\nThe first four are generally considered to be of poorer quality than later \r\nTV specials (animation and story-wise, although Hemmingway hasnt yet been \r\ntranslated to english) so I wonder if Funi is waiting to see how the more \r\npopular specials fare before tackling these.\r\n\r\n     Manga UK owns the rights to Liberty Crisis but Funi could release it in \r\nNorth America; a similar situation happened with Streamline in the early \r\n90's where Castle of Cagliostro and Mystery\/Secret of Mamo were handled in \r\nthe UK by Manga.\r\n\r\nBTW, this is *terrific* news... I'm very excited that Funimation is so \r\nenthusiastic about Lupin III.  It's been a great year for \"old school\" anime \r\nfans, with Rhino's slow but so far steady release of Gatchaman paired with \r\nBattle of the Planets and Animeigo's release of the original Macross.\r\n\r\nRegards,\r\nRob S.\r\n\r\n\r\n_________________________________________________________________\r\nChat with friends online, try MSN Messenger: http:\/\/messenger.msn.com\r\n","message_date":"February 25 2002 12:42 AM"}