{"id":"176","author":"Arsene Lupin III","subject":"Re: More FAQ commentary.","body":"> The listing of the known titles was done to\r\n> illustrate just how many names \r\n> this film has and not really intended to comment on\r\n> the accuracy of the \r\n> translations.   Perhaps I should rearrange this...\r\n\r\nI think a lot of those names were just made up by\r\nvarious individuals because they thought a) they\r\nsounded \"cool\", b)\"Lupin vs. The Clones\" gives away a\r\nmajor plot point of the film, and c)\"Lupin the Third\"\r\nwas less \"Cool-sounding.\" Or something like that.\r\n \r\n> :-)  The  'Mamo' name was coined by a Streamline\r\n> employee, if I remember the \r\n> interviews I have read.  I haven't seen a raw\r\n> Japanese version of the film \r\n> (yet) so I'm not sure if the name 'Mamoo' is\r\n> actually used.\r\n\r\nWell the villain IS named Mamo in the TMS dub, so I\r\nassume the Streamline translation is accurate.\r\nRecently digging into Google\/DejaNews's archives, I\r\nuncovered this huge missive about the history behind\r\nthe English title \"The Mystery of Mamo\" (edited here\r\nand there for the sake of space).....\r\n----Begin Quote----\r\nFrom: Jerry Shaw (jshaw@deltanet.com)\r\n\r\nThe first Lupin III movie was released in Japan as\r\njust \"The Lupin Movie.\" [Ed.: Simply \"Lupin the\r\nThird,\" actually.]\r\nWhen the second movie was released, the fans in the\r\nC\/FO anime club here in Los Angeles started calling\r\nthe original one \"The Mystery of Mamo,\" to distinguish\r\nit from the new one.\r\n[Ed. Note: I have it in good faith that the CFO\r\n<Cartoon Fantasy Org.> member who came up with\r\n\"Mystery of Mamo\" was an old-school Lupin otaku named\r\nMarc Merlino(sp?).]\r\nFred Patten (once of Streamline), was a member back\r\nthen. When Carl Macek was negotiating for the rights\r\nto the movie, the Japanese were referring to it as\r\n\"Lupin. vs the Clones.\" Carl didn't like this name,\r\nsince he thought it gave away too much of the plot.\r\nSo, during the negotiations, he was calling it \"The\r\nMystery of Mamo\", because Fred had been calling it\r\nthat.\r\nWhen the final contract came back from Japan, it had\r\n\"The Mystery of Mamo\"\r\nas the title for the film.\r\n----End Quote----\r\n\r\n> The second\r\n> explanation is that the name \r\n> 'Mamoo' crops up as a villian name in either the\r\n> First or Second TV series \r\n> (ill have to check my synposes)\r\n\r\nNo, the enemy's name in the film was indeed Mamo.\r\n\r\n> I would very much like to see this version of the\r\n> film, and perhaps mate the \r\n> audio track to a widescreen video source.\r\n\r\nThis idea was used and once distributed at a con with\r\na low-quality audio source, a copy of which I have.\r\nThe reason I believed the old TMS dub was some sort of\r\npan-and-scan release is because the widescreen LD\r\npicture siddenly disappears and the audio keeps\r\nplaying over a full-screen version of the film (in my\r\ncopy). I'd have to double-check, but I believe it may\r\nhave been widescreen to begin with (I now have footage\r\nof the film's original English intro).\r\n\r\n> I was aware of both of the theatrical subs but was\r\n> unsure if I should  \r\n> include them in this list, since technically they\r\n> aren't available on \r\n> 'video' (a loose term here, but I was originally\r\n> only going to include home \r\n> video).  Are theatrical prints of Cagilostro still\r\n> making the rounds?\r\n\r\nYes, Manga Video owns all of Streamline's old film\r\ncopies. They actually showed it at an LA theater on a\r\ndouble bill with Princess Mononoke.\r\n\r\n> I should technically include the meagre translation\r\n> they did for the \r\n> Cliffhanger LD game (and include it under Lupin vs\r\n> the Clone as well) but I \r\n> haven't decided if this really counts as a 'real'\r\n> translation \r\n\r\nNo, it doesn't really, but you might want to mention\r\nit for those who were unaware of Cliffhanger's\r\nexistence.\r\n\r\n> Looks as if this would have been the only Lupin III\r\n> to be written in  French \r\n> first and later translated to Japanese and English. \r\n> The recent Arsene \r\n> Lupin\/Nighthood animated series is a France-Canada\r\n> coproduction but is \r\n> definitely written in French first.\r\n\r\nIt's possible that it was written in French, but I\r\nbelieve that it was intended for a Japanese audience\r\n(after all, to the French, who on earth is Lupin the\r\nThird? Do you mean \"Vidoq the Fourth?\"). So I figure\r\nthwe animation for 6 episodes were done, and possibly\r\nthe SFX, but the project was axed before a vocal track\r\nwas laid... in Japan.\r\n\r\n> The lack of vocal track on the pilot leads me to\r\n> believe that the project \r\n> was axed before it was farmed out to the respective\r\n> North American and \r\n> Japanese companies to record the voice tracks.  If\r\n> the scripts existed only \r\n> in French then it's no wonder that the Japanese\r\n> people involved have no idea \r\n> where the Japanese translation is.\r\n\r\nWell, from the interview, all I know is \"6 episodes\r\nwere made, then they realized something-- the Japanese\r\nhad forgot to check if the <Arsene Lupin> name rights\r\nwere free! Turns out they <LeBlancs> still owned it\r\nfor a few more years and the rights were too\r\nexpensive.\" So they axed it then, and turned their\r\nresources alsewhere.\r\n\r\n>I have an S. Baldric sub of Caglisotro as well, which\r\n>IMO is actually closer to the original than the Manga\r\n>sub.  Neil toned down a lot of language (most \r\n>notably 'kuso' is translated as 'damn' or 'blast it'\r\n>in every instance) for the Manga script, and I prefer\r\n>the phrase 'drink a lake' compared to Manga's 'drain\r\n>a lake of its water' when Lupin is trying to impress\r\n>Clarisse (and is a coy forshadowing of the ending).\r\n\r\nAh, but do you think Neil would do that for no reason\r\nwhatsoever? He did that because he knew Cagliostro is\r\na perfect family film: lots of action, romance,\r\ncomedy, and minimal violence (heck, there's only a\r\npint of blood in the whole film!). So when he\r\ntranslated it, he wrote it as he would have liked the\r\ndub to sound, an ideal script for young and old alike.\r\nThen Manga got a hold of it.\r\nRewrites, small rewrites... make Jigen cuss 5\r\ntimes.... oh let's rewrite that a little...Jigen\r\ncusses 10 times more.....you get the idea.\r\nDo you see why I am not so fond of the Manga dub?\r\nA *true* sign that Manga video really is pure evil.\r\n\r\nThat's my 2 cents on that.\r\n\r\nAlso, I believe Neil's script did refer to guzzling\r\nthe lake, but perhaps it was simply draining it.\r\nEither way, the coy foreshadowing remains. The way it\r\nwas phrased in the sub DOES make it sound like he's\r\ntrying for more stilted, Biblical dialogue, to show\r\noff to Clarisse.\r\nThe Manga English DUB actually reinstates the\r\n\"lake-drinking\" concept, assuming that it wasn't in\r\nthe subs to begin with.\r\n\r\n>If these S. Baldric subs are bootlegs, who are they\r\n>stolen from?\r\n\r\nYou misunderstand. They are simply fansubs that are\r\ntranslated, timed, mastered, and distributed with\r\nprofits in mind (i.e., they charge a hefty sum--like\r\n$12 for a crappy VCD). Nothing more.\r\n\r\n>Ick, thats ludicrous to pay for VCD's which have been\r\n>sourced from second generation VHS copies in the\r\n>first place.\r\n\r\nI purchased the first OAV of Street Fighter Zero\r\nfansubbed on VCD. It was a VERY blocky transfer, but\r\nit was an hour of Street Fighter before the Manga\r\nversion was out. When I got the SF Alpha (OAV 1+2) DVD\r\nand saw the very clear picture, I oohed and awed, but\r\ngot bothered just a bit because it *didn't* have\r\npicture breakup like the VCD did.\r\n\r\n>SVCD and Mini DVD (Mpeg-2 DVD data recorded onto\r\n>regular CD-R media) are a different story, and the\r\n>fansub community may find a medium where it's easier \r\n>for them to produce and distribute to fans.  The\r\n>ablility to have the subtitles separate from the\r\n>video source helps a lot too.  The danger of course\r\n>is that the lack of generational loss lowers the\r\n>incentive for fans to buy legit DVD releases (or if\r\n>you look at the other side of the coin, it forces\r\n>companies to add extras to the DVD's)\r\n\r\nWell we can only wait for the verdict of the fans on\r\nthis one. For now, we just need more subbers to start\r\ncatching up to current technology so they can use DVDs\r\nas sources.\r\n\r\n>The next special, Lupin the Third: Alcatraz\r\n>Connection, should be coming out on NTV's Friday\r\n>RoadShow this July, and I hope Odyssey will simply\r\n>jump at the opportunity to make it.\r\n\r\nRegarding Luis' comment, this data was not on NTV's\r\nKinyo Roodoshoo webpage (http:\/\/www.ntv.co.jp\/kinro),\r\nbut on TMS's site, within an interview that was\r\nrecently translated on the forum at\r\nhttp:\/\/lupin.sansei.st (Lupin the Third Street).\r\nThe interview was with the director of the new Lupin\r\nIII TV special, and at the end he mentions the\r\n\"subtitle\" of the film (\"Alcatraz Connection\"), and\r\nexplains the premise a bit (albeit vaguely). I figure\r\nit's in July because that is the time frame they have\r\naired in the past.\r\n\r\nVarious Notes:\r\n\"Zantetsuken\" means \"The Mighty Sword That Can Cut\r\nSteel.\" So \"Moeyo Zantetsuken\" means \"The Mighty Sword\r\nThat Can Cut Steel is On Fire!\" S. Baldric called it\r\n\"Zantetsu Sword is On Fire!\" I bet this is because\r\nanyone who was unaware of the background behind\r\nGoemon's sword would be instantly puzzled at the early\r\nline, \"Give us your Zantetsuken.\" This could mean a\r\nlot of people seeing this as their first Lupin film\r\nwould have no clue about half the plot.\r\nOne of the unfortunate things about Lupin fandom is\r\nthat a lot of people don't actually say what Goemon's\r\nsword *is.* For those not in the know, and have taken\r\nthe time to read this far down (which is maybe 2\r\npeople at most), Goemon's \"Zantetsuken\" is a sword\r\nmade from the metals of a meteorite that can cut\r\nthrough steel, and therefore almost any substance\r\nknown to man. Now tell me that's not \"just plain\r\ncool.\"\r\n\r\nAlso, a big reason there are so many fansubs of\r\nCagliostro, despite a 9-year distribution period by\r\nStreamline Pictures, is because Carl Macek has said\r\nthat he did not mind fans distributing subtitled\r\nversions of Streamline products as long as no profits\r\nwere made from them. Since almost all Streamline\r\nPictures productions were dubbed (Robotech Perfect and\r\nAkira are exceptions), this only makes sense.\r\n\r\nHope I helped! :-)\r\n\r\n\r\n=====\r\n\"Arsene Lupin III\"\r\nwebmaster@lupinthethird.nospam.com\r\n(Remove \"nospam\" to reply)\r\nhttp:\/\/www.LupintheThird.com\r\n\r\n__________________________________________________\r\nDo You Yahoo!?\r\nGet personalized email addresses from Yahoo! Mail - only $35 \r\na year!  http:\/\/personal.mail.yahoo.com\/","message_date":"June 13 2001 12:25 AM"}