{"id":"177","author":"Robert Stickles","subject":"Re: More FAQ commentary.","body":"[snip]\r\n\r\nThanks for the input on the 'Mamo' name\r\n\r\n> > I would very much like to see this version of the\r\n> > film, and perhaps mate the\r\n> > audio track to a widescreen video source.\r\n>\r\n>This idea was used and once distributed at a con with\r\n>a low-quality audio source, a copy of which I have.\r\n>The reason I believed the old TMS dub was some sort of\r\n>pan-and-scan release is because the widescreen LD\r\n>picture siddenly disappears and the audio keeps\r\n>playing over a full-screen version of the film (in my\r\n>copy). I'd have to double-check, but I believe it may\r\n>have been widescreen to begin with (I now have footage\r\n>of the film's original English intro).\r\n>\r\nDo you have any idea at which scenes that it switches to P&S?  I've always \r\nhad the feeling that the english versions of the flim have footage cut.  The \r\ntrailer for the film shows scenes of what presumably is a Lupin clone coming \r\nout of a wooden building, and a scene of race cars colliding and exploding.  \r\nOf course, it's routine for film trailers to use footage that doesn't make \r\nthe final cut so maybe I'm barking up the wrong tree. ;-)\r\n-\r\n> > I was aware of both of the theatrical subs but was\r\n> > unsure if I should\r\n> > include them in this list, since technically they\r\n> > aren't available on\r\n> > 'video' (a loose term here, but I was originally\r\n> > only going to include home\r\n> > video).  Are theatrical prints of Cagilostro still\r\n> > making the rounds?\r\n>\r\n>Yes, Manga Video owns all of Streamline's old film\r\n>copies. They actually showed it at an LA theater on a\r\n>double bill with Princess Mononoke.\r\n>\r\n> > I should technically include the meagre translation\r\n> > they did for the\r\n> > Cliffhanger LD game (and include it under Lupin vs\r\n> > the Clone as well) but I\r\n> > haven't decided if this really counts as a 'real'\r\n> > translation\r\n>\r\n>No, it doesn't really, but you might want to mention\r\n>it for those who were unaware of Cliffhanger's\r\n>existence.\r\n-\r\nA friend of mine who works in the videogame industry was looking into \r\nliscencing Cliffhanger for play on Nuon-enhanced DVD players.  Unfortunately \r\nTaito in Japan and Stern Electronics in the USA have little records or \r\nmaterials that would help in reconstructing the game.  It doesn't help that \r\nthe North American rights to Cagliostro and Mamo are held by different \r\ncompanies either.\r\n-\r\n> >I have an S. Baldric sub of Caglisotro as well, which\r\n> >IMO is actually closer to the original than the Manga\r\n> >sub.  Neil toned down a lot of language (most\r\n> >notably 'kuso' is translated as 'damn' or 'blast it'\r\n> >in every instance) for the Manga script, and I prefer\r\n> >the phrase 'drink a lake' compared to Manga's 'drain\r\n> >a lake of its water' when Lupin is trying to impress\r\n> >Clarisse (and is a coy forshadowing of the ending).\r\n>\r\n>Ah, but do you think Neil would do that for no reason\r\n>whatsoever? He did that because he knew Cagliostro is\r\n>a perfect family film: lots of action, romance,\r\n>comedy, and minimal violence (heck, there's only a\r\n>pint of blood in the whole film!). So when he\r\n>translated it, he wrote it as he would have liked the\r\n>dub to sound, an ideal script for young and old alike.\r\n>Then Manga got a hold of it.\r\n>Rewrites, small rewrites... make Jigen cuss 5\r\n>times.... oh let's rewrite that a little...Jigen\r\n>cusses 10 times more.....you get the idea.\r\n>Do you see why I am not so fond of the Manga dub?\r\n>A *true* sign that Manga video really is pure evil.\r\n-\r\nHeh.  Whats more amusing is that both Lupin and Zenegata curse more than \r\nJigen in the original. Goeman's voice is what does it for me, possibly worst \r\nvoice casting I've heard in some time.\r\n-\r\n     The Streamline dub has always been lambasted for 'dumbing down' the \r\noriginal script.  Apart from a few clever things dropped (mostly the \r\nforeshadowing of the ending, and the connection of goat money to the goat \r\narchetecture and capran language [goat in latin]) I think it holds up quite \r\nwell in retrospect compared to Manga's effort.\r\n-\r\n>Also, I believe Neil's script did refer to guzzling\r\n>the lake, but perhaps it was simply draining it.\r\n>Either way, the coy foreshadowing remains. The way it\r\n>was phrased in the sub DOES make it sound like he's\r\n>trying for more stilted, Biblical dialogue, to show\r\n>off to Clarisse.\r\n>The Manga English DUB actually reinstates the\r\n>\"lake-drinking\" concept, assuming that it wasn't in\r\n>the subs to begin with.\r\n-\r\ndarn, I'm going to have to watch the dubs and subs Cagliostro again.  Poor \r\nme :-)\r\n-\r\n> >If these S. Baldric subs are bootlegs, who are they\r\n> >stolen from?\r\n>\r\n>You misunderstand. They are simply fansubs that are\r\n>translated, timed, mastered, and distributed with\r\n>profits in mind (i.e., they charge a hefty sum--like\r\n>$12 for a crappy VCD). Nothing more.\r\n-\r\nahhh.  I've seen these sold under the guise of 'Professional fansubs' (an \r\noxymoron, I know).\r\n-\r\n> >Ick, thats ludicrous to pay for VCD's which have been\r\n> >sourced from second generation VHS copies in the\r\n> >first place.\r\n>\r\n>I purchased the first OAV of Street Fighter Zero\r\n>fansubbed on VCD. It was a VERY blocky transfer, but\r\n>it was an hour of Street Fighter before the Manga\r\n>version was out. When I got the SF Alpha (OAV 1+2) DVD\r\n>and saw the very clear picture, I oohed and awed, but\r\n>got bothered just a bit because it *didn't* have\r\n>picture breakup like the VCD did.\r\n\r\nWhy did that bother you?  I've always thought that the worst thing you could \r\nput on VCD is video with fine lines and fast movement, something that anime \r\nhas quite a bit of.  For a while they thought DVD would make animation look \r\nworse based on the results with VCD but that appears to not be the case.  I \r\nguess it all depends on the quality of the source material, the encoding \r\n(including the repeated viewings to look for errors), and player\/TV setup as \r\nwell.  Too many variables.\r\n-\r\n> >SVCD and Mini DVD (Mpeg-2 DVD data recorded onto\r\n> >regular CD-R media) are a different story, and the\r\n> >fansub community may find a medium where it's easier\r\n> >for them to produce and distribute to fans.  The\r\n> >ablility to have the subtitles separate from the\r\n> >video source helps a lot too.  The danger of course\r\n> >is that the lack of generational loss lowers the\r\n> >incentive for fans to buy legit DVD releases (or if\r\n> >you look at the other side of the coin, it forces\r\n> >companies to add extras to the DVD's)\r\n>\r\n>Well we can only wait for the verdict of the fans on\r\n>this one. For now, we just need more subbers to start\r\n>catching up to current technology so they can use DVDs\r\n>as sources.\r\n-\r\nI guess thats already happening.  Fujiko's Unlucky Days is the first Lupin \r\nIII to not have an LD release.  The rest of the Lupin III specials have been \r\nput onto DVD in a relatively short period of time.  More Region 2 DVD's are \r\nbeing made with english subtitles as well.\r\n-\r\n>One of the unfortunate things about Lupin fandom is\r\n>that a lot of people don't actually say what Goemon's\r\n>sword *is.* For those not in the know, and have taken\r\n>the time to read this far down (which is maybe 2\r\n>people at most), Goemon's \"Zantetsuken\" is a sword\r\n>made from the metals of a meteorite that can cut\r\n>through steel, and therefore almost any substance\r\n>known to man. Now tell me that's not \"just plain\r\n>cool.\"\r\n>\r\nIs the meteorite explanation canonical? A few months ago I compiled a \r\nhistory of the sword and only encounted the metorite story in Luis' FAQ.  \r\nThe sword history is very convoluted, and the Zantesuken special only makes \r\nthings worse.\r\n-\r\nThe original storyline doesn't treat the sword as mystical or unique, just \r\nthat it's super-hard from a secrect process -- it's Goeman's skill and \r\nmental discipline as a swordsman that allows him to do those fantastic \r\nfeats, including cutting wind and clouds.  Sort of a 'right weapon in the \r\nhands of the right person' concept.  In fact, both times that the sword has \r\nbroken (Lupin vs the Clone, and Twilight Gemini) Goeman blames it on a \r\nweakness in himself.  A first series story has a villian replicating the \r\nzantesuken thinking that the super-hard sword can make up for his weaknesses \r\nas a swordsman (and by extension his weakness as a person).  It's also \r\nsignificant that Lupin defeats Mamo in Lupin vs the Clone by *not* using the \r\ncutting properties of the blade, echoing the disorder of Lupin's mind we see \r\nearlier in the flim when he's hooked up to the mind-reading machine.\r\n-\r\n>Also, a big reason there are so many fansubs of\r\n>Cagliostro, despite a 9-year distribution period by\r\n>Streamline Pictures, is because Carl Macek has said\r\n>that he did not mind fans distributing subtitled\r\n>versions of Streamline products as long as no profits\r\n>were made from them. Since almost all Streamline\r\n>Pictures productions were dubbed (Robotech Perfect and\r\n>Akira are exceptions), this only makes sense.\r\n-\r\nI didn't know that Carl had so graciously allowed fansubbers to do that.  \r\nIt's too bad that Streamline had just released Mystery of Mamo when they \r\nwere swallowed up by Orion, we might have seen a fansub or two.\r\n-\r\n>Hope I helped! :-)\r\n-\r\nYes, I'm going to have to make some major revisions to the FAQ this weekend \r\n:-)\r\n\r\nRegards,\r\nRob S.\r\n_________________________________________________________________________\r\nGet Your Private, Free E-mail from MSN Hotmail at http:\/\/www.hotmail.com.\r\n","message_date":"June 13 2001 2:15 PM"}