{"id":"187","author":"Robert Stickles","subject":"Some background info on Twiligh Gemini","body":"     With Funi set to release _Secret  ofTwilight Gemini_ soon I decided to \r\nrevisit a topic which has stuck in my mind ever since I first saw the \r\nspecial in 1997.\r\n\r\n  If you haven't seen _Gemini_ yet, you might want to avoid this since i do \r\ngive a few snippets of the plot.\r\n\r\n\r\n<Spoilers Ahoy!>\r\n\r\n     What I had been was puzzled about was the identity of Dorunne (also \r\nspelled Dorume in at least one other translation), the elderly infirm man \r\nwho gives him half of the diamond key.  He's says to lupin, \"I was a lot \r\nlike you when I was younger\" and calls him \"Baby\" a number of times.  Fujiko \r\ncomes across a painting of a young Dorunne in a shop and wonders why a \r\npainting of Lupin would be there.  Dorunne's story (told as a silent movie \r\nflashback) is somewhat based on the real life story of Larwence of Arabia \r\n(Blue eyed foreigner is instrumental in uniting warring desert tribes to \r\nform a unified country).  They also mention that Dorunne was French, and \r\nmysteriously appeared out of nowhere in the middle of a sandstorm at the \r\ntime of the Geruto tribe's greatest need.  Dorunne in the flashbacks and the \r\npainting looks exactly like Lupin, with a moustache.  The technology \r\ndepicted in the battle is circa World War I.\r\n\r\n     Essentially, the story drops some heavy hints that Dorunne is Arsene \r\nLupin the first (Lupin's grandfather) only to negate it (or at least make it \r\nambiguous) at the end when Dorunne stops calling Lupin \"Baby\" and calls him \r\njust \"Lupin\".  I was kind of puzzled by this and just assumed the story \r\nauthors were giving us a red herring to scratch our heads with.\r\n\r\n    I did a little more digging to see if there was anything in the original \r\nLupin stories written by Maurice Leblanc about adventures in the  Moroccan \r\ndesert.  As it turns out, there is a gap in the chronology of the original \r\nLupin stories after Leblanc's pseudo-scifi novel _813_, which takes place in \r\n1914 and _L'ile aux Trente Cercueils_ (The Island of Thirty Coffins) which \r\ndates to around 1918.  During this period Arsene Lupin supposedly joined the \r\nFrench Foreign Legion,  had numerous unrecorded adventures in the Sahara and \r\nMorocco, and participated in the pacification of French Sahara during WWI.  \r\nHe did return to Frence in this peroid at least once in the novel _le \r\nTriangle d'Or_ (The Golden Triangle).\r\n\r\n     Arsene Lupin the 1st used many fake names and aliases (in fact there a \r\npage on the web listing about 100 of them).  In all three of the above \r\nmentioned Maurice Leblanc novels, Lupin uses the alias Don Louis Perenna \r\n(Louis Perenna is an anagram of Arsene Lupin).  If you write 'Don Louis' in \r\njapanese kana you get: 'Do n  Ru i-'  (Don Ruii) which is phonetically close \r\nto 'Dorunne', or as it's pronounced in the story 'dough-roon'.\r\n\r\n     As far as I know this is the only Lupin III story to address the fact \r\nthat Lupin may have more relatives running around than he's aware of (Lala \r\nis identified as Dorunne's grandaughter).  Arsene Lupin I was married and \r\ndivorced at least 4 times, and probably had a few kids out of wedlock as \r\nwell.  One other Lupin III special identifies which of Aresene Lupin's wives \r\nis Lupin III's grandmother (see if you can guess which one :-)\r\n\r\n     Anyway, maybe Reed can pass on to Funimation that the subtitles for \r\nDorunne's name should be written as Don Louis\r\n\r\nRegards,\r\nRob S..\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n_________________________________________________________________\r\nSend and receive Hotmail on your mobile device: http:\/\/mobile.msn.com","message_date":"February 28 2002 2:07 AM"}