{"id":"188","author":"Kathleen Rose Moon","subject":"Re: Some background info on Twiligh Gemini","body":"\r\n>I did a little more digging to see if there was anything in the original Lupin stories written by Maurice Leblanc about adventures in the  Moroccan desert.  As it turns out, there is a gap in the chronology of the original Lupin stories after Leblanc's pseudo-scifi novel _813_, which takes place in 1914 and _L'ile aux Trente Cercueils_ (The Island of Thirty Coffins) which dates to around 1918.  During this period Arsene Lupin supposedly joined the French Foreign Legion,  had numerous unrecorded adventures in the Sahara and Morocco, and participated in the pacification of French Sahara during WWI.\r\n\r\nThe novel you're looking for is \"The Teeth of the Tiger\" (English\r\ntranslation published 1914.) It comes immediately after \"813\" and in\r\nfact contains blatant spoilers for \"813\". There is a section near the\r\nend of the book detailing Lupin's adventures in North Africa. (Keep in\r\nmind that these stories take place during the period when France was\r\ncolonizing Africa.) \"L'ile aux Trente Cercueils\" has been printed in\r\nEnglish as \"The Secret of Sarek\" and contains very little of Lupin. He\r\nappears only near the end, having retired and devoted himself to\r\noccasional acts of selfless heroism (and growing lupines). If you want\r\nreal LeBlanc pseudo-scifi, try, or rather don't, \"Les Trois Yeux\" (The\r\nThree Eyes). Something about alien transmissions from Venus.\r\n\r\n>As far as I know this is the only Lupin III story to address the fact that Lupin may have more relatives running around than he's aware of (Lala is identified as Dorunne's grandaughter).  Arsene Lupin I was married and divorced at least 4 times, and probably had a few kids out of wedlock as well.  One other Lupin III special identifies which of Aresene Lupin's wives is Lupin III's grandmother (see if you can guess which one \r\n\r\nThat would be Napoleon's Dictionary. By the way, I believe that it's\r\n\"813\" again in which Lupin I admits that the character Gwendolyn is in\r\nfact his daughter.\r\n","message_date":"February 28 2002 9:54 AM"}