{"id":"194","author":"Luis Cruz","subject":"DVD regions","body":"> profits, the licensing and distribution of media is a commercial enterprise.\r\n> It's not fair to expect people's kids to go hungry so you can watch free\r\n> movies.\r\n\r\nThis is not about watching free movies or eliminating profits; DVD regions\r\nare about the movie studios attempting to control markets, limiting a \r\nconsumer's choice, and potentially gouging markets.\r\n\r\nFor example, a title is going to be released in the US and Japan.  The studio\r\ndecides that the US version will be released in Jan. for $20; the Japanese\r\nversion will be released in May for $40.  If DVD region coding was enforced\r\n(i.e., no region-free players, etc.), the Japanese consumer would have no\r\nchoice but to pay twice as much for the title.\r\n\r\nNow, what if the US version had a commentary track and the Japanese version\r\ndid not?  Again, the Japanese consumer would have no choice but to chose\r\nthe version that is not only twice as expensive but half as good.\r\n\r\n> bootlegging (I know no-one even mentioned bootlegging, but it's relevant)\r\n\r\nBootlegging is not relevant to a discussion about DVD region coding.  DVD\r\nregion coding does not even come close to addressing bootlegging.  A bootleg\r\ncan be made onto an inferior medium regardless of region coding.  Bootlegging\r\nwould be relevant to a discussion of the encryption used on DVDs as well\r\nas Macrovision (and similar content protection schemes).\r\n\r\nI do not recall the post previous to yours, so I am basing the above on the\r\nfact that you quoted only a piece about region coding.  If the previous\r\npost went on about encryption\/copy protection, then I am in error.\r\n\r\n> Lupin^_^) but with stuff that does get distributed here, if you don't buy\r\n> that release, that's a vote against licensing anime in North America.  If\r\n> no-one makes any money on it, they can't do it.\r\n\r\nIf a similar product exists in a different region\/country, why should I not\r\nhave the choice to vote with my dollar for the product which I feel is \r\nsuperior?  If a US company brings over an anime title and does a poor job\r\nin mastering it to DVD, why should I vote for them with my dollar?  They will\r\nhave no incentive to produce better quality DVDs.  \r\n\r\nI would rather have the choice to vote with my dollar for the version that\r\nI feel is better.  In essence, I am telling the US company \"You want my dollar?\r\nProduce a DVD of the same quality as the version from X.\"  DVD region coding\r\nwas put in place to prevent this.  If I want to import a legitimate copy of a \r\nDVD from another company, I should be free to do that.\r\n\r\nOne last example.  Let's say a native Frenchman moves to the US to work.  Sony\r\ndecides to release a title in the US without a French language track; Sony\r\nalso releases the same title in France with a French language track.  Why\r\nshould the Frenchman not be able to choose to import the version from France?\r\n\r\nNot region coded related, but here is a solid, recent example of a movie\r\nstudio trying to price gouge a market:\r\nhttp:\/\/www.smh.com.au\/news\/0201\/26\/national\/national25.html\r\n\r\n-- \r\nLuis A. Cruz\r\ncruzl@ccs.neu.edu\r\nLupin III Encyclopedia:  http:\/\/www.lupinencyclopedia.com\/\r\nAnime Video Game Resource Center:  http:\/\/www.lupinencyclopedia.com\/avrc\/\r\n","message_date":"January 30 2002 1:53 PM"}