{"id":"196","author":"Robert Stickles","subject":"Re: DVD regions","body":"\r\n\r\n\r\n>From: \"Daniele Rossi\" <birbao@sunnysidedown.com>\r\n>Reply-To: lupin@mcs.kent.edu\r\n>To: <lupin@mcs.kent.edu>\r\n>Subject: Re: [lupin] DVD regions\r\n>Date: Wed, 30 Jan 2002 19:21:39 -0500\r\n>\r\n> >If I want to import a legitimate copy of a\r\n> > DVD from another company, I should be free to do that.\r\n> >\r\n>that is a very good point.\r\n\r\nYup, it is.  The video game industry has been locking out other territoies \r\nfor years, by both physical and electronic means.  The DVD industry took a \r\ncue from them.  At one point Sony was attempting to make it illegal for \r\nanyone to modify a piece of consumer electronic equipment (for any reason, \r\nnot just to defeat copy protection or a region lockout) other than an \r\nauthorized dealer.  Scary stuff.\r\n\r\n\r\n\r\n>The player I have, if anyone wants\r\n>to know, is Panasonic DV31 (or something like that. oops!).\r\n>\r\n>I wish we didn't have the stupid codes because I thought DVDs would rid of\r\n>the pal and ntsc incompatibilities.  So now it's that AND a code.\r\n\r\n     The real irony with Region coding is that they were too cheap to make \r\nmore than 9 regions (10 if you count region '0').  The region codes are \r\nsplit between countries that have different TV standards.  For example: \r\nBrazil and Australia are both region 4, but Oz uses a slightly different \r\nform of PAL than the UK and Brazil uses PAL-M, which is closer to NTSC (and \r\nin fact, Region 4 disks sold in Brazil are NTSC versions).\r\n  Whats amusing is that The UK and Japan are both region 2.  The UK has very \r\nstrict import laws when it comes to DVD's (some of it is due to different \r\ncensorship ratings): It's illegal to sell non region-2 PAL DVD's in stores \r\nand ordering overseas for a Region 1 DVD could get it confiscated by the \r\npostal authorities.  The region codes were set up in part to avoid the legal \r\nhassle of someone purchaasing a DVD with objectionable content from another \r\nregion  (which might not be *as* objectionable in another country).  The \r\ntwist is that almost all modern PAL DVD players can convert NTSC to PAL on \r\nthe fly, so it's quite easy for someone in the UK to watch some tentacle \r\nrape hentai without any technical hitches whatsoever.\r\n\r\n     A good number of Chinese-made cheap DVD players have flooded the market \r\nin the past 2 years.  Almost all of them can covert PAL to NTSC (and vice \r\nversa) on the fly (needed because China uses both TV standards), be set to \r\nRegion 0 (region bypass) and some even defeat Region Code Enhancement (RCE, \r\nI can explain this if you're unsure as to what it is).  Regions really \r\n*aren't* an issue if you know what player to buy.  Research before you \r\npurcase!\r\n\r\nRegards,\r\nRob S.\r\n\r\n\r\n\r\n\r\n\r\n\r\n_________________________________________________________________\r\nMSN Photos is the easiest way to share and print your photos: \r\nhttp:\/\/photos.msn.com\/support\/worldwide.aspx\r\n","message_date":"January 31 2002 4:26 AM"}