{"id":"199","author":"Bruce Osborne","subject":"Re: Goodbye, Farewell, and Amen.","body":"Speaking that at the current moment thesoyokaze.net is down...dunno what \r\nyou'd do. Maybe you can give me access to your files, and when it comes \r\nback up (hopefully tonight or tomorrow) i can transfer everything with a \r\nnote of what will be going on.\r\n\r\nAt 04:20 PM 2\/21\/2001 -0800, you wrote:\r\n>This is my final post to the Lupin the Third ML for\r\n>the next 2+ years.\r\n>I thank you for all your support over the past year or\r\n>so as I've worked on my website and so on.\r\n>\r\n>Some final words:\r\n>\r\n>Bruce: I appreciate the offer to back-up my website!\r\n>Please tell me exactly what URL you plan to put the\r\n>site on and I'll redirect before I'm gone for good (so\r\n>write me REAL SOON, like, within hours if you can). If\r\n>you wanna toy with some of the site's features, feel\r\n>free (I'm aware of te problem with the Manga index,\r\n>but there's nothing I can really do about it now...if\r\n>you wanna throw together a replacement, that would be\r\n>great!) Keep up the good work.\r\n>\r\n>Luis: Good form. You and Bruce have done a fine job\r\n>designing the Encyclopedia. You deserved that AniPike\r\n>award! I hope the Yahoo Lupin III Club picks up again\r\n>soon. Feel free to make any changes you feel\r\n>necessary, as well as kick off any annoying pests that\r\n>join...lol. Have a great life, I'll see you again in a\r\n>few, I hope.\r\n>\r\n>Erik and Gary, My apologies for being unable to\r\n>complete the Lupin '99 script. Continue the good work,\r\n>and I hope to see some more of \"The New Lupin III\" TV\r\n>when I return! Good luck on future TV special\r\n>projects, too!\r\n>\r\n>The rest of the list: I hope my presence hasn't been a\r\n>bother to any of you, but if it has, too bad!\r\n>Hah-hah.... Hope you all have a good time watching\r\n>Lupin to your heart's content.\r\n>\r\n>The closing moments of the greatest anime film ever\r\n>made:\r\n>\r\n>Lupin: Sayounara, sayounara!\r\n>Clarisse: Sayounara!\r\n>Zenigata: Blast it! He has stolen again!\r\n>Clarisse: You're mistaken, he has stolen nothing!\r\n>Zenigata: On the contrary! He stole something valuable\r\n>and priceless...your heart.\r\n>Clarisse: Hai.\r\n>\r\n>Sayounara, minna-san...sayounara.\r\n>\r\n>\r\n>\r\n>=====\r\n>\"Arsene Lupin III\"\r\n>webmaster@lupinthethird.nospam.com\r\n>(Remove \"nospam\" to reply)\r\n>http:\/\/www.LupintheThird.com\r\n>\r\n>__________________________________________________\r\n>Do You Yahoo!?\r\n>Yahoo! Auctions - Buy the things you want at great prices! \r\n>http:\/\/auctions.yahoo.com\/\r\n\r\n------------------------------------------------------\r\nBruce Osborne\r\nsaitoh-hajime@neo.rr.com\r\nICQ : 96064290\r\nTheSoyokaze: www.thesoyokaze.net\r\nBlue Sky Complex: www.thesoyokaze.net\/bluesky\r\nLEMONed Shrine: www.thesoyokaze.net\/lemoned\r\nLupin Encyclopedia: www.thesoyokaze.net\/lupinthe3rd\r\nLupin III Petition: www.thesoyokaze.net\/lupinpetition\/petition.html\r\n","message_date":"February 21 2001 8:50 PM"}