{"id":"2","author":"Luis A. Cruz","subject":"Got my Lupin 3rd PSX game!","body":"-----BEGIN PGP SIGNED MESSAGE-----\r\nHash: SHA1\r\n\r\nThought I would try to generate a little traffic with\r\na review of my recent acquisition... _Lupin 3rd:  Chateau\r\nde Cagliostro_ for the Sony Playstation.\r\n\r\nThis is a three disc set; each CD has a picture on its label\r\nside:  one of Lupin, one of Clarisse, and one of the rest of\r\nthe normal Lupin cast.  The manual contains a brief pictorial\r\nreview of the movie itself before going into the game details.\r\n\r\nThe premise of the game sets you up as a tourist wandering\r\naround Cagliostro learning about the exploits of Lupin.  You\r\nhave to solve \"puzzles\"; mostly it is a matter of finding an\r\nitem and then figuring out who to give it to next.  The background\r\ngraphics are rich and remind me a bit of Myst (though not quite as\r\nsharp and polished).  The characters are drawn exactly as they were\r\nor would be in the movie.  The game control is very simple and\r\nsupports\r\nthe PSX mouse.  One button selects items or interacts with people and\r\nthe environment; the other backs out of menus.\r\n\r\nBasically, this game serves as an interactive memorial album for the\r\nmovie.  All the dialog and text is in Japanese though it hasn't slowed\r\nme down yet; most of the \"puzzles\" can be solved with a little\r\npatience.\r\nNot sure how it manages to span 3 discs worth of play yet, but I hope\r\nto\r\nfind out.\r\n\r\nSo, anyone else out there have an interesting piece of Lupin\r\nmerchandise\r\nthey would like to describe and make us drool over? :)  A lot of neat\r\nstuff has been up for grabs lately on www.ebay.com.  The only Lupin\r\nposter I have ever seen went very quickly; anyone know where to pick\r\nup a decent Lupin poster or wall scroll?\r\n\r\n- ---\r\nLuis A. Cruz\r\ncruzl@ccs.neu.edu\r\nhttp:\/\/www.ccs.neu.edu\/home\/cruzl\/\r\nAnime Video Game Resource Center: \r\nhttp:\/\/www.ccs.neu.edu\/home\/cruzl\/avrc\/\r\n-----BEGIN PGP SIGNATURE-----\r\nVersion: PGPfreeware 6.0 for non-commercial use <http:\/\/www.pgp.com>\r\n\r\niQA\/AwUBNx\/3FLhns7ex7ljSEQJ\/FQCguXXlqEiIhg9BRY7qJhDOPqW73IIAoMm5\r\n3hX6Dw5IddjP2PtrEXnrFrjH\r\n=3ixr\r\n-----END PGP SIGNATURE-----","message_date":"April 22 1999 11:29 PM"}