{"id":"205","author":"Robert Stickles","subject":"Re: \"Lupin in English FAQ\" commentary.","body":">From: Arsene Lupin III <talesofthewolf@yahoo.com>\r\n>Reply-To: lupin AT mcs DOT kent DOT edu\r\n>To: lupin AT mcs DOT kent DOT edu\r\n>Subject: [lupin] \"Lupin in English FAQ\" commentary.\r\n>Date: Tue, 12 Jun 2001 11:10:55 -0700 (PDT)\r\n>\r\n>\r\n> > 1978 Mystery of Mamo\/Secret of  Mamo\/Lupin vs the\r\n> > Clone\/Lupin vs Kuron\/Lupin vs the Immortal Man\r\n> > (Lupin nei Fukusei Ningen\/Mamoo no Ichihen )\r\n> > - originally titled \"Lupin III\" when released in\r\n> > Japan, the later titles were added to avoid\r\n> > confusion with subsequent films.\r\n>\r\n>Pretty much accurate here, but there's only one person\r\n>who I know that calls it \"Lupin vs. Kuron,\" and that's\r\n>Valerie, a former list regular. A Neko fansub of\r\n>\"Secret Files\" called it \"Lupin vs. Kuron,\" without\r\n>relaizing \"Kuron\" was katakana for the English word\r\n>\"Clone.\" I have seen Japanese web pages call the film\r\n>\"Lupin tei Fukusei-Ningen <Kuron>,\" or in English:\r\n>\"Lupin vs. The Immortal Men <Clones>.\"\r\n>So the film, in Japan, has 2 titles:\r\n>\"Lupin vs. The Immortal Men\/Lupin vs. The Clones\"\r\n>or\r\n>\"Lupin the Third.\"\r\n>In English, 2 titles:\r\n>(UK Dub): \"The Secret of Mamo\"\r\n>(US Dub): \"The Mystery of Mamo\"\r\n\r\nThe listing of the known titles was done to illustrate just how many names \r\nthis film has and not really intended to comment on the accuracy of the \r\ntranslations.   Perhaps I should rearrange this...\r\n\r\n>I have no idea where the title \"Mamo's First Copy\"\r\n>(Mamoh no Ichihen\" came into play. I would go ahead\r\n>and leave it in though, just for the 'halibut.'\r\n\r\n:-)  The  'Mamo' name was coined by a Streamline employee, if I remember the \r\ninterviews I have read.  I haven't seen a raw Japanese version of the film \r\n(yet) so I'm not sure if the name 'Mamoo' is actually used.\r\n\r\nThere's two explanations as to how the name Mamo became associated with the \r\nJapanese version of the film: The release of the Toho LD with the dual \r\nlanguage script book (based on the Streamline dub) uses the title 'Mystery \r\nof Mamo' in english on the LD cover. The second explanation is that the name \r\n'Mamoo' crops up as a villian name in either the First or Second TV series \r\n(ill have to check my synposes)\r\n\r\n> > SUB Any *english* fansubbed versions of this exist?\r\n> > (I know of a Finnish sub)\r\n> > INP Lupin Gang Anime (on hold)\r\n>\r\n>I think all the fansubbers just decided to wait it out\r\n>and see if anyone besides Streamline would touch it.\r\n>Or they simply couldn't get a steady translator to do\r\n>it (LGA falls into that category). If you want an\r\n>accurate translation of the film, I would suggest\r\n>viewing the TMS dub from a few years back, and ignore\r\n>the weird name changes.\r\n\r\nI would very much like to see this version of the film, and perhaps mate the \r\naudio track to a widescreen video source.\r\n\r\n> > 1979 The Castle of Cagliostro (Cariosutoro no shiro)\r\n> > SUB\/DUB Manga Ent. VHS\/DVD (Region 1), sub script by\r\n> > Neil Nadelman\r\n> > SUB\/DUB Buena Vista Home Ent. DVD (Region 2), uses\r\n> > Streamline dub and Carl Macek's english script for\r\n> > subtitles (dubtitle)\r\n> > DUB Streamline Ent. VHS (OOP), Toho dual language LD\r\n> > (OOP)\r\n> > SUB many fansubs exist from public scripts, most are\r\n> > now redundant to the commercial Manga sub.\r\n>\r\n>Ah, but there were 2 *theatrical* English subs of\r\n>Cagliostro. One was released in limited quantity by\r\n>Streamline Pictures in 1991. It was very accurate,\r\n>besides Lupin being called \"Wolf.\"\r\n>There was also another one made years before\r\n>(presumably by TMS Japan), using an original sub\r\n>script. The names were changed (except Lupin's, I\r\n>would guess) much like they were for the TMS dub of\r\n>Mamo... e.x.: \"Detective Scott\" instead of \"Inspector\r\n>Zenigata.\" The Streamline theatrical sub was likely\r\n>based on the translation used in this release.\r\n\r\nI was aware of both of the theatrical subs but was unsure if I should  \r\ninclude them in this list, since technically they aren't available on \r\n'video' (a loose term here, but I was originally only going to include home \r\nvideo).  Are theatrical prints of Cagilostro still making the rounds?\r\n\r\nI should technically include the meagre translation they did for the \r\nCliffhanger LD game (and include it under Lupin vs the Clone as well) but I \r\nhaven't decided if this really counts as a 'real' translation (much like the \r\nshort chase sequence from Cagliostro at the start of The Secret File)\r\n\r\n> > 1982 Lupin VIII\/Arsene and Company\/Arsene et cie\r\n> > - pilot film of a series (Japan and France\r\n> > coproduction, and possibly DIC in Canada?) aborted\r\n> > due to copyright issues between Leblanc estate and\r\n> > TMS.\r\n> > INP ??? Pilot exists without vocal track which may\r\n> > have never been recorded.\r\n>\r\n>Yeah I read an interview that said a bit about Lupin\r\n>the Eighth (thanks Ryu!). It was a French\r\n>Co-production with Japan (it's been done before), and\r\n>DiC had a hand in it too. I think DiC was more\r\n>directly connected to the French end of the deal than\r\n>Japan.\r\n\r\nLooks as if this would have been the only Lupin III to be written in  French \r\nfirst and later translated to Japanese and English.  The recent Arsene \r\nLupin\/Nighthood animated series is a France-Canada coproduction but is \r\ndefinitely written in French first.\r\n\r\n>On a side note, there were actually 6 episodes\r\n>completed before they cancelled the series due to the\r\n>LeBlanc name (it was no going to be public domain\r\n>until 1991 and the \"Lupin VIII\" series was being made\r\n>in 1980-1981), but only the premiere is floating\r\n>around....\r\n\r\nThe lack of vocal track on the pilot leads me to believe that the project \r\nwas axed before it was farmed out to the respective North American and \r\nJapanese companies to record the voice tracks.  If the scripts existed only \r\nin French then it's no wonder that the Japanese people involved have no idea \r\nwhere the Japanese translation is.\r\n> >\r\n> > 1985 Legend of Gold Babylon\/Golden Legend of Babylon\r\n> > (Babiron no Ogon Densetzu)\r\n> > SUB AnimEigo VHS\/LD as \"Rupan III\"\r\n>\r\n>The way it's written, it should be \"Golden Legend of\r\n>Babylon\" or even simply \"Gold Legend of Babylon.\"\r\n>AnimEigo rearranged the words and added an \"of,\" and\r\n>in doing so, altered its literal meaning a tiny bit:\r\n>\"Legend of the Gold of Babylon.\"\r\n\r\nOk... I'll list the proper name first, but I will include AnimEigo's name as \r\nwell...\r\n\r\n> > 1987 The Fuma Conspiracy\/Plot of the Fuma Clan\r\n> > (Fuuma Ichizoku no Imboo)\r\n> > SUB\/DUB AnimEigo VHS\/LD as \"Rupan III\"\r\n> > SUB ???\r\n>\r\n>The AnimEigo LD was not available dubbed. So I would\r\n>write it:\r\n>SUB\/DUB AnimEigo VHS as \"Rupan III\"\r\n>SUB Animeigo LD as \"Rupan III\"\r\n\r\nThanks for the info!\r\n\r\n>There were fansubs of this made, but I don't know any\r\n>subber names. It was the source of the English title\r\n>\"Plot of the Fuma Clan,\" a more accurate translation\r\n>than \"The Fuma Conspiracy,\" though I admit\r\n>\"conspiracy\" is a pretty cool word. You can find a\r\n>subtitle script for it online.\r\n>\r\n> > 1989 Goodbye Lady Liberty\/Bye Bye Liberty Crisis -\r\n> > Begin Emergency! (Bai Bai Ribatii - Kiki Ippatsu!)\r\n> > DUB Manga Ent UK VHS (PAL TV format only)\r\n> > SUB Studio Banzai\r\n> > SUB Nippon Golden Network (Hawaiian TV\/KHML)\/J.N.\r\n> > Productions\r\n>\r\n>It's either \"Bye Bye Liberty-Begin Emergency!\" or \"Bye\r\n>Bye Liberty Crisis.\" Not a combination of the 2. ;-)\r\n\r\nThanks for the leg up on this one.  I haven't seen Studio Banzai's nor NGN's \r\n  version of this yet, so I'm curious as to wether some of the revelations \r\nmade in the UK Manga dub are there in the original, most notably that Goeman \r\nis the kids father (!!).  I'm not sure what the deal is with the poor \r\nquality copies of the NGN version.  I assume they all come from an off-air \r\ncopy.\r\n\r\n> > 1994 Mighty Sword that Cuts Steel\/Zentesu Sword is\r\n> > on Fire (Moeyo Zantetsuken)\r\n> > SUB Odyssey Anime (v1)\r\n> > SUB S. Baldric productions (bootleg?)\r\n>\r\n>The reason I called them bootleggers on my site is\r\n>because Fansubs.net called them bootleggers. I can't\r\n>say personally because I never dealt directly with\r\n>them.\r\n\r\nI have an S. Baldric sub of Caglisotro as well, which IMO is actually closer \r\nto the original than the Manga sub.  Neil toned down a lot of language (most \r\nnotably 'kuso' is translated as 'damn' or 'blast it' in every instance) for \r\nthe Manga script, and I prefer the phrase 'drink a lake' compared to Manga's \r\n'drain a lake of its water' when Lupin is trying to impress Clarisse (and is \r\na coy forshadowing of the ending).\r\n\r\nIf these S. Baldric subs are bootlegs, who are they stolen from?  I know \r\nthat Lupin Gang Anime, Studio ESPer (and Arctic Anime?)  have subtitled \r\nCaglisotro;  LGA and ESPer have kept their versions from being released (for \r\nobvious reasons)...\r\n\r\n> > 1995 Pursuit of Harimao's Treasure (Harimao no Hiho\r\n> > wo Oe)\r\n> > SUB Odyssey Anime (v4)\r\n> > INP Lupin Gang Anime - timing\r\n>\r\n>It's \"Harimao no Zaiho wo Oe!\" And it literally means,\r\n>\"After Harimao's Treasure!\" But I like the way most\r\n>people write it, \"Pursuit of.\" A commercial release\r\n>would probably change it a more literal translation\r\n>(though AnimEigo, a commercial company,  seems to like\r\n>toying with titles just a little).\r\n>\r\n> > 1996 Dead or Alive (Deedo oa Araibu)\r\n> > SUB Lupin Gang Anime\r\n> > INP Odyssey Anime\r\n>\r\n>The title screen of this film is actually written in\r\n>English, and so are all the video covers. I've only\r\n>seen it written as \"Deedo oa Araibu\" on the covers of\r\n>the Japanese film-to-manga adaptations, so I mentioned\r\n>it on my site anyway.\r\n\r\nCool.  Since my Japanese is still very rudimentary at this point I'm at the \r\nmercy of whoever translated the titles in the first place, and in some cases \r\nthe titles are a combination of two different translations.\r\n\r\n> > 1996 Legend of Twlight Gemini\/Secret of Twilight\r\n> > Gemini (Towairaito Jemini no Himitsu)\r\n> > SUB Odyssey Anime (v2)\r\n> > SUB Lupin Gang Anime\r\n> > SUB Neko Creations (defunct)\r\n> > - Neko's sub scripts are publically available\r\n>\r\n>\"Legend of Twilight Gemini\" is the official English\r\n>title, but a translation of the Japanese name would\r\n>make it \"Secret of Twilight Gemini.\"\r\n>\r\n> > 1997 In Memory of Walther P-38\/Island of Assassins\r\n> > (Warusaa P-38)\r\n> > SUB Lupin Gang Anime\r\n> > INP Odyssey Anime\r\n>\r\n>\"Island of Assassins\" was NTV's English distro name\r\n>for the film. It's also called \"I.o.A.\" in Spanish\r\n>versions. Much like they call \"Kutabare! Nostradamus,\"\r\n>\"Farewell to Nostradamus,\" they don't take huge effort\r\n>in keeping the titles true to their source names.\r\n>\r\n> > 1998 Memories of Blaze - Tokyo Crisis (Honoo no\r\n> > Kioku - Tokyo Crisis)\r\n> > SUB Lupin Gang Anime\r\n> > INP Odyssey Anime\r\n> >\r\n> > 1999 Fujiko's Unlucky Days - Da Capo of Love  (Ai no\r\n> > Da Capo - Fujiko's Unlucky Days)\r\n> > SUB Odyssey Anime (v1)\r\n> > SUB Don Quixote\r\n> > INP Lupin Gang Anime\r\n>\r\n>\"Don Quixote\" is one of many false names for a\r\n>bootlegger that exists in New York City. His group has\r\n>done the first 2 Pokemon films (under the name\r\n>\"Pikachu Project,\" imitating the Japanese group that\r\n>worked on the film's creation), as well as a so-so\r\n>copy of \"Da Capo of Love.\"\r\n>If you visit Anime VCD (I forget the URL, but it's\r\n>hosted by Angelfire.com), they sell lots of VCD\r\n>versions of \"Don Quixote's\" bootlegs at premium prices\r\n>($12+ a pop). Many of these titles are Lupin III\r\n>films, which are possibly (and likely) VCD conversions\r\n>of Lupin Gang Anime subs.\r\n\r\nIck, thats ludicrous to pay for VCD's which have been sourced from second \r\ngeneration VHS copies in the first place.\r\n\r\nSVCD and Mini DVD (Mpeg-2 DVD data recorded onto regular CD-R media) are a \r\ndifferent story, and the fansub community may find a medium where it's eaier \r\nfor them to produce and distribute to fans.  The ablility to have the \r\nsubtitles separate from the video source helps a lot too.  The danger of \r\ncourse is that the lack of generational loss lowers the incentive for fans \r\nto buy legit DVD releases (or if you look at the other side of the coin, it \r\nforces companies to add extras to the DVD's)\r\n\r\n>\r\n> > 2000 1$ Money Wars\r\n> > INP Odyssey Anime\r\n>\r\n>The next special, Lupin the Third: Alcatraz\r\n>Connection, should be coming out on NTV's Friday\r\n>RoadShow this July, and I hope Odyssey will simply\r\n>jump at the opportunity to make it.\r\n\r\n>Just a little FYI for the folks and Rob to help\r\n>improve the FAQ.\r\n\r\nIt's very much appreciated, Although at this rate I'm going to have to add \r\nyour name as a contributor! :-)\r\n\r\n_________________________________________________________________________\r\nGet Your Private, Free E-mail from MSN Hotmail at http:\/\/www.hotmail.com.","message_date":"June 12 2001 6:59 PM"}