{"id":"214","author":"Robert Stickles","subject":"Re: Hrmph","body":">From: Tamara Williamson <lupinthe3rd@chickmail.com>\r\n>Reply-To: lupin@mcs.kent.edu\r\n>To: lupin@mcs.kent.edu\r\n>Subject: Re: [lupin] Hrmph\r\n>Date: 24 Dec 2000 13:57:41 -0500\r\n>\r\n>On Sun, 24 December 2000, \"Lupin 7\" wrote:\r\n>\r\n> > >:) Anyway, now on to a Lupin question. Anyone >know if they're gonna \r\n>make a\r\n> > >Lupin game for the Dreamcast? Thanks.\r\n> >\r\n>\r\n>I haven't heard anything thats for sure. Heck I am wondering how much the \r\n>Lupin licence costs myself, to see how much it would cost to make a comic \r\n>fighting game. *L* I'll keep my ears open also.\r\n\r\nWell, if the Tatsunoko Heroes (Gatchaman, etc.) can get their own fighting \r\ngame I'm sure it could be done with Lupin.  Too bad that IMO most of the \r\nLupin III video games (and I mean the ones you can actually play and not \r\nwatch old footage) have been poor.  Lupin is probably one of the better \r\nseries to base an action game on, and yet they haven't utilized it.\r\n.\r\n.\r\nA Lupin *driving* game in 1st or 3rd person perspective would be fantastic.  \r\nSomething akin to a cross between  SF Rush\/Crazy Taxi, and Need for \r\nspeed\/Test Drive would lend itself very well to a Lupin III theme.  Just \r\nbeing able to race on that strip of road between Neiss and Monte Carlo that \r\nyou see in the opening of Cagliostro (and in a few other films as well,  \r\nISTR Ronin used that same strip) would make it a must buy!\r\n\r\n\r\nIncidentally, a friend of mine who works for VM Labs is trying to get the \r\nthe US rights for Cliffhanger to be reproduced on Nuon DVD.  I explained to \r\nhim the foreign licensing problems associated with the two films that \r\nCliffhanger uses footage from (On another note, does anyone know the year \r\nthat the Leblanc estate first heard of Lupin III and exercised their rights \r\nto the name outside of Japan, ISTR this happened after the Cliffhanger game \r\nhad come out in 1983).  He's already talked to Taito Japan and there doesn't \r\nseem to be anyone left there who knows about Cliffhanger.  Tokyo Movie \r\nShinsha has turned up dry, since they own the footage and care nothing of \r\nthe interactive rights.  He's still checking with Stern Electronics who \r\nreleased the game in the US.  If anyone can be of help, it would be much \r\nappreciated.\r\n\r\nRegards,\r\nRob S.\r\n\r\n_________________________________________________________________________\r\nGet Your Private, Free E-mail from MSN Hotmail at http:\/\/www.hotmail.com.","message_date":"December 24 2000 3:43 PM"}