{"id":"216","author":"Arsene Lupin III","subject":"Mamo and more Mamo","body":"> If you're willing to part with a copy, or trade (I\r\n> know you're trading a lot \r\n> just to even see this) I might be able to clean up\r\n> that audio track, or in \r\n> the very least equalize the audio so it's not as\r\n> harsh.  It would then be a \r\n> snap to mate the audio back to a new video source.\r\n\r\nI'm still curious if the Japanese bilingual LD has it\r\nmyself, I have access to it, I just need some dough.\r\n\r\n> You're welcome to a copy of my version, or almost\r\n> any Lupin material that I \r\n> have.  That goes for everyone one the list as well. \r\n> Keep in mind I won't \r\n> copy domestic US release material, and I encourage\r\n> everyone to buy legit US \r\n> releases.\r\n\r\nIf only we could find legit copies of Streamline stuff\r\n(Cagliostro, cough, cough). However, Manga was pretty\r\nlucky to scoop up Cagliostro from Orion, what a\r\nproperty to pick up! Still, I wish Pioneer or Bandai\r\nwould get the chance to play around with Lupin on DVD.\r\n \r\n> I cringe every time I see people charging outrageous\r\n> amounts and have \r\n> ridiculous trading rules for subs they don't even\r\n> have masters to.\r\n\r\nGrr.\r\n\r\n> BTW, kudos to Odyssey for their subtitling efforts. \r\n> They are funding their \r\n> Lupin translations and subs out of their own pocket\r\n> and wouldn't take money \r\n> for sponsorship!  Shame on the scumbags who did a\r\n> terrible VCD transfer of \r\n> Pursuit of Harimao's Treasure and cut out Odyssey's\r\n> credits, and then had \r\n> the gall to charge $16 for it.\r\n\r\nYou might want to put the blame on these guys.\r\nAnime VCD Online does just that.... They've done a\r\ncrapload of Lupin subs, but some of the TV eps they\r\nhave weren't available subbed before, I don't think.\r\nhttp:\/\/www.angelfire.com\/ny2\/vcd\/\r\n\r\n> I wonder why Dale calls it the \"perfect\" Lupin dub? \r\n> Maybe he means the \r\n> voices match the tone and inflection of the original\r\n> Japanese voices, or \r\n> perhaps he's referring to the script?\r\n \r\nLike most of us cut our teeth on Carl's Cagliostro\r\ndub, Dale started with the ye olde English Mamo.\r\n \r\n> That may have been a royalty issue, since they'd\r\n> have to credit the \r\n> Streamline voice actors\/translators and add to the\r\n> unit cost of the DVD.  \r\n\r\nThey probably didn't have to, they bought the property\r\nfrom the company Orion (which owned the English\r\nrights, specifically the Streamline dub).\r\n\r\n> There are some footage differences between the two\r\n> versions as well, besides \r\n> the cropped and altered opening credits that would\r\n> throw the video out of \r\n> sync with the audio.\r\n\r\nWell, actually the music was the same as every\r\nversion, the video footage was just twisted and\r\nsnipped a bit. There was no loss or gain of play time\r\nas far as I could tell.\r\n\r\n> Not that it couldn't have been\r\n> done, but it looked \r\n> like Manga was struggling to even get this one out\r\n> (delays, delays).  \r\n\r\nSeveral years of them, which is why I'm not thrilled\r\nabout waiting for whatever they've got next up their\r\nsleeves (if anything).\r\n\r\n> Seamless branching on the DVD would have solved all\r\n> of these problems, but \r\n> if the DVD isn't a million seller it just isn't\r\n> worth it for companies to \r\n> spend the extra time to do it right (except maybe\r\n> Anchor Bay).\r\n\r\nWhere were our extras at least?? C'mon?! And what was\r\nwith those metal clangy things on the menu?? Manga's\r\nfull of it. I've had it with them.\r\n\r\n> Of course, \r\n> Cagliostro sold better than they expected.  I got it\r\n> from 800.com for $16 \r\n> and a few weeks later the price had jumped to $26!\r\n\r\nI used a similar system to buy it at Express.com, it\r\nsaved me 40%, but I had to pay shipping, too, which\r\nbrought it back up a lot....\r\n  \r\n> It may have been an issue of money, as TMS charges\r\n> quite a lot.  I think \r\n> we're lucky we saw the Streamline version of Mamo at\r\n> all.  The dubbing \r\n> sounds very much like a rush job, unlike Cagliostro\r\n> which was done with a \r\n> lot more care.\r\n\r\nI think the movie looked like a bit of a rush job in\r\nthe first place, so it seems fitting, don't you think?\r\n\r\n> Orion Pictures went into Chapter 11\r\n> in '94\/95 and pretty \r\n> much took Streamline with it.  For the longest time\r\n> you couldn't find a VHS \r\n> copy of Mamo *anywhere*.  It's only been in the last\r\n> year or so when the new \r\n> owners (can't remember the name offhand) started\r\n> cleaning out their \r\n> wharehouse of copies.  You see the VHS version\r\n> regularly on ebay now.\r\n\r\nI think MGM owns it all now. Yep. MGM. They're the\r\nones.\r\n\r\n> I think the \"new\" DVD has gone OOP (out of print). \r\n> Good riddance, I say!  \r\n> :-)\r\n\r\nIt's not *that* bad....\r\n\r\n\r\n=====\r\n\"Arsene Lupin III\"\r\nwebmaster@lupinthethird.nospam.com\r\n(Remove \"nospam\" to reply)\r\nhttp:\/\/www.LupintheThird.com\r\n\r\n__________________________________________________\r\nDo You Yahoo!?\r\nYahoo! Messenger - Talk while you surf!  It's FREE.\r\nhttp:\/\/im.yahoo.com\/\r\n","message_date":"October 18 2000 11:40 PM"}