{"id":"217","author":"Robert Stickles","subject":"Re: Mamo and more Mamo","body":">From: Arsene Lupin III <talesofthewolf@yahoo.com>\r\n>Reply-To: lupin AT mcs DOT kent DOT edu\r\n>To: lupin AT mcs DOT kent DOT edu\r\n>Subject: [lupin] Mamo and more Mamo\r\n>Date: Wed, 18 Oct 2000 21:40:53 -0700 (PDT)\r\n>\r\n> > If you're willing to part with a copy, or trade (I\r\n> > know you're trading a lot\r\n> > just to even see this) I might be able to clean up\r\n> > that audio track, or in\r\n> > the very least equalize the audio so it's not as\r\n> > harsh.  It would then be a\r\n> > snap to mate the audio back to a new video source.\r\n>\r\n>I'm still curious if the Japanese bilingual LD has it\r\n>myself, I have access to it, I just need some dough.\r\n\r\nA nice bonus would be a raw Japanese audio track as well, which can be used \r\nfor fansubs until it's confirmed that Manga really does intend to release \r\nit.\r\n\r\nMakes me wish I had picked up that legit Lupin vs Fukeshi ningen VCD, just \r\nfor the audio track.\r\n\r\n\r\n> > You're welcome to a copy of my version, or almost\r\n> > any Lupin material that I\r\n> > have.  That goes for everyone one the list as well.\r\n> > Keep in mind I won't\r\n> > copy domestic US release material, and I encourage\r\n> > everyone to buy legit US\r\n> > releases.\r\n>\r\n>If only we could find legit copies of Streamline stuff\r\n>(Cagliostro, cough, cough). However, Manga was pretty\r\n>lucky to scoop up Cagliostro from Orion, what a\r\n>property to pick up! Still, I wish Pioneer or Bandai\r\n>would get the chance to play around with Lupin on DVD.\r\n\r\nWell, I wouldn't be opposed to giving someone a copy of the Streamline dub \r\nsince it's technically not being commercially sold at the moment.  Not \r\nexactly kosher, but then again the companies who have the legimiate rights \r\nshoot themselves in the foot every day they delay releasing Lupin here.  If \r\nit's to compete against the new ultra slick, ultra cute newschool anime then \r\nit needs to be out there on the shelves so it's audience and potential \r\naudience can find it.  Manga is in for a rude awakening if they think Mamo \r\nor any other Lupin will sell as well as Cagliostro did, it had a lot of \r\nother things going for it than just being Lupin.\r\n\r\nYou can still find copies of Streamline Cagliostro, second hand.  It's not \r\nsuper rare or anything, unlike the english release of the Macross movie or \r\nfinding a good condition FHE Robotech volume 5 (the EP tapes that had 6 \r\nepisodes each).\r\n\r\nActually, I do see Streamline tapes used up here in Canada from time to \r\ntime.  Manga has no distributor in Canada so their version of Cagliostro has \r\nto be imported and is basically nonexistant here.\r\n\r\n\r\n> > BTW, kudos to Odyssey for their subtitling efforts.\r\n> > They are funding their\r\n> > Lupin translations and subs out of their own pocket\r\n> > and wouldn't take money\r\n> > for sponsorship!  Shame on the scumbags who did a\r\n> > terrible VCD transfer of\r\n> > Pursuit of Harimao's Treasure and cut out Odyssey's\r\n> > credits, and then had\r\n> > the gall to charge $16 for it.\r\n>\r\n>You might want to put the blame on these guys.\r\n>Anime VCD Online does just that.... They've done a\r\n>crapload of Lupin subs, but some of the TV eps they\r\n>have weren't available subbed before, I don't think.\r\n>http:\/\/www.angelfire.com\/ny2\/vcd\/\r\n\r\nAll the series II episodes they have are Lupin Gang subs, unfortunately :-(\r\n\r\n> > There are some footage differences between the two\r\n> > versions as well, besides\r\n> > the cropped and altered opening credits that would\r\n> > throw the video out of\r\n> > sync with the audio.\r\n>\r\n>Well, actually the music was the same as every\r\n>version, the video footage was just twisted and\r\n>snipped a bit. There was no loss or gain of play time\r\n>as far as I could tell.\r\n\r\nHmmm... I swear there's a few extra scenes during the wedding procession on \r\nthe Manga version and the organ music seems longer.  I'll have to watch both \r\nversions again.\r\n\r\n\r\n> > Not that it couldn't have been\r\n> > done, but it looked\r\n> > like Manga was struggling to even get this one out\r\n> > (delays, delays).\r\n>\r\n>Several years of them, which is why I'm not thrilled\r\n>about waiting for whatever they've got next up their\r\n>sleeves (if anything).\r\n>\r\n> > Seamless branching on the DVD would have solved all\r\n> > of these problems, but\r\n> > if the DVD isn't a million seller it just isn't\r\n> > worth it for companies to\r\n> > spend the extra time to do it right (except maybe\r\n> > Anchor Bay).\r\n>\r\n>Where were our extras at least?? C'mon?! And what was\r\n>with those metal clangy things on the menu?? Manga's\r\n>full of it. I've had it with them.\r\n\r\nYup.  It should have had the theatrical trailer, maybe a short text booklet \r\nor screen explaining why we had to wait so long to see Cagliostro in this \r\nform, with the proper character names, etc.  They could have cut a deal with \r\nTMS and Stern Electronics to make the disk interactive... and let people \r\nplay Cliffhanger (sans the Mamo footage though)...  Or included pictures of \r\nsome Cagliostro merchandise like the Medicom dolls, the Playstation 'game', \r\nor...\r\n\r\n\r\n\r\n\r\n>I think the movie looked like a bit of a rush job in\r\n>the first place, so it seems fitting, don't you think?\r\n\r\nTrue.  What's strange is that they went to the trouble of recreating some \r\nclassic Lupin scenes, such as the Fujiko-on-cycle (complete with theme \r\nmusic) from the end credits of Series I, and Lupin jumping out of his \r\nclothes on top of Fujiko from the pilot film and then they put the truck \r\nchase scene in there in all of it's three frames of glory :-)\r\n\r\n> > Orion Pictures went into Chapter 11\r\n> > in '94\/95 and pretty\r\n> > much took Streamline with it.  For the longest time\r\n> > you couldn't find a VHS\r\n> > copy of Mamo *anywhere*.  It's only been in the last\r\n> > year or so when the new\r\n> > owners (can't remember the name offhand) started\r\n> > cleaning out their\r\n> > wharehouse of copies.  You see the VHS version\r\n> > regularly on ebay now.\r\n>\r\n>I think MGM owns it all now. Yep. MGM. They're the\r\n>ones.\r\n\r\nYikes!  I just bought La Femme Nikita on DVD from MGM.  No extras to speak \r\nof, and dubtitles.  Blech.\r\n\r\n\r\n> > I think the \"new\" DVD has gone OOP (out of print).\r\n> > Good riddance, I say!\r\n> > :-)\r\n>\r\n>It's not *that* bad....\r\n\r\nDepends on what day of the week I watch it.  I can always pop in Legend of \r\nGold Babylon to remind me that it could have been worse.  :-)\r\n\r\n_________________________________________________________________________\r\nGet Your Private, Free E-mail from MSN Hotmail at http:\/\/www.hotmail.com.\r\n\r\nShare information about yourself, create your own public profile at \r\nhttp:\/\/profiles.msn.com.","message_date":"October 19 2000 2:15 AM"}