{"id":"218","author":"DANIEL ZELTER","subject":"Re: Mamo and more Mamo","body":"\"You listen, but you do not hear.  M2K bought the rights to distribute BGC \r\non DVD.  As such, it is M2K's responsibility to set things right.\r\n\r\nWhy should I let Animeigo off the hook and blame M2K? Animeigo allowed M2K \r\nto work on the project without even checking the finished product. So it \r\ngets sent to consumers who had their money invested in supposedly better \r\ncopies that turned out to be garbage.\r\n\r\n\"The replication plant screwed up the box set; since Animeigo is the one \r\ndistributing UY, they ARE setting things right. They are\r\nreplacing each and every bad disc that is out there. It's unfortunate that \r\nit had to happen right out of the gate, but Animeigo is going way out of \r\ntheir way to make sure everyone gets a clean set.\"\r\n\r\nThey already delayed the sets and kept fans waiting for more months than \r\ninitially predicted. On top of that, they don't even check the final \r\nproduct, but ship it and let the fans get inferior dvd's, and then make the \r\nfans wait even longer just to get the good sets. The reason is because their \r\ncompany couldn't fix the problem the first time. Now this could've all been \r\navoided if Animeigo checked the sets in the first place.\r\n\r\n\"First, were you ever charged ahead of time for UY?  No, you were not.  You \r\nwere charged when the box set shipped to you.\"\r\n\r\nAnd if you had a box set that was bad, you wasted time and money.\r\n\r\n\"Are you paying any extra money tohave Animeigo replace all the bad discs.  \r\nAgain, no.\"\r\n\r\nYou're paying, based on time.\r\n\r\n\"CPM shipped out the first box set of Slayers with problems.  Are they \r\ntaking immediate action to make sure everyone who bought it gets a trouble \r\nfree set?  No; they are taking a survey to see if there is\r\nenough interest to justify doing it.\"\r\n\r\nCPM has been in the dvd business a lot longer than Animeigo, and can be \r\nforgiven for their mistake. CPM was going to put Slayers on dvd anyway, so \r\nfans could have waited to find out-from reviews-if the sets were bad. With \r\nUY and BGC, you have to get the sets now, if you want the best discount, \r\nbecause Animeigo isn't going to give out a good price for those sets on the \r\nregular market. So how would you feel, as a fan, thinking you're getting a \r\ngood deal, and then you see all those stupid disc problems springing up?\r\n\r\n\"Do you have the UY box set in hand?  If so, please explain how it is\r\ninferior in your opinion.  If not, you only have the right to gripe about \r\nthe delay caused by a faulty replication.  I have the UY box set, and it is \r\nincredible.  Considering the age of the show, the picture and audio on it is \r\namazing.\"\r\n\r\nI didn't mean inferior in the sense that it's got bad picture or audio \r\nquality; you can only expect so much from a show that old. I meant inferior \r\nin the sense that it's really dropped down from Animeigo's previous efforts. \r\nThey let a second-hand producer do a disc job, so that if there was a \r\nscrewup, they could blame it on the other company, instead of on themselves \r\nfor not checking to make sure that it was in good condition before fans \r\ncashed their hard-earned money into the sets. Animeigo led fans to believe \r\nthey were going to do a good job, and so the fans put their trust and money \r\ninto Animeigo. At least there's no pretension with CPM. All CPM said was \r\nthey were going to put 26 episodes of a tv show on dvd. They didn't \r\nguarantee that it would be in the best condition.\r\n\r\n\r\n_________________________________________________________________________\r\nGet Your Private, Free E-mail from MSN Hotmail at http:\/\/www.hotmail.com.\r\n\r\nShare information about yourself, create your own public profile at \r\nhttp:\/\/profiles.msn.com.\r\n","message_date":"October 19 2000 9:06 PM"}