{"id":"220","author":"Robert Stickles","subject":"Re: Mamo and Dale","body":">From: Arsene Lupin III <talesofthewolf@yahoo.com>\r\n>Reply-To: lupin@mcs.kent.edu\r\n>To: lupin@mcs.kent.edu\r\n>Subject: Re: [lupin] Mamo and Dale\r\n>Date: Tue, 17 Oct 2000 17:53:23 -0700 (PDT)\r\n>\r\n> > I was at Tales of the Wolf\r\n>\r\n>Thanks for remembering the old site name, but FYI,\r\n>it's now just \"LupintheThird.com.\" I figured it'd be\r\n>easier to remember than the name of an old Streamline\r\n>video. ;-)\r\n>\r\n> > and I was wondering if\r\n> > the update about the\r\n> > Lupin Mamo dub referred to the Cantonese dub, cus\r\n> > Dale told me about it, and\r\n> > called it the \"Perfect Lupin dub\" or something like\r\n> > that.\r\n>\r\n>Well, I wouldn't go that far. It's accurate, but it's\r\n>got problems. I got it from Dale, yes, but I can't be\r\n>sure just where it came from, whether it is Cantonese\r\n>or Japanese in-studio or what.... Anyway, voice actor\r\n>selection (except Zenigata and Fujiko turned out OK)\r\n>and mouth flap are 2 big issues. I'd also add audio\r\n>quality, but given the multi-generation nature of the\r\n>copy Dale sent me (for which I am trading other Lupin\r\n>stuff), I can't point fingers. I'd rather watch the\r\n>Streamline dub (Dale hasn't seen it yet), but it's\r\n>cool to watch for the same reasons as \"The Secret\r\n>Files\"... Lupin memorabilia, nostalgia, etc.\r\n\r\nAre there any significant differences in the footage between the Streamline \r\nversion and this version (Other than the title and credits)?\r\n\r\nIf so, we may be able to match the old audio with the Streamline VHS or the \r\nOrion DVD footage.  I did a similar thing to the old DarkOps sub of Orders \r\nto Assassinate Lupin (Dark Order of Assassination) from two different \r\nversions that had different audio and video quality).\r\n\r\nThere's that \"Stairmaster\" comment in the Streamline dub that makes me \r\ncringe every time I hear it. ;-)  I try not to watch that dub.\r\n\r\nNow I wonder if *this* new\/old dub is the one we were talking about earlier, \r\nor does that bring the total of english dubs for Mamo up to 3?\r\n\r\nIf anyone on the list has the dual language Japanese LD of the film:  Do \r\nthey use the Streamline dub?\r\n\r\n> > Dale's also the\r\n> > guy who told me about\r\n> > Manga buying Mamo, so I'm sure he's right.\r\n>\r\n>Well, I asked him if it was he you had mentioned a\r\n>while back (how many other Lupin cosplayers can there\r\n>be?), and he confirmed it. But he said that Manga\r\n>hadn't *bought* Mamo, but it was to be their next\r\n>possible dub, I think. I wouldn't be too concerned\r\n>about Manga's plans... they'll take their sweet time\r\n>releasing it anyway....\r\n\r\nI still think Manga will do Goodbye Lady Liberty before anything else \r\nbecause they already have a translation for it (although they do need to \r\nmake a new dub).  Maybe we'll actually see it in North America too ;-)\r\n\r\n-Regards,\r\nRob S.\r\n\r\n_________________________________________________________________________\r\nGet Your Private, Free E-mail from MSN Hotmail at http:\/\/www.hotmail.com.\r\n\r\nShare information about yourself, create your own public profile at \r\nhttp:\/\/profiles.msn.com.\r\n","message_date":"October 18 2000 12:31 PM"}