{"id":"223","author":"Robert Stickles","subject":"Re: Mamo and Dale","body":">From: Arsene Lupin III <talesofthewolf@yahoo.com>\r\n>Reply-To: lupin@mcs.kent.edu\r\n>To: lupin@mcs.kent.edu\r\n>Subject: Re: [lupin] Mamo and Dale\r\n>Date: Wed, 18 Oct 2000 11:29:41 -0700 (PDT)\r\n>\r\n> >\r\n> > Are there any significant differences in the footage\r\n> > between the Streamline\r\n> > version and this version (Other than the title and\r\n> > credits)?\r\n> > If so, we may be able to match the old audio with\r\n> > the Streamline VHS or the\r\n> > Orion DVD footage.\r\n>\r\n>Actually, that's what my copy is. Someone (Dale?)\r\n>matched the audio of the dub with the Japanese LD\r\n>footage. The audio is pretty loud and in fairly sad\r\n>shape.\r\n\r\nIf you're willing to part with a copy, or trade (I know you're trading a lot \r\njust to even see this) I might be able to clean up that audio track, or in \r\nthe very least equalize the audio so it's not as harsh.  It would then be a \r\nsnap to mate the audio back to a new video source.\r\n\r\n> > I did a similar thing to the old\r\n> > DarkOps sub of Orders\r\n> > to Assassinate Lupin (Dark Order of Assassination)\r\n> > from two different\r\n> > versions that had different audio and video\r\n> > quality).\r\n>\r\n>Funny, my copy has both audio fuzz and poor video\r\n>quality. I'll just have to get the new Odyssey sub\r\n>instead.\r\n\r\nYou're welcome to a copy of my version, or almost any Lupin material that I \r\nhave.  That goes for everyone one the list as well.  Keep in mind I won't \r\ncopy domestic US release material, and I encourage everyone to buy legit US \r\nreleases.\r\n\r\nI cringe every time I see people charging outrageous amounts and have \r\nridiculous trading rules for subs they don't even have masters to.\r\n\r\nBTW, kudos to Odyssey for their subtitling efforts.  They are funding their \r\nLupin translations and subs out of their own pocket and wouldn't take money \r\nfor sponsorship!  Shame on the scumbags who did a terrible VCD transfer of \r\nPursuit of Harimao's Treasure and cut out Odyssey's credits, and then had \r\nthe gall to charge $16 for it.\r\n\r\n\r\n> > There's that \"Stairmaster\" comment in the Streamline\r\n> > dub that makes me\r\n> > cringe every time I hear it. ;-)  I try not to watch\r\n> > that dub.\r\n>\r\n>It's not much better than the stuff they say in this\r\n>dub...\r\n>\"This all seems so out of place.\"\r\n>\"We're the out-of-place ones.\"\r\n>And the acting complements it sooo well. (Note: this\r\n>is not from the scene you're referring to, it's just\r\n>an overall comment on the dub's quality).\r\n\r\nI wonder why Dale calls it the \"perfect\" Lupin dub?  Maybe he means the \r\nvoices match the tone and inflection of the original Japanese voices, or \r\nperhaps he's referring to the script?\r\n\r\n\r\n> > Now I wonder if *this* new\/old dub is the one we\r\n> > were talking about earlier,\r\n> > or does that bring the total of english dubs for\r\n> > Mamo up to 3?\r\n>\r\n>It's the same one from before, but if Manga ever dubs\r\n>it, that would bring it to a total of 3 Mamo dubs.\r\n>They *better* include them *all* on the DVD, blast it!\r\n>Like they shoulda done with the old Streamline dub of\r\n>Cagliostro...\r\n\r\nThat may have been a royalty issue, since they'd have to credit the \r\nStreamline voice actors\/translators and add to the unit cost of the DVD.  \r\nThere are some footage differences between the two versions as well, besides \r\nthe cropped and altered opening credits that would throw the video out of \r\nsync with the audio.  Not that it couldn't have been done, but it looked \r\nlike Manga was struggling to even get this one out (delays, delays).  \r\nSeamless branching on the DVD would have solved all of these problems, but \r\nif the DVD isn't a million seller it just isn't worth it for companies to \r\nspend the extra time to do it right (except maybe Anchor Bay).  Of course, \r\nCagliostro sold better than they expected.  I got it from 800.com for $16 \r\nand a few weeks later the price had jumped to $26!\r\n\r\n> > I still think Manga will do Goodbye Lady Liberty\r\n> > before anything else\r\n> > because they already have a translation for it\r\n> > (although they do need to\r\n> > make a new dub).  Maybe we'll actually see it in\r\n> > North America too ;-)\r\n>\r\n>Well, I heard it's not very good at all, even with the\r\n>English dub, so it is kind of, well, unlikely. I still\r\n>don't know why Streamline did \"Mamo\" instead of a\r\n>newer Lupin TV special (or Die! Nostradamus, which\r\n>came out in Japan in '95, same as English Mamo) as one\r\n>of their final farewell projects\r\n\r\nIt may have been an issue of money, as TMS charges quite a lot.  I think \r\nwe're lucky we saw the Streamline version of Mamo at all.  The dubbing \r\nsounds very much like a rush job, unlike Cagliostro which was done with a \r\nlot more care.  Orion Pictures went into Chapter 11 in '94\/95 and pretty \r\nmuch took Streamline with it.  For the longest time you couldn't find a VHS \r\ncopy of Mamo *anywhere*.  It's only been in the last year or so when the new \r\nowners (can't remember the name offhand) started cleaning out their \r\nwharehouse of copies.  You see the VHS version regularly on ebay now.\r\n\r\nI think the \"new\" DVD has gone OOP (out of print).  Good riddance, I say!  \r\n:-)\r\n\r\n\r\n\r\nRegards,\r\nRob S.\r\n\r\n_________________________________________________________________________\r\nGet Your Private, Free E-mail from MSN Hotmail at http:\/\/www.hotmail.com.\r\n\r\nShare information about yourself, create your own public profile at \r\nhttp:\/\/profiles.msn.com.\r\n","message_date":"October 18 2000 9:46 PM"}