{"id":"225","author":"Robert Stickles","subject":"Re: Rupan on DVD?!","body":">From: Arsene Lupin III <talesofthewolf@yahoo.com>\r\n>Reply-To: lupin AT mcs DOT kent DOT edu\r\n>To: lupin AT mcs DOT kent DOT edu\r\n>Subject: Re: [lupin] Rupan on DVD?!\r\n>Date: Fri, 22 Sep 2000 09:39:45 -0700 (PDT)\r\n>\r\n> > I hope Manga decides to at least release \"Lupin's\r\n> > Greatest Capers\" on\r\n> > Bilingual dvd.\r\n>\r\n>They'd probably redub it with their crappy Jigen and\r\n>Zenigata.\r\n>\r\n> > Actually, X should have rotted in Japan. There are X\r\n> > fans who hate it.\r\n> > That's why there's even a tv show in the works.\r\n>\r\n>That doesn't have anything to do with the fact that it\r\n>took Manga forever to bring it out domestically.\r\n>\r\n>\r\n> > Time will tell. If he had the inside track that\r\n> > Manga was buying any Lupin,\r\n> > he should be right about Mamo. Hopefully if they do\r\n> > buy it they'll call it\r\n> > by it's original name, \"Lupin vs the Clone\".\r\n>\r\n>I have mixed feelings about that. While I feel a\r\n>film's American title should usually be an accurate\r\n>translation of the Japanese title, this is a\r\n>challenge, and I can understand why Streamline changed\r\n>it... it gives away a major plot point! Lupin does not\r\n>even mention cloning until about halfway through the\r\n>film, when Mamo reveals a LOT of stuff to them... it's\r\n>a theatrical thing, I hope you understand. So, if it\r\n>DID get released domestically, I think it should be\r\n>under the title that is was released in Japan (to\r\n>begin with, not the title it was later dubbed \"Lupin\r\n>vs. The Clones), which was \"Lupin the Third\". I think\r\n>an English release of \"Lupin III: The Movie\" or\r\n>something to that effect, should be adequate. Then the\r\n>subtitle for the film's intro would be the accurate\r\n>\"Lupin the Third.\" And no problems with giving away\r\n>plot points. Tadaa!\r\n\r\nI thought it was later given the title \"Lupin vs Fukeshi Ningen\" in Japan \r\nafter Cagliostro was released.  My Japanese isn't that good, but I think \r\nthat translates into \"Lupin vs Immortal Men\".  That title doesn't give away \r\nas much of plot as the \"Clone\" title.  Is there a japanese word for \"clone\" \r\nor is it a katakana like \"ko ro n\"?  The story I heard for how the title \r\nMystery of Mamo came about was that it was coined by an american translator \r\nwho made up the name.  In fact, there was a previous Lupin villian called \r\nMamo (Mamoo?) from the second TV series.\r\n\r\nWhile we're on the topic of this film, I heard rumors that an english \r\nsemi-profesional fan dub of this does exist with a script that is very \r\nfaithful to the original script and characters.  This was apparently made in \r\nthe early 80's or very late 70's.  Can anyone shed some light on this?\r\n\r\n-Rob S.\r\n_________________________________________________________________________\r\nGet Your Private, Free E-mail from MSN Hotmail at http:\/\/www.hotmail.com.\r\n\r\nShare information about yourself, create your own public profile at \r\nhttp:\/\/profiles.msn.com.\r\n","message_date":"September 22 2000 2:12 PM"}