{"id":"228","author":"Robert Stickles","subject":"Re: Rupan on DVD?!","body":">From: Arsene Lupin III <talesofthewolf@yahoo.com>\r\n>Reply-To: lupin@mcs.kent.edu\r\n>To: lupin@mcs.kent.edu\r\n>Subject: Re: [lupin] Rupan on DVD?!\r\n>Date: Mon, 25 Sep 2000 10:16:37 -0700 (PDT)\r\n>\r\n>\r\n> > >I'll go look up \"Fukeshi\" real quick-like....\r\n> > >....\r\n> > >Grr. I'll have to figure out the kanji by visiting\r\n> > a\r\n> > >Japanese site on Lupin. But I know it's either\r\n> > >\"immortal men\" or \"duplicate men\". Cause I know\r\n> > that\r\n> > >at least \"ningen\" means \"men\"\r\n>\r\n>It's not \"Fukeshi\", it's \"Fukusei\", and I think it\r\n>means \"duplicate\" or \"copy\".\r\n>\r\n> > hehe.  The first I heard of it was someone\r\n> > requesting a copy of the dub (or\r\n> > at least the audio track) to refresh the video since\r\n> > most copies were multi\r\n> > generation.  Now if this does exist, it predates the\r\n> > US theatrical sub of\r\n> > Cagliostro which I thought was the first appearance\r\n> > of Lupin in the US\r\n> > (Stern's Cliffhanger game notwithstanding).\r\n>\r\n>Indeed, it would be the case. However, who requested\r\n>this and why did he request it from you? Do you run a\r\n>fansub distribution or something?\r\n>And does he have a copy (albeit multi-generation?) I\r\n>love to see Lupin dubs, just to see how the voices\r\n>have been selected.\r\n\r\nThis was a request by a fansubber on their web page (the URL is now long \r\ngone since my Mac weny belly-up).  Funny thing about Lupin sites, you have \r\nthem for a few days and then they disappear off the face of the earth.  \r\nChianime (who were one of the principal distributors for the now-defunct \r\nNeko Creations) has closed shop and no one seems to have masters of the \r\nFirst Series and\/or Secret Files. :-(\r\n\r\n     I *still* havent located someone who is willing to distribute that \r\noff-air subbed Liberty Crisis, even in it's multi-generational condition.  I \r\neventually had to buy the UK PAL dub and do a standards conversion on it. \r\nI'm tempted to re-sub this myself with better video and audio using the \r\nHawaiian TV script.  I've already had to combine two versions of Orders to \r\nAssassinate Lupin that had either poor audio or poor video to get a better \r\ncopy.\r\n\r\nSorry if it seems like I'm complaining here.  It took a lot of effort on my \r\npart to get as many different versions of particular Lupin stories as I can. \r\n  I'd still like a fansubbed Plot of the Fuma Clan for comparison purposes \r\nto Animeigo's script, if someone has one.\r\n\r\n\r\n-Rob\r\n_________________________________________________________________________\r\nGet Your Private, Free E-mail from MSN Hotmail at http:\/\/www.hotmail.com.\r\n\r\nShare information about yourself, create your own public profile at \r\nhttp:\/\/profiles.msn.com.","message_date":"September 25 2000 2:39 PM"}