{"id":"230","author":"dan boardman","subject":"Re: Rupan on DVD?!","body":"thanks alot between my frriends and i have all those exsept \"one dollor \r\nmoney wars\" i can't wait to get my hands on a copy \"castle of cagliostro i \r\nthought came before \"lupins greastest capes\" though thanks for the fast \r\nreply and by the way how maney lupin cds r there i mean god damn theres \r\nalot. about the t.v. shows i didn't realise so maney were out there to get. \r\nI do have a fair share(not by no means most by this news) but as you say the \r\nt.v. colection is huge and is all most imposible to get the hole thing. \r\nthanks agian\r\n\r\n>From: Arsene Lupin III <talesofthewolf@yahoo.com>\r\n>Reply-To: lupin AT mcs DOT kent DOT edu\r\n>To: lupin AT mcs DOT kent DOT edu\r\n>Subject: Re: [lupin] Rupan on DVD?!\r\n>Date: Tue, 26 Sep 2000 15:32:25 -0700 (PDT)\r\n>\r\n> > word whats the latest lupin realease i have most of\r\n> > the t.v. show but if you\r\n> > have any copys that you don't want let me know i'll\r\n> > buy em\r\n>\r\n>The latest commercial American Lupin release is\r\n>\"Castle of Cagliostro\". Next in line are \"Fuma\r\n>Conspiracy\" and \"Golden Legend of Babylon\" (DVD)\r\n>\r\n>The latest Japanese Lupin release is the \"One Dollar\r\n>Money Wars\" 2000 TV special (a snippet about it was\r\n>covered in the latest Animerica, as well as a review\r\n>of the Cagliostro DVD).\r\n>\r\n>The lastest English fansubtitled release has been\r\n>\"Fujiko's Unlucky Days\", although Lupin Gang Anime is\r\n>still finishing up the script for their version.\r\n>\r\n>What do you mean by \"most of the TV series\"? In order\r\n>for you to have \"most of it\", you would need about 125\r\n>or so episodes (the Lupin TV series 1-3 went into well\r\n>over 200 total episodes). If you have that many, I'm\r\n>sure many fans would be interested in your proposal.\r\n>However, if you had that many, they must certainly not\r\n>be ALL subtitled in English (nobody has gone through\r\n>that much effort to subtitle Lupin TV). If they're raw\r\n>Japanese, though, I'm still interested. Drop me a line\r\n>sometime.\r\n>\r\n>\r\n>=====\r\n>\"Arsene Lupin III\"\r\n>webmaster@lupinthethird.nospam.com\r\n>(Remove \"nospam\" to reply)\r\n>http:\/\/www.LupintheThird.com\r\n>\r\n>__________________________________________________\r\n>Do You Yahoo!?\r\n>Send instant messages & get email alerts with Yahoo! Messenger.\r\n>http:\/\/im.yahoo.com\/\r\n\r\n_________________________________________________________________________\r\nGet Your Private, Free E-mail from MSN Hotmail at http:\/\/www.hotmail.com.\r\n\r\nShare information about yourself, create your own public profile at \r\nhttp:\/\/profiles.msn.com.\r\n","message_date":"September 26 2000 6:52 PM"}