{"id":"233","author":"Valerie Mitchell","subject":"Re: Lupin On The Top Ten!","body":"\r\n>    Polls like that should always be taken with more salt than a plate of\r\n>fries... when you do a popular poll about what's the \"greatest X of all\r\n>time\", even in hallowed Japan, you're going to have the classics buried by\r\n>whatever's hotter and more recent.\r\n>    It's nice that Eva placed, but it's only like the most important\r\n>animated series ever made... it should have beat Dragonball.\r\n\r\nI don't agree. I think you're thinking about DBZ and not Dragonball as a\r\nwhole. Dragonball is an international favorite and is more worldly reknown\r\nthan just about anything on the list. It's a show that more than one age\r\ngroup can appreciate, which can't really be said for EVA. It lasted, in all,\r\nover the span of 10+ years, during which characters grow and change. Series\r\nlike this score higher than stuff like EVA because people in Japan have\r\ngrown up with it and recognize it (hence the fact that Doraemon got #1 best\r\ncharacter...the recognition is the same for Mickey Mouse in America, because\r\nDoraemon is about 40 years old.) BTW, am I the only person who thinks EVA\r\nsucks? When did anime get all deep and depressing? Like Lain!! I haven't got\r\nanyone to completely explain Lain, guess why....BECAUSE YOU CAN'T! I don't\r\nthink the creators could, even. You sorta get the point from watching\r\nit...but damn... there's a lot to be said for anime that has a concrete PLOT\r\nto it! >:(\r\n\r\n>    (pssst.... Nintendo's loyal fans used to be little kids... you think\r\n>Mario was real heavy on adult content?)\r\n\r\nHeh, nevertheless, I can wince at seeing Pikachu score so high on the list.\r\nOh well, at least Totoro got higher than him. ^O^\r\n\r\n\r\n\r\n\r\n-valerie \r\nhttp:\/\/members.tripod.com\/~valerie\r\n           __________________________________\r\n[########[]_________________________________\/\r\n\r\nLupin: \"Where's Goemon going?\"\r\nJigen: \"He said he was going to look for an angel.\"\r\nLupin: \"EH? Is he the hero in some shoujo manga?\"\r\n","message_date":"September 13 2000 7:21 PM"}