{"id":"237","author":"Robert Stickles","subject":"Re: LUPIN CAR!","body":"> >This is from memory (which sometimes isn't so hot :->) , but it's identified in the pilot as a Benz 300\r\n>SSK and as 'the same car as Hitler in that prosperous\r\n>year, with a top speed of 300kph'.  There may be\r\n>something wonky with the translation of that line,\r\n>however... this is of course the same translation\r\n> > that gave us his name as 'Alesenio Lupin' :-)\r\n>\r\n>Thanx, once again I wish I had the pilot.\r\n\r\nDrop me a line (rstickles@symaptico.ca), I can put both pilot films on tape for you and fill the tape up with other material since they are only 12 min each or so.\r\n\r\n>The car I mentioned, the Alfa Romeo Grand Sport, looks similar to the Benz 300 SSK.\r\n>According to a book I have on the TV series, not the first, I think the second. The car is a\r\n>Alfa Romeo Grand Sport 1930; it has a nice fold out poster with hand drawn pictures of it\r\n>and the Fiat 500. Personally from the pics below, I can only remember seeing the Alfa;\r\n>does the SSK resemble the one pictured below?\r\n\r\nSure does.  If I didn't see a side-by-side comparison of the two cars I probably would have considered them to be the same car (they are superficially similar).  I guess they didn't use it after the First TV series. \r\n\r\nCome to think of it, a lot of things changed from first series to the second, off the top of my head:\r\n\r\n-Jigen's gun originally was a double action Colt, later a 357 Magnum (he has gone back to a double action style pistol recently)\r\n\r\n-Lupin's silver-engraved Walther P-38 became the flat black model (there's two somewhat contradictory stories about how he lost the original Walther)\r\n\r\n-Inspector Zenegata joining Interpol, and the series becomes more international\r\n\r\n-We see less of the private lives of the cast in the second series, eg. the hideout that Lupin and Jigen share, and their various 'cover' jobs (eg.  Jigen runs a gun shop)\r\n\r\n-the 'relationship' that Fujiko and Goemon share is more subdued or just plain forgotten in later stories (except maybe Twilight Gemini).  Goemon was originally introduced as a villian and as a rival for Fujiko's affections.\r\n\r\n-the first series stories are more similar in tone to the original manga.  Lupin is less of a hero and more of a true criminal (while still being 'cool gevalt')\r\n\r\nAs for the site I maintain, I don't have one!  Never got around to making my own web pages... maybe I should.   In the meantime, I should get someone to host the Lupin in English FAQ :-)\r\n\r\n\r\n\r\nRegards,\r\n\r\nRob S.","message_date":"September 13 2000 11:58 PM"}