{"id":"24","author":"Arsene Lupin III","subject":"Lupin FanManga ...and Terror in Salivano's death.","body":"Terror in Salivano, the fanfiction of Lupin III that I was optimistic\r\nabout, is a thing of the past. However, since ideas for superior stories\r\narrive into my mind daily, don't count out the fanfics just yet...\r\n\r\nCOMING SOON.....\r\n\r\nLupin the Third: The Fan-Manga!\r\n\r\nWell, it's a long way ahead, but here's a summary of the current\r\nplotline:\r\n\r\nLupin and Jigen move to America. Upon their arrival and settling in a\r\ncozy apartment complex, a very young girl knocks on Lupin's door and\r\nrequests his help. The striking factor here in Lupin's mind is that she\r\ngreets him by name. Lupin, frustrated, scoops her inside and questions\r\nher. We discover she was sent by her brother to retrieve Lupin for a\r\nmysterious purpose. Lupin rejects the girl and walks into another room,\r\nwithout even showing her out. Jigen, reclining in the other room,\r\nreprimands Lupin (somewhat half-heartedly) for his actions. Lupin is\r\nmystefied by his own actions toward her... even though he already knows\r\nhe's not good with kids.\r\nLupin gets up early in the moonlit morning, due to a hunger for some\r\nkind of homemade sammich. Then he realizes his fridge is barren. He is\r\nhalf-tempted to go and buy some food immediately, but his lack of energy\r\nprevents the action. He walks back around to his bedroom and trips on\r\nsomething... it seems that the girl from the previous night has taken a\r\nnap on the floor right by his door! When she awakes, she convinces Lupin\r\nthat his efforts will be rewarded... after this, she grows into a\r\nfull-grown woman before his very eyes...\r\n\r\nOK, this may seem freaking weird, but I am confident that this Fanmanga\r\nwill be a far superior work to \"Terror in Salivano\".\r\nSpeaking of \"TIS\"...\r\n\r\nThe most common comment I recieved was, \"Reads a lot like Cagliostro.\"\r\nThere is something interesting about that reference...\r\n\r\nDuring the writing process, I noticed small and simple things were\r\npopping up in my writing that were quite similar to Cagliostro. Examples\r\ninclude:\r\n\r\nThe Italian-like title\r\nThe evil political overlord\r\nThe overlord's secret scandals\r\nZenigata working with the bad guy, later to discover his schemes\r\nLupin infiltrates the premises in the dark of night\r\nFujiko seems to feel nothing for Lupin emotionally\r\nZenigata is betrayed by the bad guy\r\nThe old man at the beginning providing convenient backstory (like\r\nCagliostro's gardener)\r\n\r\nI tried to disguise these factors with changes such as:\r\n\r\nLupin and Jigen not together during infiltration process\r\nGoemon preaches at Lupin, sorta like in \"Mamo\".\r\nJigen gets kidnapped\r\nFujiko works for the bad guy (once again, sorta like \"Mamo\")\r\n...and any other dissimilar elements.\r\n\r\nWell, anyway, expect the fanmanga on my site in the somewhat-near\r\nfuture... not sure when, sorry. I apologize for lack of site updates...\r\n\r\n< TalesoftheWolf@Juno.com >\r\nLupin the Third web site:\r\nhttp:\/\/talesofthewolf.homepage.com\r\nMystery Science Theater 3000 Animated Online web site:\r\nhttp:\/\/mst3000.homepage.com\r\n\r\n___________________________________________________________________\r\nGet the Internet just the way you want it.\r\nFree software, free e-mail, and free Internet access for a month!\r\nTry Juno Web: http:\/\/dl.www.juno.com\/dynoget\/tagj.\r\n","message_date":"November 21 1999 2:42 AM"}