{"ml_message_id":"5","author":"Arsene Lupin III","subject":"FANFIC: &quot;Lupin III: Terror in Salivano&quot; Pt. 1","body":"Lupin III\r\nEpisode 1\r\n\r\nIt is a beautiful day. Lupin and Jigen are roaming the countryside in\r\ntheir Fiat 500 on the way to their next caper.. Wherever that is..\r\n\r\nLupin is driving. Jigen takes a small pitcher of boiling water off of the\r\nin-dash heating device with which he heated it. He begins to pour it into\r\na bowl of instant ramen and beef. \r\n\r\nJigen: OK, Boss. We've been wandering Europe for over 2 weeks now and we\r\nstill haven't found any good jobs to pull. What's wrong? Have you lost\r\nyour keen senses or something?\r\nLupin: I dunno, Jigen. It seems there's something not quite right with me\r\nlately. \r\n\r\nJigen breaks his chopsticks \r\nJigen: Uh-huh. So what do you think it is?\r\nLupin: I'm not sure yet. I think I'll find out soon, though.\r\nJigen: I hope you're right, Boss. I don't think we can last much longer\r\non only ramen.\r\n\r\nJigen looks back at their box of ramen bowls and sees only 3 left.\r\n\r\nJigen: We need another caper. and fast.\r\nLupin: I'm working on it. \r\n\r\nThey approach a gas station on the roadside.\r\n\r\nLupin: Let's pull over here. We need some food.\r\n\r\nThe gauges on the dashboard read nearly empty for gasoline.\r\n\r\nJigen: .and gas, too.\r\n\r\nLupin pulls over at the gas station and shuts off the car. Jigen starts\r\nfilling the car's tank while Lupin enters to buy some food. He wanders\r\naround trying to find some tasty treats outside of Cup O' Noodles and\r\nFroot Loops. The cashier eyes him closely. Lupin is aware of this but\r\nignores him. It isn't until Lupin is irritated (and starts to say\r\nsomething) that the cashier speaks.\r\n\r\nLupin: Hey now, pal.\r\nCashier: You're not from around here, are you?\r\n\r\nLupin is taken a little aback by this and has to collect his thoughts for\r\na second.\r\n\r\nLupin: Why, no, sir. Just seeing the sights. My friend and I are\r\ntravelers. We write books on European countries and say how nice they are\r\nto visit. Our books sell very well. People take our writing so seriously,\r\nin fact, that we can make or break a country as a tourist attraction.\r\n\r\nThe cashier looks outside at Jigen struggling with the gas pump, trying\r\nto make it function properly (and failing miserably). The cashier turns\r\nback to Lupin. He scans him for a minute and speaks again.\r\n\r\nCashier: Hmm. That would explain why you actually HAVE money. Most people\r\naround here can't even afford to pay for a gallon of milk, much less what\r\nyou have in your bag. \r\nLupin: Is that so, old man? May I ask why?\r\nCashier: Don't call me \"old man\". And I doubt you really care about this\r\nlittle providence's plight. \r\nLupin: Humor me.\r\nCashier: As you wish. A rather wicked Archduke named Ferdinand runs our\r\nprovidence. He steals from the poor and gives to the rich. Of course, due\r\nto his policy, he's the only rich man in the providence! So we're left\r\nwithout a penny to spend on food or shelter. \r\nLupin: If that's so. wouldn't the value of money rise?\r\nCashier: Nope. That's because the money still exists. it's just that one\r\nperson owns it all.\r\n\r\nJigen enters the building after having filled the tank.\r\n\r\nJigen: Sorry I took so long, Boss. I have a hard time with those gas\r\npumps sometimes. \r\n\r\nJigen gets out his wallet and turns to the cashier.\r\n\r\nJigen: How much will it be, old fella?\r\nCashier: Let's see. for the gas and the food. it comes to 500 pounds with\r\ntaxes.\r\nJigen: 500 pounds?!?! Are you nuts? What kind of ridiculous price is\r\nthat?!\r\nLupin: This cashier fella was just telling me how the economy is\r\ncollapsing because of the over-greedy Archduke. Don't worry about it. I'm\r\nsure we'll be raking in the dough soon. \r\n\r\nJigen pulls out several large bills and hands them to the cashier. As the\r\ncashier reaches for some change, Lupin turns to him and speaks.\r\n\r\nLupin: Excuse me, sir. One last thing. where is the Archduke's royal\r\nresidence?\r\nCashier: Go down that road about a half-a-mile. Then you turn left on the\r\npaved street that you'll find. Follow it and ask the locals for where to\r\ngo from there. It gets real complicated once you get into town, so when\r\nyou find someone who knows, you might want to take a note or two. But I\r\nwarn you; this area can be very dangerous. The Archduke's palace is well\r\nguarded, so don't even think about trying to protest or you're history.\r\n\r\nDuring the cashier's relay of information we see Lupin and Jigen\r\ntraveling down the roads as directed, getting roadside assistance in\r\ntown, getting lost, scrambling to take notes, etc. When they finally\r\narrive at the palace, Lupin gets out of the car to look at it. Jigen\r\nstands up through the sunroof to observe, as well.\r\n\r\nLupin: It's a beautiful palace.\r\nJigen: Yep. \r\nLupin: So he steals from the poor and keeps for himself. Sounds like\r\nPrince John. or something like that.\r\nJigen: Whatever. So is this our next caper, Boss?\r\nLupin: In a way. Maybe this is why I was feeling a little off lately. My\r\nconscience has caught up to me again. I needed the chance to do some good\r\nto neutralize my criminal activity, I guess. It'll give me another\r\nopportunity to play Robin Hood.\r\nJigen: Yeah. We could definitely use some cash, anyway. It's getting\r\nlate, Boss. Don't you think we should find a place to stay for the night?\r\nLupin: Not a bad idea, Jigen. Let's go.\r\n\r\nJigen slips back in and Lupin starts to get in but pauses a second to\r\nlook at an open window from a building across the way. He thought he saw\r\nsomeone watching him.\r\n\r\nLupin: Hmm. \r\n\r\nLupin gets in and they pull away. Unable to find a hotel, the two camp\r\nout on the roadside. They begin to talk by the campfire.\r\n\r\nJigen: Man, I can't believe how expensive all those hotels were. 1200\r\npounds for 2 bedrooms? Outrageous! This Archduke fella really has it out\r\nfor these people or something.\r\nLupin: Don't worry too much about it. Once we pull the job off, I'm sure\r\nthe economy will become well balanced once again. Then we'll be able to\r\nafford food and some gas for the car.\r\nJigen: Let's pitch the tent. I'm bushed.\r\nLupin: I'm game.\r\n\r\nThe dome-shaped tent is pitched and the two sleep sweetly inside. That\r\nis, until.\r\n\r\nBang!\r\n\r\nA shot is fired from the darkness outside Lupin's tent. The bullet passes\r\nthrough the top of the tent, piercing two holes in it - one on each side.\r\nLupin and Jigen sit up quickly and look up at the holes, and then to each\r\nother. The shooter speaks.\r\n\r\nSoldier: On behalf of the Archduke, I command you to leave the area. This\r\nis reserved land for the Archduke's purposes! Now, leave, before I take\r\nout your heads!\r\n\r\nThis surprises Lupin and Jigen, given that the parcel of land they are on\r\nis completely barren and serves no apparent purpose. Nevertheless, they\r\nknow there is danger, since they hear more than just one soldier outside\r\ntheir tent. Lupin collects his sleeping bag with a swish of the arm, as\r\ndoes Jigen.\r\n\r\nLupin: You ready, Jigen?\r\nJigen: Just waiting for your signal.\r\nLupin: Get set. go!\r\n\r\nLupin and Jigen jump from the tent, tossing their sleeping bags into the\r\nsunroof of their car. The soldiers, in a semi-circle surround of the\r\narea, begin to fire like mad. Jigen grabs the tent and pulls out the\r\nflexible rods that support it while Lupin pulls out the extra-sharpened\r\ntent stakes from the ground. Lupin tosses the stakes at his antagonists\r\nduring the gunfire. Each stake hooks a gun from the soldiers' hands.\r\nJigen uses the flexible rods from the tent as extra-long nunchukus to hit\r\nthe soldiers on the head, knocking several down.\r\n\r\nLupin: Get in, Jigen!\r\n\r\nLupin hops into the car through the sunroof and pulls a handle to the\r\nleft of the steering wheel. Jigen leaps into the roof headfirst, legs\r\nflailing as the car's trunk opens, exposing the engine. The exhaust pipe\r\nbellows smoke, then fire, as the car takes off at a blinding speed. Jigen\r\nhas just enough time to set himself upright and fire at the opposition\r\nwith his trusty revolver. The soldiers shout.\r\n\r\nSoldier: Come back here, you!\r\n\r\nThe soldiers begin to fire more madly than before. Holes form in the car\r\nas bullets pierce its panels.\r\n\r\nLupin: No! My car! It'll take a week to repair now!\r\nJigen: Don't worry about it. We'll be raking in the dough soon enough.\r\nremember, Lupin?\r\nLupin: Yeah.\r\n\r\nLupin seems a little uncomfortable with the topic. Lupin and Jigen get\r\nfar enough away from their enemies that Jigen ceases fire. He puts away\r\nhis revolver and sits back down. He glances at his watch.\r\n\r\nJigen: It's still pretty late, Boss. Do you think we should just pull\r\nover and sleep in here?\r\nLupin: Yeah, but not until I get further away from the area. I don't want\r\nto be shot at again for awhile.\r\nJigen: Are we still going to pull the caper?\r\nLupin: Sure. We'll come back tomorrow. We'll see what's transpired when\r\nwe return.\r\nJigen: What do you mean, Boss?\r\nLupin: You'll see.\r\n\r\nBack at the evacuated campsite, one of the soldiers remains to patrol the\r\narea. He catches a small white piece of paper within the gaze of his\r\nflashlight. He walks over and picks it up. Upon reading the heading, he\r\nspeaks.\r\n\r\nSoldier: \".Lupin\"?\r\n\r\nLupin and Jigen head back towards town the following morning. Suddenly,\r\nLupin notices something in the distance. He screeches the car to halt,\r\nturning right so it is perpendicular to the road's path. He grabs a\r\nportable periscope and stretches it out the sunroof to zoom in on the\r\ndistant object.\r\n\r\nLupin: Just as I suspected.\r\nJigen: What is it?\r\nLupin: An ICPO patrol car. Looks like they found my message.\r\nJigen: You left an advance-warning card?\r\nLupin: Yep.\r\nJigen: This oughta be interesting.\r\n\r\nJigen looks around and sees a harvest field to his right.\r\n\r\nJigen: We ought to go through that wheat field there.\r\nLupin: Good idea, Jigen. Let's go.\r\n\r\nThey pull into the wheat field and turn left so they are traveling\r\nparallel to the road.\r\n\r\nLupin: If we go straight, we should hit the road into town.\r\nJigen: The place will be swarming with Interpol agents. How will we get\r\npast them?\r\nLupin: Hey, Jigen, c'mon! Who are you talking to, here?\r\n\r\nA mechanical-type noise from close by.\r\n\r\nLupin: Hey, Jigen, I hear something. Stand up and tell me what it is,\r\nwill ya?\r\n\r\nJigen stands up and sees a harvesting machine straight-ahead in the\r\nfield. He lowers his head to Lupin's ear.\r\n\r\nJigen: Boss! Hard bank left! Now!\r\n\r\nLupin makes a very sharp left turn. So sharp, in fact, that Jigen almost\r\nflies out. Jigen sits back down and relaxes as Lupin asks him a question.\r\n\r\nLupin: What was it, Jigen?\r\nJigen: A very big automatic reaper machine. Nearly chopped us to shreds.\r\nLupin: Thank goodness for my keen sense of hearing. Oh, and your lookout\r\nskills, too, Jigen.\r\nJigen: Yeah, sure. Whatever. \r\n\r\nJigen pulls out a small jug of water and starts to heat it on the\r\ndashboard. \r\n\r\nJigen: Boy, am I hungry.\r\n\r\nLupin screeches to a halt once again as they reach a clearing. Jigen and\r\nhis water jug are jostled, spilling hot water all over his shirt.\r\n\r\nJigen: Holy cow, Boss! Some people can't keep their feet off the gas\r\npedal. You, on the other hand, can't seem to.\r\n\r\nJigen looks around and sees that they had pulled out right in front of\r\nthe patrol car they had seen in the distance just minutes ago. After\r\npausing in shock for a moment, Lupin drives back up the road, screeching\r\nthe tires like mad. The troops now realize who it is.\r\n\r\nTroop: It's Lupin! Call Zenigata and tell him he's headed into town!\r\n\r\nAfter Lupin and Jigen drive a little while, they realize they are not\r\nbeing followed.\r\n\r\nLupin: What on earth are they doing? They're just sitting there!\r\nJigen: Sounds like you just answered your own question.\r\nLupin: It's almost like they expect us to go to town. I'll bet this is\r\njust what Zenigata wants. Well, then, Inspector, so it shall be.\r\n\r\nInside the royal palace, Zenigata and the Archduke are discussing the\r\nmatter. They are speaking inside a large, empty room. The room has little\r\ndécor other than a red carpet leading from the door to the Archduke's\r\ndesk, shadowed by a painting of the providence's seal.\r\n\r\nZenigata: So, why do you go about your duties in such a large, dull room?\r\nIt's not even very elaborately decorated.\r\nArchduke: I like open spaces. Decorations are a waste of money and time.\r\nJust so is this \"Lupin\" business.\r\nZenigata: Speaking of which, Lupin's advance-warning card arrived at 2\r\na.m. this morning. That probably means he has intentions already laid out\r\nto steal your treasure-trove, Archduke.\r\nArchduke: I am very grateful for Interpol's cooperation. I hear this\r\n\"Lupin\" is a very tricky character.\r\nZenigata: \"Arsène Lupin\" is always a name to look out for. We are more\r\nthan happy to help in any way we can.\r\nArchduke: Thank you, Inspector. See to it that Lupin does not reach this\r\npalace.\r\nZenigata: Actually, I have planned something quite different, Archduke. I\r\nintend to lure him here.\r\nTroop: Inspector Zenigata, Sir! We've just received word that Lupin is\r\nheaded into town right now!\r\nZenigata: Excellent. Right on schedule. Let's go, men.\r\n\r\nZenigata bows to the Archduke before leaving. After Zenigata is gone, the\r\nArchduke speaks to himself.\r\n\r\nArchduke: That wretched Zenigata. He'll let Lupin close in on my cache.\r\nand then I'll be ruined. I can't let that happen. I'll give him one\r\nchance. But if he fails.\r\n\r\nThe Archduke snaps a pen on his desk in two, causing it to bleed ink all\r\nover. He reaches for a towel on his desk nearby. Outside the palace,\r\nZenigata is talking to one of his men.\r\n\r\nZenigata: Peculiar fellow, that man. I never knew Archdukes sat behind\r\ndesks. I would think they'd sit on a throne or something. Anyway, do we\r\nhave an update on Lupin's whereabouts?\r\nTroop: No sir, but since it's been a while since we've heard anything, we\r\nassume he'll be here soon.\r\nZenigata: Don't make assumptions! Not with Lupin, anyway. We'd better\r\nhunt him down. He can't be too far.\r\n\r\nWe return now to Lupin and Jigen, who are driving in the middle of town,\r\nin a different car, wearing disguises.\r\n\r\nLupin: The perfect plan.\r\nJigen: They're driving right past us.\r\nLupin: Took forever to find a different car. These rental prices are sky\r\nhigh. Makes me want to take down this Archduke guy all the more.\r\nJigen: I love these disguises, but tell me, where do you get these\r\nthings, Boss?\r\nLupin: Salvation Army. They're all over the place nowadays.\r\nJigen: It's sure worth the money.\r\n\r\nLupin parks the car in front of a hotel. \r\n\r\nLupin: We'll see if we can get a room here for today. It'll give us a\r\nchance to check out the palace before we invade tonight.\r\n\r\nLupin reaches into the back seat and produces a wad of bills. Jigen's eye\r\nbecomes visible, as it is now wide open in astonishment.\r\n\r\nJigen: Where'd you get all that money, Boss? I thought we were broke!\r\nLupin: Emergency fund. We just need to find a way to bring our car into\r\ntown.\r\nJigen: What for? Oh yeah, all our stuff's in it. Are you sure Zenigata's\r\nnot gonna find it?\r\nLupin: What? Are you implying that the great Arsène Lupin the 3rd has no\r\nhiding skills? O ye of little faith. Interpol won't find it in a million\r\nyears.\r\n\r\nQuick cut to ICPO troops. They seem to have happened upon Lupin's\r\nvehicle, repainted to look like a large lump of stone, placed against a\r\nsmall natural rock structure. \r\n\r\nTroop: Zenigata! We've found him!\r\nZenigata: What? Show me!\r\nTroop: Well, it's not him, actually. It's just his car.\r\nZenigata: Well, break into his car, then! Find every bit of evidence you\r\ncan! Strip it to shreds, you hear me? TO SHREDS!\r\n\r\nThe troops have gone, so Zenigata speaks to himself.\r\n\r\nZenigata: Accursed Lupin.\r\n\r\n\r\nTalesoftheWolf@Juno.com\r\n\r\n\"Oh, yeah- he can sense danger. A POST-IT NOTE could sense danger better\r\nthan this guy!\"\r\n-Crow T. Robot, Mystery Science Theater 3000: While the hero\r\ntakes 30 seconds to \r\nrealize he's being chased by a quarterback-sized Aztec in the\r\nfilm \"The Puma Man\".\r\n\r\n___________________________________________________________________\r\nGet the Internet just the way you want it.\r\nFree software, free e-mail, and free Internet access for a month!\r\nTry Juno Web: http:\/\/dl.www.juno.com\/dynoget\/tagj.","message_date":"August 3 1999 1:17 AM"}