{"id":"50","author":"Lupin 7","subject":"Lupin the Third Goods, want some?","body":"Good day all,\r\n\r\nI have a question for everyone on the list(should you choose to answer it); \r\nconsidering the question though, I though it terrible that I have not yet \r\nproperly introduced myself to everyone despite the fact that I have been on \r\nthe list for well over a week now.\r\n\r\nFor those of you who care: My name is David Cummings, I am 19, I attend \r\nschool at Georgia State University where I major in Computer Science, \r\nalthough I'm trying to transfer to Georgia Tech; Yes, you guessed right, I \r\nlive in Georgia, Atlanta to be exact, and if you ever had any thoughts of \r\nvisiting this waste land, don't bother, It would be more fun and amusing to \r\nbe sucked into the arid wasteland of a Mad Max movie then to come to this \r\ncity(any wonder we hosted the Olympics). I first came across Lupin about 7 \r\nyears or so ago, give or take a year, when I saw Cagliostro, loved it, and \r\nhave been a Lupin fan ever since. Maybe you have been to my crappy fan page \r\nat:\r\nhttp:\/\/www.geocities.com\/lupinisjapanese\/\r\nMany of you have noted it takes along time to load; I'm going to get rid of \r\nit and replace it with something else. Yes I've met Monkey Punch, he is \r\nnice; my brother and I startled him by racing out of a lecture he was giving \r\nso that we could be first in line to pester him.\r\n\r\nThat's all, back to my question.\r\n\r\nAn associate and I are planning on selling Anime related merchandise via the \r\ninternet; a business plain which is profitable albeit unoriginal. We decided \r\nto start with an area we are already familiar with, Lupin the Third. My \r\nquestion is of course, \"What goods would Lupin fans in the United States be \r\ninterested in purchasing?\"\r\n\r\nThings I am aware of include:\r\n\r\nManga\r\nAssorted Junk(Gotcha Gotcha machine toys etc.)\r\nModels(I've seen a few Cagliostro ones, including one of the car scene in \r\nwhich Lupin has to beat that irate tour group from hell off his car, and one \r\nof the princess unconscious in that red car)\r\nPlush dolls\r\nAction figures\r\nKeychains\r\n\r\nWe intend on doing special order as our funds are limited;\r\nThese fall into that category:\r\nMusic Albums(Soundtracks and original Compilations)\r\nVideo Games(MSX titles, Famicom titles et cetra)\r\nMovie Cels\r\nJapanese Movies\r\nLaserdiscs\r\nLighters(the anniversory ones and any others)\r\n\r\nAnyone have any suggestions? Or am I just being a bother,\r\n\r\n\r\nTake care all, and think about it; and yes, we are for real, this isn't some \r\nstupid Joke, come success or failure, we at leat will make an attempt.\r\n\r\nSincerely,\r\n\r\nDavid Cummings\r\n________________________________________________________________________\r\nGet Your Private, Free E-mail from MSN Hotmail at http:\/\/www.hotmail.com\r\n","message_date":"July 21 2000 11:20 PM"}