{"id":"6","author":"Arsene Lupin III","subject":"FANFIC: Terror in Salivano Pt. 3","body":"Lupin III\r\nEpisode 3\r\n\r\nShe collapses to the floor. When she awakes, she sees the Archduke in\r\nfront of her. There is also a set of bars that run from floor to ceiling\r\nbetween her and the Archduke. She prepares to charge at him, but realizes\r\nher hands are tied behind her back. Her feet are also tied together. The\r\nArchduke sees her spastic struggles to escape and laughs.\r\n\r\nArchduke: Ha ha ha. So, the little traitor is awake, eh?\r\nFujiko: What do you mean, \"traitor\"? I did what you asked!\r\nArchduke: Ah.tsk-tsk, my dear. \r\n\r\nThe Archduke produces an audio cassette player from his pocket and\r\npresses play on it with his thumb. A familiar conversation is repeated\r\nover the small muffled speaker.\r\n\r\n\"Fujiko: You see, I also plan on taking the Archduke for every penny he's\r\ngot. You know me better than I suspected, Jigen. for someone who hates me\r\nso.\"\r\n\r\nHe stops the tape.\r\n\r\nArchduke: Now, if that isn't conspiracy against the government, I don't\r\nknow what is. You die at dawn.\r\n\r\nThe Archduke begins to turn away as Fujiko spits in his general\r\ndirection. The spit lands nowhere near the Archduke, but he gets the\r\nmessage.\r\n\r\nArchduke: Oh, I see. So you wish to die now, is that it?\r\n\r\nFujiko turns her head away as if to gesture to the contrary.\r\n\r\nArchduke: Dawn it is, then.\r\n\r\nThe Archduke turns away and steps into the darkness.\r\n\r\nJigen: This whole thing is all your fault, you know.\r\nFujiko: Huh?\r\n\r\nFujiko looks around her to see that Jigen and Inspector Zenigata are tied\r\nup behind her in the same cell, sitting against the worn brick wall.\r\n\r\nJigen: If you hadn't fallen for the Archduke's promises of wealth, you\r\nmight still have had a chance at getting your precious treasure. But no,\r\nyou had to bring us down too. \r\nFujiko: I'm sorry, guys. I guess I just got greedy. What's Zenigata doing\r\nin here?\r\nZenigata: I'll take this one. It seems the Archduke got a hold of the\r\nrecordings we made of Lupin's walkie-talkie conversation. When he.\r\nFujiko: Wait, you were listening in on Lupin's conversation?\r\nZenigata: Well, yes. \r\nFujiko: How did you discover the frequency?\r\nZenigata: Interpol has its resources.\r\nJigen: He found the users' manual in Lupin's car.\r\n\r\nZenigata looks upset that Jigen revealed his secret.\r\n\r\nZenigata: Anyway, When the Archduke discovered that Lupin had found his\r\njackpot of death warrants, he locked me up to silence me.\r\nFujiko: Where are all your men?\r\nZenigata: Locked up elsewhere in the palace, probably.\r\nFujiko: Won't ICPO notice you're gone?\r\nZenigata: Personally, I don't think they're too worried about me.\r\nFujiko: So, what now?\r\nJigen: We wait for Lupin to show up. He's our last hope.\r\nFujiko: We're done for.\r\n\r\n\r\nLupin, alone in his hotel room, gathers his equipment. The moon has\r\nalready risen. He slips on his teal sports jacket, yellow tie, black\r\nshirt and pants. He seems to know what he is going to do. Goemon arrives\r\nat the door and enters the hotel room, sword in hand.\r\n\r\nGoemon: So you've made your decision then?\r\nLupin: Yep. I've got to help Jigen. But I need your help, Goemon. Well,\r\nyou and that samurai sword of yours.\r\nGoemon: So, what's the plan?\r\nLupin: Follow me.\r\n\r\nLupin grabs a small bag and slips it into an inside jacket pocket. They\r\nboth go out the other side of the building through a fire escape. Lupin\r\nslips into the car he had rented earlier that week and takes off with\r\nGoemon inside. Once outside of town, Goemon speaks.\r\n\r\nGoemon: What makes you think you can help Jigen by leaving town?\r\nLupin: You'll see.\r\n\r\nLupin pulls over once they reach the spot of choice.\r\n\r\nLupin: Here's the place.\r\nGoemon: A barren lot?\r\nLupin: That's what I thought the last time I was here.\r\n\r\nLupin and Goemon get out of the car and walk onto the small patch of\r\nland.\r\n\r\nLupin: This parcel of land is important somehow. Goemon, could you slice\r\na neat little hole right here?\r\n\r\nLupin poiy are the prisoners startled, they are grateful.\r\n\r\nLupin: Well, well. Look who it is. Fujiko the backstabber. And our old\r\nfriend Zenigata. Oh, yeah. Jigen too.\r\nJigen: Thanks a lot, Boss.\r\nZenigata: Get us out of here, Lupin! If you don't get me out, I'll.!\r\nLupin: Tsk, tsk. Calm down, Inspector. First, Goemon here needs to do a\r\nlittle abracadabra with his little sword.\r\nGoemon: Please do not refer to my talents as cheap magic.\r\nLupin: Magic isn't cheap. It's very entertaining. Here, check this out. \r\n\r\nLupin pulls out a coin and makes it disappear from his hand. He then\r\nproduces it from Goemon's ear. Lupin smiles grandly as if he has just\r\nmade a new friend. Unfortunately, this did not have the same effect on\r\nGoemon. He simply frowns at Lupin.\r\n\r\nGoemon: Idiot.\r\nLupin: Humph. Thanks a lot.\r\n\r\nGoemon slashes apart the bars with ease, allowing Lupin to enter the\r\ncell.\r\n\r\n\r\nTalesoftheWolf@Juno.com\r\n\r\n\"Oh, yeah- he can sense danger. A POST-IT NOTE could sense danger better\r\nthan this guy!\"\r\n-Crow T. Robot, Mystery Science Theater 3000: While the hero\r\ntakes 30 seconds to \r\nrealize he's being chased by a quarterback-sized Aztec in the\r\nfilm \"The Puma Man\".\r\n\r\n___________________________________________________________________\r\nGet the Internet just the way you want it.\r\nFree software, free e-mail, and free Internet access for a month!\r\nTry Juno Web: http:\/\/dl.www.juno.com\/dynoget\/tagj.","message_date":"August 3 1999 1:35 AM"}