{"ml_message_id":"7","author":"Arsene Lupin III","subject":"FANFIC: Terror in Salivano Pt. 2","body":"Lupin III\r\nEpisode 2\r\n\r\nLupin and Jigen have gotten their hotel room and are discussing their\r\nplan.\r\n\r\nJigen: Tonight, eh? Well, at least we're getting it over with.\r\nPersonally, I could use another 40 winks.\r\nLupin: Oh, still tired, eh? Tell you what. You take a nap while I go pick\r\nup some stuff from the car, OK? See you later.\r\nJigen: 'Night.\r\n\r\nLupin heads out into the night, as it is now dark out. He wears a\r\nninja-like costume: almost completely black except for a face hole. As he\r\napproaches his car's hiding spot, he notices that it is surrounded by\r\nICPO troops. Lupin gasps from nearby bushes. He pulls something out from\r\nhis belt and throws it away from the car, so as to lead away the troops.\r\nThe explosion distracted several troops, but two remained on guard. Lupin\r\nbecame frustrated by this and sneaked over behind the rock structure. He\r\nclimbed over it so that he was above and behind the Interpol troops. He\r\npicked up a large rock from the top of the structure and threw it down\r\nonto the ground nearby. The remaining troops left to investigate. Lupin\r\nsmiled as he attached a hook and wire to a sturdy chunk of rock on the\r\ntop of the structure. As he let himself down to the car, he got out his\r\nkey for the hood, which contained the necessary items for the caper. The\r\nwindows had all been bashed in, and the available interior had been\r\nsearched thoroughly, although internal secret compartments were unopened.\r\nHis car was custom-designed so that the hood and secret stuff required\r\nits own key, so that no one could get into them. Not even Zenigata could\r\npierce the lock, as Lupin saw. The hood had been beaten in and scarred on\r\nthe edges where a crowbar had been applied.\r\n\r\nLupin: Holy cow, Zenigata must have been furious about that.\r\n\r\nLupin smiles real big and giggles.\r\n\r\nLupin: Boy, I wish I could have seen the look on his face.\r\n\r\nAs Lupin whispers to himself, he opens the hood and pulls out a large\r\nobject in a box. As he scoots off into the darkness, the Interpol agents\r\nreturn confused. After seeing the open hood, they become very frustrated,\r\naccusing each other blindly for leaving their posts. Lupin returns to his\r\nhotel room via the rear window and his remarkable climbing skills. As he\r\nenters, Jigen asks him something.\r\n\r\nJigen: You got the supplies?\r\nLupin: Well, I got all we really need. We won't have all our extras like\r\nwalkie-talkie earpieces this time, but.\r\nJigen: Walkie-talkies? Oh, I grabbed those before you hid the car.\r\n\r\nJigen produces them from his pocket.\r\n\r\nLupin: Why did you do that?\r\nJigen: I figured you'd screw up on the car thing\r\nLupin: How did you know.?\r\nJigen: I just knew. \r\nLupin: Oh. Well. OK. Let's get to work then!\r\n\r\nLupin opens the package he wielded, revealing a miniature catapult device\r\nalong with several small trinkets. Lupin and Jigen remove the catapult\r\nand some miniaturized devices such as small slingshots and smoke bombs.\r\nJigen hands Lupin a walkie-talkie mouth and earpiece, which Lupin puts on\r\nover his stealth hood. Jigen puts on his own walkie-talkie as Lupin takes\r\nout a facial mask for the outfit he wears and puts it over his mouth and\r\nnose. This leaves no body part exposed except for his eyes. He puts on a\r\nbelt equipped with several objects in small packets all across it. Jigen\r\ngets out some layouts of the Palace, which were also in the box. Jigen\r\nlooks surprised, revealing his eyes.\r\n\r\nJigen: Diagrams and building plans to the Royal Palace?!\r\n\r\nJigen turns to Lupin, who is filling the packets on his belt with some\r\ndevices.\r\n\r\nJigen: How on earth did you get these, Lupin?\r\nLupin: I have my ways. \r\nJigen: Tell me, Lupin.\r\nLupin: Can't I have my own little secret every once in a while?\r\nJigen: Lupin.\r\nLupin: Nope. Can't tell ya.\r\nJigen: Lupin, stop toying with me. Where did you get this stuff?\r\nLupin: All right, at the Hall of Records. They were closed, so I sneaked\r\nin and borrowed them. Amazing what those guys have, isn't it?\r\n\r\nJigen looks down at the plans and diagrams.\r\n\r\nJigen: Yeah. remarkable.\r\n\r\nLupin, suddenly motivated, rolls the miniature catapult towards the\r\nwindow. When it is close enough, he starts scanning the room as if\r\nlooking for something.\r\n\r\nLupin: We need something to weigh it down with.\r\nJigen: How about the bed?\r\nLupin: Sounds heavy enough to me.\r\n\r\nLupin and Jigen grab the bed and drag it across the room. They rest a leg\r\nupon the base of the catapult, and wipe their foreheads.\r\n\r\nJigen: Boy, that bed was a lot heavier than I had expected.\r\nLupin: No kidding. That catapult is staying put, that's for sure.\r\nJigen: Let's do it.\r\n\r\nLupin nods and curls up into the catapult. After opening the window,\r\nJigen extends the catapult's arm and pulls it taut. While Jigen ties down\r\nthe arm, Lupin tests the walkie-talkie.\r\n\r\nLupin: 1-2-3. Testing. You hear me coming through, Jigen?\r\nJigen: Of course I do. You're right here.\r\nLupin: Shut up. I mean through the walkie-talkie.\r\nJigen: Oh! Oh, yeah, you're coming through just fine.\r\nLupin: OK, you ready?\r\n\r\nJigen pulls out a small sharp knife.\r\n\r\nJigen: Ready as I'll ever be.\r\nLupin: One.\r\nJigen: Two.\r\nLupin: Three!\r\n\r\nRight after \"Three\", Jigen cuts the rope and Lupin is tossed into the\r\nair, flying toward the palace. His flight path begins to dip, so he\r\nquickly pulls out a grappling hook and tosses it at the palace roof. The\r\nhook connects to a corner and Lupin swings safely over the Earth, under\r\nthe roof corner, is pulled backwards, and lands on the rooftop which he\r\nhooked. Lupin looks down at the scene below. A couple of guards had\r\nspotted Lupin's antics but could not locate him. They returned to their\r\npositions shortly afterward, and Lupin went about his business, but not\r\nwithout a sigh of relief. He receives a message from Jigen over the\r\nearphone.\r\n\r\nJigen: Great. You're on the roof. Safe and sound.\r\nLupin: Almost not. I alerted some guards below, but they lost my trail.\r\nMust have rustled some bushes on the swing up.\r\nJigen: You better be careful about those guards. They got some special\r\nequipment for this occasion: high powered rifles. These aren't the\r\nclassic pistol-wielding guards that you'd normally see around here. I'm\r\nsurprised the roof isn't crawling with snipers right now.\r\nLupin: What now?\r\n\r\nJigen consults the map.\r\n\r\nJigen: Uh. there should be a secret passageway integrated into the roof\r\nas an escape route. It doesn't seem like anyone's guarding it, so it's\r\nprobably been long forgotten. \r\nLupin: What does it look like?\r\nJigen: Can't really say. Just look for an unnatural crease mark\r\nsomewhere.\r\n\r\nLupin looks around.\r\n\r\nLupin: I can't see anything. It's too dark.\r\nJigen: Man, we sure could use some night-vision goggles about now. Try\r\nfeeling around on it.\r\n\r\nLupin moves his hands across the roof until he notices some thin indented\r\nstreaks.\r\n\r\nLupin: Hey, Jigen, I think I found something.\r\nJigen: I think that's it. Open her up, Boss!\r\n\r\nLupin removes the panel and looks in. The inside looks like the average\r\nhouse attic.\r\n\r\nLupin: Looks clear. I'm going in.\r\nJigen: Be careful where you go, Boss. You can never be too cautious.\r\n\r\nLupin slips in and replaces the cover behind him. Because there is no\r\nlight, Lupin pulls out a miniature flashlight and turns it on,\r\nilluminating much of the room.\r\n\r\nLupin: Wow. Looks horrible up here. \r\n\r\nThere is dust and spider webbing all over, with several boxes placed\r\nagainst a wall. Lupin approaches the boxes.\r\n\r\nLupin: Well, what have we here?\r\nJigen: What is it?\r\n\r\nLupin looks through the objects inside the boxes. They include records of\r\nthose killed by order of the Archduke. Lupin picks out one such form,\r\nwhich states that the reason for death was due to lack of tax payment.\r\n\r\nLupin: Oh my.\r\nJigen: What is it, Boss?\r\nLupin: Seems as though the Archduke has been a naughty boy. He has\r\nsentenced death to about 200 unwitting citizens. just because they didn't\r\npay their taxes.\r\nJigen: What the. that's genocide!\r\nLupin: That's right. So the rumors were true. He is a madman.\r\n\r\nJigen suddenly hears a small crackle over the headset.\r\n\r\nJigen: What was that?\r\nLupin: What was what?\r\nJigen: Lupin, I think someone's list.\r\n\r\nClick.\r\n\r\nSomeone has a gun to the side of Jigen's head now, and has the hammer\r\npulled back.\r\n\r\nWoman's Voice: Don't say a word. Just tell Lupin to go downstairs, toward\r\nthe basement.. Or you could go ahead and tell him about this and have\r\nyour head cleaned out. Which shall it be?\r\n\r\nJigen whisper's the woman's name to himself.\r\n\r\nJigen: Fujiko.\r\n\r\nThe mike did not pick up Fujiko's speech, but it did pick up Jigen's\r\nwhispering. And Lupin heard it.\r\n\r\nLupin: Jigen, what are you talking about? Is everything okay up there?\r\n\r\nJigen starts to sweat a little. and with good reason. He kills the\r\nsilence.\r\n\r\nJigen: Um.nothing. Everything's just fine. Head downstairs, towards the\r\nbasement. I think there's something down there.\r\nLupin: OK, Jigen. Whatever you say.\r\n\r\nZenigata: Did you catch that bit about the Archduke, Sam?\r\nSam: Yes, Inspector. It's all recorded right here.\r\n\r\nThe troops from ICPO are stationed in the palace basement, listening in\r\non Lupin's walkie-talkie conversation with high-tech radio equipment.\r\n\r\nZenigata: So the Archduke is a genocidal madman. No wonder he's so weird.\r\nNext time we meet, I'll have him arrested. Right now, I want this\r\noperation to catch Lupin red-handed to go smoothly for once.\r\nSam: It ought to, with the signal tracker.\r\n\r\nThe signal tracker is a small screen devoted to a layout of the palace\r\nand the source of Lupin's signal, which is constantly moving across the\r\nmonitor.\r\n\r\nSam: Hey. Inspector!\r\nZenigata: Hm?\r\nSam: Lupin's headed right this way, sir. \r\nZenigata: Excuse me?\r\n\r\nZenigata watches the monitor and discovers that Sam is right. \r\n\r\nZenigata: Like he's being lead right to us! Well, we'll be ready for him,\r\nwon't we boys? Get the nets, the handcuffs, the ropes, everything! I want\r\nLupin taken alive, you hear? \r\n\r\nAs his other troops leave the area to follow orders, Zenigata turns\r\ntoward the small monitor and smiles.\r\n\r\nZenigata: Now I gotcha.\r\n\r\nThe light emitting from the monitor which signifies Lupin's location is\r\nwatched closely by Zenigata and Sam. Meanwhile, Jigen is getting awfully\r\nnervous about Fujiko's gun.\r\n\r\nFujiko: You're probably wondering why I'm putting my gun to your head.\r\nWell, the plan is to lead our friend Lupin right into the law's hands.\r\n\r\nJigen whispers.\r\n\r\nJigen: Zenigata.\r\nFujiko: Shhh! Yes. Zenigata, indeed. Once you and Lupin are out of the\r\nway, I can collect the riches all for myself, you see. The Archduke and I\r\nhad an agreement. I eliminate Lupin and crew, and he gives me a handsome\r\nsum. Do you have anything else to ask?\r\n\r\nJigen nods.\r\n\r\nFujiko: Cover your mouthpiece. Then you can ask me whatever you want.\r\n\r\nJigen brings up his hand and wraps it across the mouthpiece.\r\n\r\nJigen: All right, Fujiko. All this for just a \"handsome sum\"? Doesn't\r\nseem like you would sink this low for such a small amount.\r\nFujiko: Oh, don't you worry about that. \r\n\r\nWhile Fujiko speaks, Jigen lets up on the mike just enough so that sound\r\ncan pass into it. He reaches for his earphone and turns up the mike\r\nsensitivity. Fujiko continues.\r\n\r\nFujiko: You see, I also plan on taking the Archduke for every penny he's\r\ngot. You know me better than I suspected, Jigen. for someone who hates me\r\nso.\r\n\r\nLupin can now hear Fujiko's rant over the walkie-talkie and is starting\r\nto understand what is going on.\r\n\r\nLupin: So Fujiko's with Jigen right now. Terrific. That means I've been\r\nled right into.\r\nZenigata: Surprise!\r\n\r\nZenigata appears from around a corner, handcuffs in hand and his troops\r\nright behind him.\r\n\r\nLupin: Gulp.\r\nZenigata: After him!\r\n\r\nLupin runs away, up the stairs and out the trap door on the roof.\r\nZenigata and co. follow just behind Lupin, cursing his every step. Lupin\r\ntosses an impact-triggered smoke bomb to the ground, causing the guards\r\nbelow to shoot into the fog. He unleashes some ninja stars on the guards'\r\nguns, knocking them out of their hands. Lupin leaps into the smoke and\r\nruns into the street. Zenigata jumps to the ground, but lands clumsily\r\ninto a bush instead of on his feet. The ICPO troops, too scared to leap,\r\nhead back inside to take the stairs. By the time Zenigata gets out of the\r\nbush, the smoke has cleared, and Lupin the 3rd is nowhere to be seen.\r\n\r\nThe next morning, after having been in hiding all night, Lupin returns to\r\nthe hotel room where he and Jigen had been staying. He finds that Jigen\r\nis missing, and that the plans and diagrams of the palace had been\r\nremoved. Outside of that, everything seemed to be intact. Lupin wanders\r\nabout the room a bit, then takes the bed off of the catapult's base so\r\nthat it is level. He then sits down on it and rests his elbows on his lap\r\nso his hands dangled between his legs. He then drops his head down and\r\nfaces the floor.\r\n\r\nLupin: Crap.\r\n\r\nLupin knows he has only one last resort.\r\n\r\nLupin: Better call Goemon in for this one.\r\nDeep Voice: I believe that would be wise decision on your part, Lupin.\r\n\r\nThis startles Lupin and he looks all around him to see where it came\r\nfrom.\r\n\r\nLupin: Goemon?\r\n\r\nGoemon is sitting in a dark corner of the room as if he were meditating.\r\nHis legendary indestructible blade is held across his chest in its sheath\r\nby his folded arms. Lupin sees him and turns toward him, still a little\r\nsurprised to see him already here.\r\n\r\nLupin: What're you doing here already?\r\nGoemon: Don't you read the morning paper?\r\nLupin: I'm just passing through, Goemon. I don't need to be informed on a\r\ncountry I don't live in.\r\nGoemon: I suggest you read that one.\r\n\r\nGoemon gestures to the dresser's top. That day's paper is atop it. He\r\nhadn't noticed it on the way in for some reason. Lupin skims through it\r\nuntil he sees a small picture of Jigen in the section that discusses\r\ncriminal issues and court cases. He reads it aloud.\r\n\r\nLupin: \"Late last evening, a break-in took place at the Royal Palace in\r\nSalivano. Arsène Lupin III, the man presumed responsible, escaped the\r\nhands of Interpol. However, an assistant to the break-in and attempted\r\nassassination of the Archduke, Jigen Daisuke, was charged with attempted\r\nmurder and conspiracy against the government and imprisoned in the\r\nSalivano Prison.\"\r\n\r\nLupin pauses and turns to Goemon.\r\n\r\nLupin: . Jigen's in jail? \r\nGoemon: Continue.\r\n\r\nLupin returns to his paper and finds his place.\r\n\r\nLupin: \"As we all know, such crimes are worthy of capital punishment. He\r\nhas been sentenced to death by firing squad at Noon tomorrow. All\r\ncitizens are welcome to attend the execution.\" Oh, boy. Goemon, you got\r\nany ideas?\r\nGoemon: Sounds like this is going to be a challenge truly worthy of a\r\nmaster thief. But this time, it is not money or riches to collect. It is\r\nthat of a valuable human life. Your own life now becomes at stake, Lupin.\r\nThis is where you must choose your life path. Will you continue to be a\r\nlowly thief, seeking riches and glory wherever you go? Or will you become\r\na hero, liberating those in oppression, and destroying those who do evil?\r\n\r\nLupin pauses for several moments.\r\n\r\nLupin: Goemon, that could very well be the most difficult question I'll\r\never have to answer.\r\n\r\nGoemon stands up and approaches the door. He partially opens it, then\r\nturns toward Lupin.\r\n\r\nGoemon: You won't have much time to think about it. When you do make your\r\ndecision, call me. I'll be waiting.\r\n\r\nGoemon leaves just as stealthily as he had appeared, not making a sound\r\nas he walks off into the hallway. Lupin is left alone with only his\r\nthoughts and a newsprint picture of his best friend.\r\n\r\nThat same morning in the palace, the Archduke is speaking to Fujiko.\r\n\r\nArchduke: Well, Miss Fujiko, I appreciate you bringing me a member of\r\nLupin's gang. Excellent work, my dear. However, since Lupin was not\r\neliminated last night, I'm afraid I am at no obligation to pay you.\r\nFujiko: What do you mean? Lupin's plans are crippled! I have his diagrams\r\nand maps, I brought you his partner on a silver platter! What more do you\r\nwant?\r\nArchduke: I want you. out of the picture.\r\n\r\nFujiko feels a dart hit her in the arm, stinging her. She turns to see\r\nwhere it came from. It was a rifleman. the kind who uses tranquilizer\r\ndarts on animals. She removes the dart, but it is too late. The\r\nextra-strength tranquilizer within has begun to spread into her\r\nbloodstream. Fujiko feels dizzy as she turns to the Archduke.\r\n\r\nFujiko: You. monster.\r\n\r\n\r\n\r\nTalesoftheWolf@Juno.com\r\n\r\n\"Oh, yeah- he can sense danger. A POST-IT NOTE could sense danger better\r\nthan this guy!\"\r\n-Crow T. Robot, Mystery Science Theater 3000: While the hero\r\ntakes 30 seconds to \r\nrealize he's being chased by a quarterback-sized Aztec in the\r\nfilm \"The Puma Man\".\r\n\r\n___________________________________________________________________\r\nGet the Internet just the way you want it.\r\nFree software, free e-mail, and free Internet access for a month!\r\nTry Juno Web: http:\/\/dl.www.juno.com\/dynoget\/tagj.","message_date":"August 3 1999 1:30 AM"}