{"id":"70","author":"Lupin 7","subject":"Small Bald Lupin","body":"> >     I don't know if this is the game, but there was\r\n> > a game for the 8-bit NES system called McKids or\r\n> > something...?\r\n\r\nI own a Famicom but I've never heard of M.C. Kids; I am interested though, \r\nwhat is it about?\r\n\r\n>In a more on-topic note: Sorry, but it seems I jumped\r\n>ahead of myself in planning for my Thanksgiving Lupin\r\n>manga to be completed by Thanksgiving. Instead, I'm\r\n>working on some ideas for a Lupin III Christmas\r\n>Special story. I will, however, post the original\r\n>script for the Thanksgiving manga, along with some of\r\n>the incomplete sketches. That is, if there's any interest....\r\n>\r\n\r\nSounds interesting; I'm looking forward to it.\r\n\r\nSomeone had mentioned the Transformers; and since we're talking about the \r\nFamincom, one of the first games I bought for it was Transformers(it's ok). \r\nAlso; does anyone remember the old school Transformers? I happen to know \r\nthat they are rereleasing the toys in Japan soon, my brother saw an add for \r\nthem.\r\n\r\nAlso, on a manga related note; did you all know there was a piece of Manga \r\nreleased that was authored by Monkey punch in which the main character is \r\nLupin and Fujiko's Son? I kid you note(poor word choice). Heres the \r\ndescription my brother read off the comic he found the add in,\r\n\"Lupin Syozoy\/Kozoy by Monkey Punch\r\nThe father is Lupin, the Mother is Fujiko -\r\nSmall Bald Lupin(Bald like priest); he finds a hidden\r\nsecret map, with out really knowing were he is going, he goes on a trip to \r\nsearch for his father. \"\r\nhe wasn't sure about 'Syozoy' as he had to read it quickly. Maybe someone \r\nhere knows?\r\n\r\nIgnore me, I'm a ghost,\r\nhttp:\/\/lupin.sansei.st\/\r\n_____________________________________________________________________________________\r\nGet more from the Web.  FREE MSN Explorer download : http:\/\/explorer.msn.com\r\n","message_date":"November 22 2000 4:07 AM"}