{"id":"73","author":"Arsene Lupin III","subject":"[OT] AnimEigo and DVD- \"I'm huge!\"","body":"> \"M2K was responsible for the whole production of the\r\n> DVD.  Therefore, the \r\n> blame lies on them for not making things right.\"\r\n> \r\n> So basically it's ok to blame MB for a faulty\r\n> Kenshin dvd, despite the fact \r\n> that it was in a seperate authoring house, but\r\n> Animeigo should not be held \r\n> responsible.\r\n\r\nAnimEigo WAS responsible and took full credit for the\r\nerror and tried to repair it for them in every way\r\npossible. So you can't keep beating a dead horse.\r\nWhat's done is done. If you got a bad set (and from\r\nthe sound of things, you didn't even order one), I'm\r\nsure you sent it back for a replacement instead of\r\nkeeping it and whining about how AnimEigo didn't try\r\nto make it all better.\r\nAnd, if what you say is true, Media Blasters should be\r\nas responsible for Kenshin as AnimEigo is for the\r\noriginal Bubblegum Crisis DVD set. And AnimEigo\r\nbothered to rework it, fix the problems, and add a 4th\r\ndisc! If that's not dedication...!\r\nAnd by the way, when did anyone blame Media Blasters\r\nfor a faulty Kenshin? I don't see that mentioned\r\nanywhere before....\r\n\r\n> Now Animeigo promised the best, but MB\r\n> did not. \r\n\r\nDoes that mean we should not expect quality product to\r\nbe released? Especially for titles that deserve\r\nquality treatment!\r\n\r\n> Fans who bought \r\n> the UY set were stuck with what they could get. Fans\r\n> didn't immediately have \r\n> to buy Kenshin though. They could check to see how\r\n> the dvd was reviewed, so \r\n> they didn't get ripped off.\r\n> \r\n> \"Let's see, if Animeigo had decided to check the\r\n> final BGC project, that \r\n> means UY would have been delayed even more. Would\r\n> that\r\n> have made you happy?\"\r\n> \r\n> It would've showed more active participation and\r\n> dedication on their part, \r\n> instead of, \"Ship this and check for flaws later\".\r\n\r\nSomehow, I doubt that they ever said such a thing.\r\nI'll bet they said something more like \"We've tested\r\nthis in every way possible before pressing. Let's move\r\n'em out.\" Then they discovered the pressings went bad\r\non Disc 2, so they said, \"OK, we're stopping the\r\npresses, send 'em back if you got 'em, we'll fix them\r\nfor ya!\" Then the pressers WILLINGLY did the repress\r\nfor free and during the reprinting, they discovered\r\nthat the presser's electronic disc-checkers were still\r\nnot rejecting any discs, even bad ones. So they\r\nstopped them again, and started over. Then they sent\r\nout the reprints and, in doing so, finally charged\r\neveryone who preordered, except the people who paid by\r\ncheck or cash or whatever.\r\n\r\n> \"So, you wanted Animeigo to open each box and watch\r\n> each DVD?\"\r\n> \r\n> They could've at least seen how the process was\r\n> going on the sets, instead \r\n> of just taking M2k's word for it.\r\n\r\nWell, they have repaired the BGC problem too, so I'll\r\nignore this comment.\r\n\r\n> \"I and many others were lucky and got unblemished\r\n> sets.  Not all of the sets \r\n> pressed had the problems.\"\r\n> \r\n> And people who had bad sets had to ship them back to\r\n> Animeigo. So yes, they \r\n> paid for postage and packaging on top of it.\r\n\r\nBoo-hoo. Better than another $150, don't you think? Or\r\nnever being able to get a good reprint, which could\r\nvery well BE the case with CPM's Slayers box set?\r\n\r\n> \"When Animeigo learned that there was a problem,\r\n> they stopped shipment\r\n> immediately rather than deliver a potentially bad\r\n> product to their \r\n> customers.\"\r\n> \r\n> So it took longer for other people anyway.\r\n\r\nUnless I'm mistaken, this issue was easily rebuttled\r\nwith the line \"Good things come to those who wait.\"\r\nI'll amend that a bit: \" Awesome things come to those\r\nwho wait and maybe pay a few measley bucks for postage\r\nif they already got a not-so-awesome thing.\"\r\n\r\n> \"They didn't keep shipping and say \"Hey, live with\r\n> it.  We'll post a survey \r\n> to see if it should be fixed.\"\"\r\n> \r\n> Animeigo also had a specific group of fans who gave\r\n> out their names, \r\n> addresses, etc directly to the company. CPM doesn't\r\n> know who bought Slayers; \r\n> so CPM needed fan input to make sure that it was\r\n> worth their money.\r\n\r\nFan input, in this case, can be easily described as\r\n\"sales figures.\" While this does not tell us the EXACT\r\nnumber who were honestly dissatisfied with the set, it\r\nis quite a good ballpark figure, and CPM knows this,\r\nbut wants to see who would PAY MORE MONEY for a\r\nreplacement set. AnimEigo didn't ask for more money on\r\ntheir UY fixes, and M2K is the one asking any sum of\r\nmoney for their new BGC MegaSet using a trade-in. CPM,\r\nassuming they DO reprint them, will almost certainly\r\nask for a good $15-$30 on a trade-in setup. So, they\r\naren't willing to sacrifice near the amount AnimEigo\r\nmight have, had their presser not reprinted for free\r\n(as it was the presser's fault, not AnimEigo's).\r\n \r\n> Animeigo, on the other hand, had a specific\r\n> obligation to act on their \r\n> mistake, because they made a promise to fans that\r\n> they already screwed up.\r\n\r\nAnd they did, so quit beating on them, because they\r\nDID make restitution!\r\n \r\n> And on top of that, Animeigo screwed their promise\r\n> up twice.\r\n\r\nNo, they only did one disc recall, there was another\r\nerror (on the presser's side) that was never shipped,\r\nso you can't accuse AnimEigo for that one, on any\r\ngrounds.\r\n\r\n> CPM is supposed to be a faceless corporation\r\n\r\nWhoa, whoa, whoa, what now? So we can put labels on\r\nthem like this? Did CPM claim, \"We are the faceless\r\ncorporation\"? I don't think so... This is hardly an\r\nargument, since that is *purely* a matter of opinion,\r\nmore so than the rest of this.\r\n\r\n> while\r\n> Animeigo is supposed to \r\n> be the fans' company. Therefore, if Animeigo doesn't\r\n> take responsibility to \r\n> insure the quality of their future sets, then it\r\n> proves that they're just as \r\n> greedy as every other company.\r\n\r\nSo we can bug the crap out of them from here on out\r\nbecause they a small boo-boo, even though they put in\r\nmuch more effort to fix things than any other company\r\nwould have? They amend for it, and you say they're\r\nforever tarnished because of it? You can't hold this\r\none incident against them. I think it's safe to assume\r\nthat all future AnimEigo releases will be in pretty\r\ndarn good shape, and hopefully the first time around,\r\nas well.\r\n\r\n> \"They stopped immediately and demanded a brand new\r\n> pressing to make sure\r\n> those that didn't get their set would be able to get\r\n> a brand new pressing.  \r\n> Those that did get a bad set will get restitution.\"\r\n\r\nAnd the pressers offered to repress at no cost, which\r\nturned out to be very beneficial for them!\r\n\r\n> If you noticed, they only started checking each set\r\n> after the second \r\n> screw-up.\r\n\r\nThey must have found out somehow that there was a\r\nproblem the first time... and when they found out,\r\nthey said \"recall!\"\r\n\r\n> So I think asking them to check every set\r\n> shouldn't be too much of \r\n> a demand, since it'll make them responsible.\r\n\r\nSo once AnimEigo starts doing Ah! My Goddess and Rupan\r\nand Riding Bean, several fans should Email them and\r\nwrite them saying, \"Please don't screw ___ up like you\r\ndid Urusei Yatsura.\"?? I'm thinking they've learned\r\ntheir lesson after this ordeal, especially since they\r\nwere very responsible for UY. Much more so than CPM\r\nhas been with any product of theirs.\r\n\r\n> \"As for the delays in actual mastering, you're\r\n> obviously an impatient \r\n> person. Not only did they do a hell of a video\r\n> cleanup job, but they also \r\n> stopped replication from beginning (at the last\r\n> possible minute in one case) \r\n> because they discovered that the disc(s) would not\r\n> play on a specific player. That's dedication to\r\n> producing a great product. \r\n> They could have let it go on knowing a few obscure\r\n> players wouldn't play the \r\n> disc(s); instead, they stopped and decided to fix\r\n> the problem ahead of \r\n> time.\"\r\n> \r\n> If only they put that much effort in the final\r\n> product.\r\n\r\nExcuse me? What does that mean? The UY disc set came\r\nout to be spectacular for a DVD. They put in effort\r\nfor months trying to get UY to look and play\r\nfantastic, and they got it to work! It's great! It\r\nplays!\r\n\r\n> \"You wasted time maybe, but money is not wasted\r\n> because you will receive a \r\n> good set.\"\r\n> \r\n> Unless you got the bad set.\r\n\r\nNo, to properly requote: \"Money is not wasted because\r\nyou will recieve a good set, and if you got a BAD set,\r\nwe will GIVE you a good set for about 3 bucks\r\nshipping!\"\r\n\r\n> Well I think being patient means that you're gonna\r\n> get something good, not \r\n> something bad.\r\n\r\nAnd even if they had to wait a bit longer for it, fans\r\ngot something good... something VERY good.\r\n \r\n> No company's perfect. \r\n\r\nSo why do we blame the newer AnimEigo for making such\r\nan error on their first in-house developed title?\r\n\r\n> But CPM has gotten most of\r\n> their titles to work. And \r\n> they didn't have the hopes of fans riding on each of\r\n> their \r\n> shows\/oavs\/movies.\r\n\r\nCPM may have more titles, but they are of poorer\r\nquality, and can hardly be compared to the visual and\r\naudio splendor that I've heard the UY set described to\r\nbe.\r\n\r\n> \"Plus, they should know better than to post a survey\r\n> rather than fix the \r\n> problem post haste.\"\r\n\r\nIt's their reputation as an anime company on the line,\r\nthey can do what they please, but it's the fans who\r\nsuffer the most, though... be a wise consumer, that's\r\nall I can say.\r\n\r\n> Well the thing about Slayers is that it's going to\r\n> cost the same even if you \r\n> pre-ordered it. Yes, some places on the net will\r\n> give discounts on it, but \r\n> the discounts will still be valid even after the set\r\n> has arrived. So as a \r\n> fan, you can take the time to find out if it's in\r\n> good condition before you \r\n> buy it. With UY, the only way you're going to make a\r\n> good deal is by buying \r\n> the set. And if the set's in bad condition, then\r\n> you've just been ripped \r\n> off.\r\n\r\nHardly, how did you, or anyone else get \"ripped off\"?\r\nI'd say the Slayers box was a bigger rip-off by any\r\nmeans! sure, if you learn from other's mistakes by\r\nreading reviews, you can avoid the problem, but should\r\nCPM continue to tarnish their reputation by leaving\r\ngarbage product like that and A-ko on the market? (OK,\r\nA-ko wasn't their fault, but...) They should at least\r\ndo something about it, and if they don't, then they're\r\nthe ones who look bad, and it serves them right. If\r\nyou bought a bad Slayers set, and they don't remaster\r\nit, tough. What's done is done. It's the consumer's\r\nchoice to live with the purchase or not buy it at all.\r\nCPM made a semi-attempt to correct the error by using\r\nthe survey system. While not this does not guarantee a\r\nnew set will be put out by any means, AnimEigo\r\nimmediately promised us a reprint, they said \"You\r\ndon't have to accept this inferior product. Send 'em\r\nback and we'll send you nice new perfect ones that\r\nwill play on all DVD players.\" AnimEigo wants to keep\r\nthat great reputation as the \"Criterion of Anime\", as\r\nwell as its positive relationship with fans. CPM is\r\njust trying to keep up with the market, and in the\r\nprocess slipped a little. AnimEigo made no such\r\nattempt, and said \"be patient, good things will come.\"\r\nEven though you say \"but you have to spend postage and\r\nfor packaging!\" Wow, what is that? 3 or 4 dollars max?\r\nUnless I'm mistaken, that's well under the cost of\r\npurchasing the set over again after it was reprinted,\r\nisn't it? Would you rather they did that, and had\r\ninstead said, \"You don't have to accept this inferior\r\nproduct, but if you want a replacement, send us your\r\nold set as well as $149.95+shipping and handling.\" I'm\r\nsure that would have every UY fan simply tickled pink.\r\n\r\n> That's another thing. Woodhead should've started\r\n> small. He should've only \r\n> done the oavs and movies first, like Viz with Ranma.\r\n\r\nUm, and the Ranma 1\/2 DVDs had a good deal of problems\r\nthemselves, which is a major disappointment, coming\r\nfrom the near-masters of DVD, Pioneer.\r\n\r\n> Because now he's got \r\n> fans who are waiting forever, because they assume\r\n> that he's doing the best \r\n> job, when he really isn't.\r\n\r\nDo you own the set? Did you get that great set\r\neventually? Even with all the delays from bad sets?\r\nEven with having to send it back in? Did you watch it\r\nand say, \"Wow, this is really good quality, it was\r\nworth the wait!\"...??? I doubt it. Cagliostro was only\r\na so-so quality DVD with zero extras and no anamorphic\r\nvideo transfer, but we waited ages for it. So why do\r\nyou accuse AnimEigo of putting out \"bs\" when Manga has\r\ndone such a fine job on every disc EXCEPT their one\r\nLupin title (and Macross Plus disc 2)? Why does Manga\r\nget off the hook for putting out low-quality\r\nmaterial??\r\nBecause they didn't offer a pre-order option? What a\r\njoke! You can't use that excuse, because AnimEigo\r\ndidn't charge anyone squat until it was all done with!\r\n\r\n> Well MB blamed Kenshin's problems on it's Japanese\r\n> publisher.\r\n\r\nDoes that mean they *should*?\r\n\r\n> The reason ADV, Manga and CPM are blameless is\r\n> because they don't have other \r\n> people's money on the line!\r\n\r\nUm, may I note, as Luis did already, that AnimEigo did\r\nNOT charge a dime to a single person until the fixed\r\nbox sets were completed?\r\n\r\n> They offered the best deal through the net, making\r\n> you obligated to buy it \r\n> in box-set form.\r\n\r\nI fail to see how you are *obligated* to buy any\r\nentertainment product!\r\n\r\n> And they kept saying they were\r\n> working hard on it, when they really weren't.\r\n\r\nI'd say stopping the presses twice when they realized \r\nmistakes were made was dedication to a product, by all\r\nmeans.\r\n\r\nAnimEigo loves its customers, and realizes the true\r\npurpose of fan and product dedication more than many\r\nother anime companies. So, lighten up, will you? And,\r\nplease, stop the nonsense. I don't mind bugging Larry,\r\nbut now MY Email box is filling up pretty bad.\r\n\r\n\r\n\r\n=====\r\n\"Arsene Lupin III\"\r\nwebmaster@lupinthethird.nospam.com\r\n(Remove \"nospam\" to reply)\r\nhttp:\/\/www.LupintheThird.com\r\n\r\n__________________________________________________\r\nDo You Yahoo!?\r\nYahoo! Messenger - Talk while you surf!  It's FREE.\r\nhttp:\/\/im.yahoo.com\/","message_date":"October 20 2000 1:10 AM"}