{"id":"75","author":"DANIEL ZELTER","subject":"More Comments","body":"\"Or worse dub like Escaflowne *shiver*\" \r\nActually, I've been told that the Escaflowne dub is probably the best dub they could've gotten, considering it's network tv.  Changing the music was pretty gay, but at least Escaflowne seems to be doing well in video\/dvd sales cus of the promotion.\"Yep gotta love the cash cows. =)\" And the cows who play them. ^_-\r\n\r\n>I'm still waiting for Crouching Tiger Hidden Dragon to come out here myself.\r\n\r\n\"Yea thats something that I am looking forward to also. I wish that they would get it the hell over here and stop letting the New Yorkers have all the fun. =)\"\r\n\r\nI just saw it this weekend. It's going through a limited release like Mononoke, but unlike Mononoke, Sony will  expand it eventually. (I've been reading somewhere that it'll be mainstream by February.) It's been grossing the most as an art house film ($35,000 per screen), which surprises me considering how hard it is for Chow to get noticed like Jackie and Jet Li. It's gotten 6 awards in Hong Kong (or was it China?), 4 awards in L.A., and AICN claimed that had it entered the Cannes, it would've been picture of the year. And I don't blame them. It's not just a regular kung-fu flick, because it adds a taoist sensibility which makes each move seem like an art form. Oh, and for anyone else interested, this is the first HK film-being released by a mainstream distributor-which is SUBBED. Yes, no f'ed up wannabe British accents trying to speak incredibly fast. These are the real Cantonese voices :). (Though someone said there's M! ! andarin in there too, but I didn't notice.)\r\n\r\n\"As fun as that sounds..i am kinda worried about Jim Carrey playing Lupin....\"\r\n\r\nCould be worse. They could have Lou Diamond Philips as Goemon or Jigen heh. No, what would be worse is if they Chose Elizabeth Hurley as Fujiko. \r\n\r\n\r\n\r\n--------------------------------------------------------------------------------\r\nGet your FREE download of MSN Explorer at http:\/\/explorer.msn.com\r\n","message_date":"December 18 2000 4:33 PM"}