{"id":"82","author":"SPIKE77@aol.com","subject":"[lupin] Lupin the Third CD review part one (long)","body":"The Lupin CD collection review part 1\r\n\r\nHi. I've been collecting Lupin the Third for many years and have managed to \r\npick up almost everything that has come my way. Being American in Southern \r\nCalifornia certainly limits the amount of items you can find on Lupin (as \r\nopposed to Japan), but if you have the determination, it does benefit.\r\nOne of most accessible items (that can be completely appreciated, even \r\nwithout translation) is the Lupin CD soundtracks.\r\nThe Lupin the Third series has many, many cd's. Many, many,many.many.many \r\nCD's. It has series within series of CD's. This can be very confusing and if \r\nyou buy all them, they can be very expensive and very repititious. On average \r\nthe CD's cost 2500 yen (roughly $25), most can be bought online and most can \r\nbe ordered thru reliable services. But $25 for a CD where you can't even read \r\nthe track listings is a dangerous venture. Not to mention, each TV movie has \r\nspawned TWO separate soundtracks, seemingly indechiprable from eachother. \r\nWell, I've picked up quite a few of these. I have made some mistakes, had \r\nsome regrets, but mostly found some hidden Lupin treasure. I hope my reviews \r\ncan help anyone who is interested in purchasing a Lupin CD make a wise \r\ndecision.\r\n\r\nLUPIN THE THIRD JAZZ SERIES\r\n\r\nBrilliant composer Yuji Ohno not only composed most of Lupin's most memorable \r\nmusic, he is also a very accomplished Jazz musician. This is a very welcome \r\n(and successful) series that has had three parts released so far. The series \r\nis comprised of jazz re-workings of some of Lupin's most famous themes, each \r\nCD with a particular flavor. What makes it even more interesting to \r\nnon-japanese speaking folk is that all track listings are in english.\r\n\r\nLupin the Third Jazz CD 1: released 10\/21\/99 VPCG-84680\r\nPerformed by the Ohno Yuji Trio\r\nrunning time: 48:28\r\nTracks:\r\n1-Theme from Lupin the Third (full size version)\r\n2-O meu O mor\r\n3-Love theme\r\n4-members only\r\n5-Zenigata march\r\n6-Funny Walk\r\n7-Fire Treasure\r\n8-Manhattan Joke\r\n9-Love Squall\r\n\r\nThis is a GREAT cd. If you enjoy breezy, coffee-house style jazz this is the \r\nCD for you. It could even really interest non-Lupin enthusiasts. It contains \r\nno vocals, just slow, sparse moody arrangements. Fire Treasure is the \r\nbeautiful theme from Cagliostro, Manhattan Joke from the crapfest Legend of \r\nThe Gold Babylon and other recognizable themes. Most of the Lupin soundtracks \r\n(especially the most recent) sound dated and uninteresting, but this CD takes \r\nfamilar material and reworks it in a new and interesting way. A must buy.\r\n\r\n\r\nLupin the Third Jazz the Second: released 5\/24\/2000 VPCG-84702\r\nPerformed by the Ohno Yuji Trio (with guest vocalists)\r\nrunning time: 47:54\r\nTracks:\r\n1-Lupin the Third (theme from Lupin the Third)\r\n2-Bourbon Street Melody\r\n3-Take me (love squall)\r\n4-Deep night call\r\n5-Treasures of Time (Fire Treasure)\r\n6-He's Gone\r\n7-Stolen Moments (Love theme)\r\n8-Adios Santiago (But I'll never forget you)\r\n9-Cat Walk\r\n10-Heartbreak Journey\r\n\r\nWow!!! They topped the first CD. This is one of my FAVORITE Lupin CD's. It is \r\ncomprised of newer rearrangements of familar Lupin tracks with guest \r\nvocalists. 4 tracks have guest vocalists with re-written words SUNG IN \r\nENGLISH!!! Huh!!?? COOL!!! This TOTALLY feels like an american release CD and \r\nis certainly the most accessible. Besides the obvious (love squall, fire \r\ntreasure) it has other great Lupin themes like He's Gone from Hemmingway \r\nPapers. The best of the JAZZ series and is as good as the best Punch the \r\nMonkey.\r\n\r\nLupin the Third JAZZ the Third (Funky and Pop): released 3\/16\/01 VPCG-84728\r\nPerformed by the Ohno Yuji Trio\r\nrunning time: (approx) 50 min.\r\ntracks:\r\n1-Lupin the Third theme (funky and pop version)\r\n2-Woman from Memphis\r\n3-Treasures of Time\r\n4-Mayflower\r\n5-Tell me baby\r\n6-Zenigata rock\r\n7-The Third\r\n8-Hey Mr. Lucky\r\n9-Memory of smile\r\n\r\nWell, usually the third CD is a series feels forced and and unnecessary. This \r\nIS the case with the third Jazz series release. Though it's a little more \r\n'lively' than previous releases, it's fairly bland.\r\nMost of the compostions are unrecognizable from any Lupin TV show or film and \r\nthe ones that are don't feel re-worked enough to warrant a separate release.\r\n\r\nStay tuned for part two.\r\n\r\nSteve\r\n","message_date":"April 9 2001 11:11 PM"}