{"id":"85","author":"Maya .","subject":"hi there...","body":"Hi everyone, \r\n \r\n   I just wanted to say hello, introduce myself a little and hopefully learn a little more that i know now. First, my name is Maya. I'm twenty years old and i am a junior in college. I randomly ran into this mailing list online when i was doing a lupin search and decided to subsribe before i lost the site. (btw- i rarely capitalize my letters unless it is the beginning of a sentence... fair warning)\r\n  Anyways, i am writing because a couple of weeks ago i really, really, really, really wanted to join a mailing list of something i was interested in and the only thing i could come up with was lupin. I am fairly new to the anime thing. My friend introduce me to it sometime last year (She's only been at it two years but she has well over a hundred tapes.) Lupin, however was mentioned to me by my boyfriend. The only problem was that he explained it with this really goofy james bond analogy. So when my friend invited me to AWA 6 i took the opportunity to see Castle of Cagliostro. Okay, I was sold. Since then I have seen several different tapes including Napolean's Dictionary, In Memory of Walther p.38 and some others.\r\n  Other anime that i have had the chance to see includes Cowboy Bebop, Fushigi Yuugi, Clamp Campus Detectives, Kodomo no Omocha, Flame of Recca, Marmalade Boy, Gundam Wing, Tenchi Muyo, Vision of Escaflowne, and Princess Mononoke. Of course i have seen Dragon Ball Z as i am sure many people have but i prefer not to watch it if i can. Sorry that's just my opinion. \r\n  Okay, so i am not the best at keeping things short... why not perpetuate the stereotype... I'm a girl! And while i am at it i will perpetuate one more stereotype.... *gives puppy dog face* PLEASE PLEASE PLEASE talk to me... i really am enjoying learning more about anime and even though school sometimes kicks me real hard in the a**, i was kinda hoping to make it one of those enjoyable hobbies... \r\n  Okay, that will be the last time i write a long e-mail.... i think.\r\n \r\nBye and hope to hear from someone soon. maya\r\n\r\n\r\n--------------------------------------------------------------------------------\r\nGet your FREE download of MSN Explorer at http:\/\/explorer.msn.com\r\n","message_date":"January 29 2001 6:28 PM"}