{"id":"93","author":"Arsene Lupin III","subject":"Carl Macek and Lupin III.","body":"Well, I had so many questions in my mind about Lupin\r\nIII and how Streamline Pictures handled it, that I\r\nsimply had to ask them.\r\n\r\nThankfully, Robotech.com gave me that very\r\nopportunity.\r\n\r\nHere is the URL for the page if you want to see the\r\n3rd part of the fan interview, but his response (the\r\nimportant part) is below it:\r\n\r\nhttp:\/\/www.robotech.com\/news\/viewarticle.php?id=22\r\n----\r\nCarl Macek says: The first anime feature I saw as an\r\nadult was CASTLE OF CAGLIOSTRO - it was a key element\r\nin my decision to devote so much energy into working\r\nwith anime. The concept of \"wolf\", etc. was created to\r\nappease the film's rights' holders who feared that\r\nthere might be some fallout from the \"use' of Arsene\r\nLupin - it was a way to get the film into the market.\r\nLupine means wolf - so it seemed a natural choice -\r\nalso he is a \"wolf\" when it comes to the ladies.\r\nEventually the slow introduction of Lupin with out the\r\nreference to Arsene Lupin eventually came to pass. \r\n\r\n[Setup for his next response: someone on Usenet claims\r\nLupin's Streamline voice was Cam Clarke\/Jimmy\r\nFlinders, famous for roles in both Robotech and TMNT.\r\nI believed otherwise, and now I am proven right,\r\n*because*...]\r\n\r\nJimmy Flinders is not Bob Bergen[!] Bob Bergen is one\r\nof the finest voice actors working in Hollywood. He\r\nnot only does anime projects, he is the voice of some\r\nof America's most beloved cartoon characters - he is a\r\nwonderful actor who captured the joy and spirit of\r\nLupin with great skill and talent. \r\n\r\nI always loved the character, and I consider Monkey\r\nPunch - the creator of Lupin - a personal friend of\r\nmine. In a perfect world, I would have loved to\r\nbrought more Lupin to market. \r\n\r\n----\r\n\r\n\r\n\r\n=====\r\n\"Arsene Lupin III\"\r\nwebmaster@lupinthethird.nospam.com\r\n(Remove \"nospam\" to reply)\r\nhttp:\/\/www.LupintheThird.com\r\n\r\n__________________________________________________\r\nDo You Yahoo!?\r\nGet personalized email addresses from Yahoo! Mail - only $35 \r\na year!  http:\/\/personal.mail.yahoo.com\/\r\n","message_date":"June 2 2001 9:53 AM"}