{"id":"94","author":"Tobias W. Reich","subject":"Lupin III Japan DVDs ... (was: Walther disc!!)","body":"Hi,\r\n\r\n> As far as the Walther P38 disc is concerned, I have\r\n> never seen it myself. But given the quality of this\r\n> Castle Cagliostro disc, I'm sure it's pretty good\r\n> (I've not heard any video\/audio complaints about a\r\n> Japanese R2 DVD yet). On another note, I believe they\r\n> have released (in Japan, of course) all of the Lupin\r\n> the Third films on DVD except The Mystery of\r\n> Mamo\/Lupin III: The Movie.\r\n\r\n\r\nThere's seems to be some lack of information on this list right now,\r\nbut actually the situation in Japan is quite simple:\r\n\r\nVAP, the current rights holder of all the TV series, all Lupin III summer\r\nspecials and two movies (Dead or Alive & Nostradamus) has released these\r\ntwo movies as well as all 12 summer specials to DVD already.\r\n\r\nThe DVDs are lacking any extras (no english as well) and are taken from the\r\nanalog LD masters, in other works, they all look very much like their LD\r\ncounterparts (so they look good, but far from being as perfect as the Cagliostro\r\nDVD from Buena Vista).\r\n\r\nThe above mentioned 14 movie DVDs have been released between December 1999\r\n(Bye Bye Liberty) and October 2000 ($1mio Wars). Each of the discs does cost\r\n4800yen (~ $45).\r\n\r\nCagliostro (which was a Toho release back in the 80's) was released by Buena\r\nVista under the Ghibli ga ippai label as it was done by Miyazaki-san.\r\n\r\nWhat's missing to the DVD battleground right now are the other Toho releases,\r\nby names: (all've been available on Toho laserdiscs)\r\n\r\nMystery of Mamo (aka Lupin vs. the Clone)\r\nGold Babylon (Babiron no Oogon Densetsu)\r\nFuma Conspiracy (Fuuma Ichizoku Inbo)\r\n\r\nand the Secret Files which includes the gorgeous Lupin III pilot.\r\n\r\nToho doesn't have any plans at the moment to release it's anime back catalogue,\r\nbut I bet we'll see them all sometime in the future on DVD.\r\n\r\n\r\nGreetings, Tobias\r\nhttp:\/\/www.garden-of-war.de\r\n\r\n\r\nPS: sorry if I got the english titles slightly wrong...\r\n","message_date":"May 19 2001 1:56 PM"}