{"id":"95","author":"Arsene Lupin III","subject":"Re: New Da Capo of Love fan-sub and more","body":"\r\n> >I was thinking of temporarily reviving the\r\n> >news section of my website and adding a subsection,\r\n> >\"Liner Notes,\" where you could print out your own\r\n> >translation\/liner notes (in AnimEigo-esque fashion)\r\n> >for your fansubbed Lupin videos. For the\r\n> >anal-retentive in all of us. It was just a thought,\r\n> >dunno if I'll go through with it.\r\n> \r\n> Sounds like a fantastic idea.  I can think of a few\r\n> specials where that \r\n> would be helpful... eg.  The quicksand sequence in\r\n> Twilight Gemini.\r\n> \r\n> In a similar vein I've been working on a Lupin III\r\n> in English FAQ which \r\n> lists the known translations and also work in\r\n> progress by various groups.  \r\n> It's not ment to replace your review section but\r\n> acts as more of an updated \r\n> supplement (especially in your absence).  I can send\r\n> it to you or post it \r\n> directly here if anyone's interested in the FAQ so\r\n> far.\r\n\r\nNot a bad plan at all. I would suggest a Text-style\r\npost to the ML as well as a link to an HTML version\r\nonline.\r\n\r\n> Yikes!  Is this the new Region 2 DVD with supplement\r\n> disc or a new Region 1 \r\n> DVD? (I assume the former!).  Did they use a better\r\n> film master than the \r\n> faded theatrical print (complete with cigarette\r\n> burns for reel changes!) \r\n> that Manga was given?  What about the audio?\r\n\r\nYes, Region 2 with supplement disc. :D :D :D\r\nYes the film master is bright and beautiful! They even\r\ncleaned up a video error that was in the original\r\nmovie (more on that later). There are no black\r\ndots\/cigarette burns, and the picture is simply pure\r\nand crisp. The colors are NOT nearly as drained and\r\nfaded as they looked on the Manga Video DVD.\r\nHallelujah.\r\nThe Japanese and English audios (the good old\r\nStreamline Pictures dub) are both clean and crisp with\r\nalmost ZERO signs of age.\r\nThe English subtitles are based on the Carl Macek dub,\r\nso they are not an accurate translation, but are\r\ndesigned as an English-educational assistant, to be\r\nread while watching the English dub.\r\nOh! Disc 2 kicks butt. It has the complete movie\r\n(Japanese audio only), but with a twist: Angle 2 is\r\nALL the Hayao Miyazaki-drawn Storyboards!! Neat, huh?\r\nThe rest of the disc is just trailers though. Kiki's\r\nDelivery Service DVD, Sen to Chihiro no Kamikakushi\r\n(Miyazaki's new summer 2001 movie), Sherlock Hound\r\nDVD, and 2 Castle Cagliostro trailers (it's actually\r\none trailer, but it repeats once without words popping\r\nup on the screen).\r\n\r\nNow all I need is my own Region 2 or Region All player\r\nso I can watch it freely instead of mooching off\r\nfriends' DVD-ROMs and Apex AD-600A's!! Good thing I\r\nmade VHS copies of the English dub and the storyboards\r\nand trailers.\r\n\r\nAbout the \"fixed visual error\": At the end of the\r\nopening theme (Treasure of the Flame), Jigen and Lupin\r\nget into their Fiat and drive into the sunrise. As\r\nJigen opens his car door (in the old and new English\r\nversions), you can see his legs appear for a moment IN\r\nFRONT of the grass, while for the rest of the shot,\r\nhis legs are mostly hidden behind it. In the Disney\r\nRegion 2 DVD, they used TECHNOLOGY(!) and fixed the\r\nerror. Whether there had been a kick-butt master that\r\nhad already repaired this mistake, or if it was\r\nrecent, I don't know, but hey, I have no complaints!\r\n\r\nAnyway, it's good!! I hope Chris at AnimeonDVD.com\r\ngets with it and posts my review at some point. He did\r\npost my Region 1 Manga DVD review though....\r\n\r\n\r\n\r\n=====\r\n\"Arsene Lupin III\"\r\nwebmaster@lupinthethird.nospam.com\r\n(Remove \"nospam\" to reply)\r\nhttp:\/\/www.LupintheThird.com\r\n\r\n__________________________________________________\r\nDo You Yahoo!?\r\nYahoo! Auctions - buy the things you want at great prices\r\nhttp:\/\/auctions.yahoo.com\/\r\n","message_date":"May 18 2001 10:30 AM"}