{"id":"97","author":"Arsene Lupin III","subject":"Less commentary. More ranting.","body":"> Do you have any idea at which scenes that it\r\n> switches to P&S?  I've always \r\n> had the feeling that the english versions of the\r\n> flim have footage cut.  The \r\n> trailer for the film shows scenes of what presumably\r\n> is a Lupin clone coming \r\n> out of a wooden building, and a scene of race cars\r\n> colliding and exploding.  \r\n> Of course, it's routine for film trailers to use\r\n> footage that doesn't make \r\n> the final cut so maybe I'm barking up the wrong\r\n> tree. ;-)\r\n\r\nI believe the trailer scenes you're referring to come\r\nfrom a Second Series episode, and the first First\r\nSeries episode, respectively. They were spliced into\r\nthe film to add beef, I guess. There were no scenes\r\ncut from the English version of the film. Macek has\r\nnever removed a scene from an anime under his own free\r\nwill (barring the Cagliostro intro).\r\n\r\n> A friend of mine who works in the videogame industry\r\n> was looking into \r\n> liscencing Cliffhanger for play on Nuon-enhanced DVD\r\n> players.  Unfortunately \r\n> Taito in Japan and Stern Electronics in the USA have\r\n> little records or \r\n> materials that would help in reconstructing the\r\n> game.  It doesn't help that \r\n> the North American rights to Cagliostro and Mamo are\r\n> held by different \r\n> companies either.\r\n\r\nYeah that would put a damper on things, wouldn't it?\r\n\r\n> Heh.  Whats more amusing is that both Lupin and\r\n> Zenegata curse more than \r\n> Jigen in the original. Goeman's voice is what does\r\n> it for me, possibly worst \r\n> voice casting I've heard in some time.\r\n\r\nIn Streamline's dub, there are those that say\r\nClarisse's voice (sounds a bit old) and Lupin's voice\r\n(gasp! Blasphemers!) are pretty poorly cast, and that\r\nthe rest of Streamline's voice crew were almost\r\nequally bad. I disagree, and as I posted to RAMM\r\nrecently, almost all the voices (Goemon kinda sucked\r\nin this one too) were pretty well selected.\r\n\r\n>      The Streamline dub has always been lambasted\r\n> for 'dumbing down' the \r\n> original script.  Apart from a few clever things\r\n> dropped (mostly the \r\n> foreshadowing of the ending, and the connection of\r\n> goat money to the goat \r\n> archetecture and capran language [goat in latin]) I\r\n> think it holds up quite \r\n> well in retrospect compared to Manga's effort.\r\n\r\nEven Manga toyed with the \"goat\" concept. Often the\r\nline would change from \"Goat\" to \"Ram.\" For example,\r\nthe \"Sunwashed Ram on High,\" instead of the \"Goat that\r\nFaces East\/the Sun.\" If you break it down (which I\r\nhate to do because I really enjoy it), the Streamline\r\ndub was very, very inferior to the Japanese dialogue.\r\nBut as far as making the script \"fun,\" Macek did a\r\ngood job. Although, Goemon's \"asbestos suit\" line is\r\nstill highly questionable.\r\n\r\n> darn, I'm going to have to watch the dubs and subs\r\n> Cagliostro again.  Poor \r\n> me :-)\r\n\r\nI'm almost tempted to watch it myself. :D\r\n\r\n> >When I got the SF Alpha (OAV 1+2) DVD\r\n> >and saw the very clear picture, I oohed and awed,\r\n> but got bothered just a bit because it *didn't* have\r\n> >picture breakup like the VCD did.\r\n> \r\n> Why did that bother you?  I've always thought that\r\n> the worst thing you could \r\n> put on VCD is video with fine lines and fast\r\n> movement, something that anime \r\n> has quite a bit of.  For a while they thought DVD\r\n> would make animation look \r\n> worse based on the results with VCD but that appears\r\n> to not be the case.  I \r\n> guess it all depends on the quality of the source\r\n> material, the encoding \r\n> (including the repeated viewings to look for\r\n> errors), and player\/TV setup as \r\n> well.  Too many variables.\r\n\r\nOh no, I was just saying that I had gotten so used to\r\nthe horrible VCD picture that the clarity of the DVD\r\nwas almost irritating to my eyes.\r\n\r\n>I guess thats already happening.  Fujiko's Unlucky\r\n>Days is the first Lupin III to not have an LD\r\n>release.  The rest of the Lupin III specials have \r\n>been put onto DVD in a relatively short period of\r\n>time.  More Region 2 DVD's are being made with\r\n>english subtitles as well.\r\n\r\nWell actually the reason I mentioned this was a subtle\r\nhint for LGA, specifically, to catch up with the rest\r\nof the fansub world. Not to mock or patronize, just\r\nbeing an eager Lupin fanboy.\r\n\r\n>Is the meteorite explanation canonical? A few months\r\n>ago I compiled a history of the sword and only\r\n>encounted the metorite story in Luis' FAQ. The sword\r\n>history is very convoluted, and the Zantesuken\r\n>special only makes things worse.\r\n\r\nYeah I think it *might* be canonical, but there have\r\nbeen different approaches to the material. I suppose\r\nthe sword is kinda like \"Is Lupin really in love with\r\nFujiko?\" or Zenigata's relationship with Lupin. Every\r\nwriter\/director gets their own field day with Lupin\r\nIII. It depends on the tastes of the director in how\r\nsomething is explained. So in Zantetsuken's case, some\r\ndirector decided it should be made of something like\r\niridium (a metal found in meteorites). Another decided\r\nto treat it as any other sword, and is simply wielded\r\nby a skilled individual. All but the most basic of\r\nstory concepts are tossed around in Lupin tales.\r\nZantetsuken is probably just another one of them.\r\n\r\n>It's also significant that Lupin defeats Mamo in\r\n>Lupin vs the Clone by *not* using the cutting\r\n>properties of the blade, echoing the disorder of\r\n>Lupin's mind we see earlier in the film when he's\r\n>hooked up to the mind-reading machine.\r\n\r\nI'm a little confused how you came to this conclusion.\r\nIt seems like Lupin's mind is simply really smart and\r\nsneaky. I don't see why he should have a brain\r\ncompared to God's, much less a complete idiot's. So it\r\nseems logical that he would use it as a mirror to\r\nreflect Mamo's lasers. His mind isn't disorganized, in\r\nfact it's probably more organized than most\r\npeople....cause who would have thought of doing that\r\nwith the blade of Zantetsuken?\r\n\r\nI didn't know that Carl had so graciously allowed\r\nfansubbers to do that. It's too bad that Streamline\r\nhad just released Mystery of Mamo when they were\r\nswallowed up by Orion, we might have seen a fansub or\r\ntwo.\r\n\r\nStreamline was totally kicking when they sold their\r\nanime distribution rights to Orion. They wanted Orion\r\nto finish up some of their incomplete projects (Nadia,\r\n3x3 Eyes) while Streamline worked on other things.\r\nOrion never did complete them (although 2 new 3x3 Eyes\r\ntapes were made), and instead let the licenses run out\r\nfor several titles. One title that MGM picked up from\r\nOrion was Lupin III's Greatest Capers. Also, Image\r\nEnt. has the DVD rights to Mamo, but the disc remains\r\nout of print. Streamline eventually dumped anime\r\naltogether, and now they only do one thing that I know\r\nof: distribute the Robotech Soundtrack CD.\r\n\r\nThat will be all for now.\r\n\r\n\r\n\r\n=====\r\n\"Arsene Lupin III\"\r\nwebmaster@lupinthethird.nospam.com\r\n(Remove \"nospam\" to reply)\r\nhttp:\/\/www.LupintheThird.com\r\n\r\n__________________________________________________\r\nDo You Yahoo!?\r\nGet personalized email addresses from Yahoo! Mail - only $35 \r\na year!  http:\/\/personal.mail.yahoo.com\/\r\n","message_date":"June 13 2001 6:34 PM"}